status = -1;
var itemList = Array(
// ------ 椅子 ------
Array(3010941, 100, 1, 1), //阿卡伊農童話書椅子
Array(3010942, 100, 1, 1), //魔力皮卡啾
Array(3010943, 100, 1, 1), //殘暴炎魔的帝王椅子
Array(3010920, 100, 1, 1), //水晶月亮
Array(3010923, 100, 1, 1), //10週年椅子
Array(3010689, 100, 1, 1), //10週年椅子
Array(3010876, 100, 1, 1), //楓之谷行星椅子
Array(1302073, 300, 1, 1), //新加坡國旗（初學者）
Array(1302074, 300, 1, 1), //馬來西亞國旗（初學者）
Array(1302075, 300, 1, 1), //新加坡國旗（單手劍）
Array(1302076, 300, 1, 1), //馬來西亞國旗（單手劍）
Array(1312035, 300, 1, 1), //新加坡國旗（單手斧）
Array(1312036, 300, 1, 1), //馬來西亞國旗（單手斧）
Array(1322057, 300, 1, 1), //新加坡國旗（單手杖）
Array(1322058, 300, 1, 1), //馬來西亞國旗（單手杖）
Array(1332060, 300, 1, 1), //新加坡國旗（短劍）
Array(1332061, 300, 1, 1), //馬來西亞國旗（短劍）
Array(1382043, 300, 1, 1), //新加坡國旗（長杖）
Array(1382044, 300, 1, 1), //馬來西亞國旗（長杖）
Array(1402042, 300, 1, 1), //新加坡國旗（雙手劍）
Array(1412030, 300, 1, 1), //新加坡國旗（雙手斧）
Array(1412031, 300, 1, 1), //馬來西亞國旗（雙手斧）
Array(1422034, 300, 1, 1), //新加坡國旗（雙手杖）
Array(1432043, 300, 1, 1), //新加坡國旗（槍）
Array(1432044, 300, 1, 1), //馬來西亞國旗（槍）
Array(1442058, 300, 1, 1), //新加坡國旗（矛）
Array(1452049, 300, 1, 1), //新加坡國旗（弓）
Array(1452050, 300, 1, 1), //馬來西亞國旗（弓）
Array(1462044, 300, 1, 1), //新加坡國旗（弩）
Array(1462045, 300, 1, 1), //馬來西亞國旗（弩）
Array(1472059, 300, 1, 1), //新加坡國旗（指虎）
Array(1472060, 300, 1, 1), //馬來西亞國旗（指虎）
Array(3010824, 80, 1, 1), //水星椅子
Array(3010825, 140, 1, 1), //金星椅子
Array(3010826, 80, 1, 1), //地球椅子
Array(3010827, 80, 1, 1), //火星椅子
Array(3010828, 80, 1, 1), //木星椅子
//Array(3010832, 80, 1, 1), //太陽椅子
Array(3010217, 80, 1, 1), //香橙果凍布丁
Array(3010829, 180, 1, 1), //土星椅子
Array(3010830, 80, 1, 1), //天王星椅子
Array(3015263, 80, 1, 1), //海王星椅子
Array(3015236, 80, 1, 1), //海王星椅子
Array(3015272, 80, 1, 1), //海王星椅子
Array(3015304, 80, 1, 1), //海王星椅子
Array(3015257, 60, 1, 1), //海王星椅子
Array(3015303, 60, 1, 1), //海王星椅子
Array(3015315, 60, 1, 1), //海王星椅子
Array(3010729, 60, 1, 1), //海王星椅子
Array(3015268, 60, 1, 1), //海王星椅子
Array(3015267, 80, 1, 1), //海王星椅子
Array(3015271, 80, 1, 1), //海王星椅子
Array(3015269, 80, 1, 1), //海王星椅子
Array(3015270, 80, 1, 1), //海王星椅子
Array(3016101, 80, 1, 1), //海王星椅子
Array(3015328, 60, 1, 1), //海王星椅子
Array(3015344, 80, 1, 1), //海王星椅子
Array(3015338, 80, 1, 1), //海王星椅子
Array(3015338, 80, 1, 1), //海王星椅子
Array(3015312, 80, 1, 1), //海王星椅子
Array(3015029, 80, 1, 1), //海王星椅子
Array(3010831, 80, 1, 1), //海王星椅子
//Array(3020014, 100, 1, 1), //我來組成頭部
//Array(3020015, 100, 1, 1), //我來組成心臟
//Array(3020016, 100, 1, 1), //我來組成右臂
//Array(3020017, 100, 1, 1), //我來組成左臂
//Array(3020018, 100, 1, 1), //我來組成右腳
//Array(3020019, 100, 1, 1), //我來組成左腳
Array(3010300, 200, 1, 1), //橙色HP藥水椅子
Array(3010301, 200, 1, 1), //高級HP藥水椅子
Array(3010302, 100, 1, 1), //超級藥水椅子
Array(3010303, 100, 1, 1), //加肥抱抱椅
Array(3010304, 100, 1, 1), //惡魔綿羊椅子
Array(3010305, 200, 1, 1), //玫紅手柄座椅
Array(3010306, 100, 1, 1), //生如夏花椅子
Array(3010307, 50, 1, 1), //皮卡啾椅子
Array(3010311, 200, 1, 1), //黑龍椅子
Array(3010313, 200, 1, 1), //粉色殘暴炎魔椅子
Array(3010318, 200, 1, 1), //噢我的女皇
Array(5010042, 300, 1, 1), //小蜜蜂特效
Array(1112959, 300, 1, 1), //碟戀花特效
Array(2101001, 500, 1, 1), //蝙蝠魔召喚
Array(2100902, 500, 1, 1), //神秘召喚包
Array(2101004, 500, 1, 1), //綠水靈王召喚
Array(1012011, 500, 1, 1), //聖誕鹿的鼻子
Array(1012012, 500, 1, 1), //聖誕鹿的鼻子
Array(1012013, 500, 1, 1), //聖誕鹿的鼻子
Array(1012018, 500, 1, 1), //聖誕鹿的鼻子
Array(1012019, 500, 1, 1), //聖誕鹿的鼻子
Array(1012020, 500, 1, 1), //聖誕鹿的鼻子
Array(1012056, 500, 1, 1), //狗狗鼻
Array(1012058, 500, 1, 1), //匹諾曹的鼻子
Array(1012061, 500, 1, 1), //匹諾曹的鼻子
Array(1032026, 100, 1, 1), //黃水晶耳環
Array(1032027, 100, 1, 1), //黑水晶耳環
Array(1032028, 100, 1, 1) //紅水晶耳環
);

var itemList2 = Array(
Array(1032030, 200, 1, 1), //勇氣耳環
Array(1032031, 200, 1, 1), //永恆金盾墜
Array(1032032, 500, 1, 1), //秋葉耳環
Array(1032035, 500, 1, 1), //楓葉耳環
Array(1032040, 500, 1, 1), //楓葉型耳環,800,1,0), //初
Array(1032041, 500, 1, 1), //楓葉型耳環,800,1,0), //慶
Array(1032042, 500, 1, 1), //楓葉型耳環,800,1,0), //盛
Array(1032055, 500, 1, 1), //工作人員C的舊收信機
Array(1032056, 500, 1, 1), //工作人員C的舊收信機
Array(1032057, 500, 1, 0), //工作人員C的舊收信機
Array(1032058, 500, 1, 0), //工作人員C鈦質收信機
Array(1122001, 500, 1, 1), //綠色蝶形領結
Array(1122002, 500, 1, 1), //紅色蝶形領結
Array(1122003, 500, 1, 1), //黃色蝶形領結
Array(1122004, 500, 1, 1), //粉紅蝶形領結
Array(1122005, 500, 1, 1), //黑色蝶形領結
Array(1122006, 500, 1, 1), //藍色蝶形領結
Array(1122015, 500, 1, 1), //楓葉圍巾
Array(1122058, 100, 1, 1), //休彼德蔓的混沌項鏈
Array(1132000, 500, 1, 1), //白色腰帶
Array(1132001, 500, 1, 1), //黃色腰帶
Array(1132002, 500, 1, 1), //藍色腰帶
Array(1132003, 500, 1, 1), //紅色腰帶
Array(1132004, 450, 1, 1), //黑賀腰帶
Array(1132010, 500, 1, 1), //黃金豬豬腰帶
Array(1132011, 500, 1, 1), //黃金豬豬腰帶
Array(1132012, 500, 1, 1), //法老的腰帶
Array(1132013, 500, 1, 1), //不滅的法老腰帶
Array(1122074, 500, 1, 1), //楓葉吊墜
Array(1122075, 500, 1, 1), //黃金楓葉魔法吊墜
Array(1002390, 500, 1, 1), //真殘暴炎魔頭盔
Array(1002391, 500, 1, 0),  //海盜頭巾(綠)


// ------ 卷軸 ------
Array(2049002, 200, 1, 1), //白醫卷軸
Array(2340000, 200, 1, 1), //祝福卷軸
Array(2049300, 300, 1, 1), //高級裝備強化卷軸
Array(2049400, 300, 1, 1), //高級潛能附加卷軸
Array(2049401, 300, 1, 1), //潛能附加卷軸
Array(2049301, 300, 1, 1), //裝備強化卷軸
Array(2290285, 300, 1, 1), //神秘能手冊
Array(2049116, 300, 1, 1), //強化混沌卷軸
Array(2340000, 200, 1, 1), //祝福卷軸
Array(2049004, 200, 1, 1), //白醫卷軸—仙
Array(2290285, 300, 1, 1), //神秘能手冊
Array(2290285, 300, 1, 1), //神秘能手冊
Array(2049611, 200, 1, 1), //還原卷軸
Array(2700000, 300, 1, 1), //還原卷軸
Array(2047817, 300, 1, 1), //10週年極品雙手武器卷軸
Array(2046995, 300, 1, 1), //10週年極品單手武器卷軸
Array(2046876, 300, 1, 1), //10週年極品飾品卷軸
// ------ 特殊 ------
Array(1022097, 300, 1, 1), //龍眼鏡 - 含有龍的力量的眼鏡。
Array(1152054, 300, 1, 1), //完成的護肩
Array(1202004, 300, 1, 1), //詛咒殭屍-圖騰
Array(2040807, 100, 1, 1), //手套攻擊詛咒卷軸 - 成功率100%，物理攻擊力+3
Array(2043003, 100, 1, 1), //單手劍攻擊必成卷 - 
Array(2043103, 100, 1, 1), //單手斧攻擊必成卷 - 
Array(2043203, 100, 1, 1), //單手棍攻擊必成卷
Array(2043303, 100, 1, 1), //短劍攻擊必成卷 - 
Array(2613000, 200, 1, 1), //星火單手武器攻擊力卷軸 - 
Array(2613001, 200, 1, 1), //星火單手武器魔法力卷軸 - 
Array(2612010, 100, 1, 1), //星火雙手武器攻擊力卷軸 -
Array(2043703, 100, 1, 1), //短杖攻擊必成卷 -
Array(2043803, 100, 1, 1), //長杖攻擊必成卷 - 
Array(2044003, 100, 1, 1), //雙手劍攻擊必成卷 - 
Array(2044019, 100, 1, 1), //雙手劍魔力必成卷 - 
Array(2044203, 100, 1, 1), //雙手棍攻擊必成卷 -
Array(2044303, 100, 1, 1), //槍攻擊必成卷 - 為槍增加攻擊力屬性。\n成功率：10
Array(2044403, 100, 1, 1), //矛攻擊必成卷 - 為矛增加攻擊力屬性。\n成
Array(2044503, 100, 1, 1), //弓攻擊必成卷 - 為弓增加攻擊力屬性。\n
Array(2044603, 100, 1, 1), //弩攻擊必成卷 - 為弩增加攻擊力屬性。\n
Array(2044703, 100, 1, 1), //拳套攻擊必成卷 - 為拳套增加攻擊力屬性
Array(2044815, 100, 1, 1), //指虎攻擊必成卷 - 成功率:100%, 物理攻擊力+5, 力量+3, 物理防禦力+1
Array(2044908, 100, 1, 1), //火槍攻擊必成卷 - 成功率:100%, 物理攻擊力+5, 命中值+60, 敏捷+1
Array(2040303, 100, 1, 1), //耳環智力必成卷 - 為耳飾增加智力屬性。
Array(2040506, 100, 1, 1), //全身盔甲敏捷必成卷 - 為全身盔甲增加敏捷屬性。
Array(2040710, 300, 1, 1),  //鞋子跳躍必成卷 - 成功率:1 
Array(5062000, 200, 1, 1), //神奇方塊
Array(2432466, 400, 1, 1), //明日禮物箱子(銀)
Array(2290285, 300, 1, 1), //神秘能手冊
Array(2290285, 300, 1, 1), //神秘能手冊
Array(5064000, 200, 1, 1), //防爆卷軸
Array(2022800, 300, 1, 1), //心跳停止糖
Array(2022800, 300, 1, 1), //心跳停止糖
Array(2022800, 300, 1, 1), //心跳停止糖
Array(4310015, 300, 1, 1), //鬥神證物
Array(5220040, 200, 1, 1), //楓之谷轉蛋券
Array(5570000, 200, 1, 1), //金錘子
Array(5150040, 200, 1, 1), //皇家理發券
Array(5064100, 200, 1, 1), //保護卷軸
Array(5062002, 200, 1, 1), //高級神奇方塊
Array(5064300, 200, 1, 1), //卷軸防護卷軸
Array(2290096, 100, 1, 1), //[能手冊]楓之谷勇士 20
Array(2290125, 100, 1, 1), //[能手冊]楓之谷勇士 30
// ------ 卷軸 ------
Array(2000012, 600, 300, 1), //特殊藥水
Array(2000019, 600, 300, 1), //超級藥水
// 在線點為 61 - 180 的獎勵
Array(2022529, 300, 1, 1), //金達萊花語 - 金達萊的花語是愛。30分鐘內楓幣掉落率提高2倍。
Array(2022530, 300, 1, 1), //迎春花花語 - 迎春花的花語是希望。30分鐘內物品掉落率提高2倍。
Array(2022531, 300, 1, 1), //四葉草花語 - 四葉草的花語是幸運。1小時內物品掉落率提高2倍。

// ------ 玩具 ------
Array(1442018, 100, 1, 1), //凍凍魚
Array(1092022, 200, 1, 1), //調色板盾牌
Array(1322051, 200, 1, 1), //七夕
Array(1402044, 200, 1, 1), //南瓜燈籠
Array(1302087, 200, 1, 1), //火炬
Array(1422011, 300, 1, 1), //酒瓶
Array(1402029, 200, 1, 1), //鬼刺狼牙棒
Array(1302063, 200, 1, 1), //燃燒的火焰刀
Array(1322102, 200, 1, 1), //蛋糕大戰餡餅兵器
Array(1302084, 200, 1, 1), //火柴
Array(1402063, 200, 1, 1),  //櫻花傘
Array(1003797, 50, 1, 1),  //高貴劍士頭盔
Array(1003798, 50, 1, 1),  //高貴流丹維奇帽
Array(1003799, 50, 1, 1), //高貴遊俠貝雷帽
Array(1003800, 50, 1, 1),  //高貴刺客軟帽
Array(1003801, 50, 1, 1),  //高貴流浪者帽
Array(1042254, 50, 1, 1),  //鷹眼劍士盔甲
Array(1042255, 50, 1, 1),  //鷹眼丹維奇長袍
Array(1042257, 60, 1, 1),  //鷹眼刺客襯衣
Array(1042258, 60, 1, 1),  //鷹眼流浪者外衣
Array(1062165, 60, 1, 1),  //魔術師劍士短褲
Array(1062166, 60, 1, 1),  //魔術師丹維奇短褲
Array(1062167, 60, 1, 1),  //魔術師遊俠短褲
Array(1062168, 60, 1, 1),  //魔術師刺客短褲
Array(1062169, 60, 1, 1),  //魔術師流浪者短褲
Array(1132246, 30, 1, 1),  //最高級培羅德刻印腰帶
Array(1122267, 20, 1, 1),  //最高級培羅德刻印吊墜
Array(1032223, 30, 1, 1),  //最高級培羅德耳環
Array(1113075, 60, 1, 1),  //最高級培羅德戒指
Array(1212063, 60, 1, 1),  //法弗納魔力源泉杖
Array(1222058, 40, 1, 1),  //法弗納天使手銃
Array(1232057, 60, 1, 1),  //法弗納死亡使者
Array(1242060, 40, 1, 1),  //法弗納精神之刃
Array(1242061, 30, 1, 1),  //法弗納精神之刃
Array(1302275, 30, 1, 1),  //法弗納銀槲之劍   
Array(1312153, 40, 1, 1),  //法弗納雙刃切肉斧
Array(1322203, 30, 1, 1),  //法弗納戈耳迪錘
Array(1332225, 30, 1, 1),  //法弗納大馬士革劍
Array(1342082, 40, 1, 1),  //法弗納急速之刃   
Array(1362090, 30, 1, 1),  //法弗納洞察手杖
Array(1372177, 30, 1, 1),  //法弗納魔力奪取者
Array(1382208, 30, 1, 1),  //法弗納魔冠之杖   
Array(1402196, 30, 1, 1),  //法弗納懺悔之劍
Array(1412135, 30, 1, 1),  //法弗納戰鬥切肉斧  
Array(1422140, 30, 1, 1),  //法弗納閃電錘  
Array(1432167, 30, 1, 1),  //法弗納貫雷槍 
Array(1442223, 30, 1, 1),  //法弗納半月寬刃斧 
Array(1452205, 30, 1, 1),  //法弗納追風者
Array(1462193, 30, 1, 1),  //法弗納風翼弩   
Array(1472214, 30, 1, 1),  //法弗納危險之手
Array(1482168, 60, 1, 1),  //法弗納巨狼之爪
Array(1492179, 60, 1, 1),  //法弗納左輪槍
Array(1522094, 60, 1, 1),  //法弗納雙風翼弩
Array(1532098, 60, 1, 1),  //法弗納榮耀炮
Array(1152038, 60, 1, 1),  //堅韌皇家護肩
Array(1152039, 60, 1, 1),  //智慧皇家護肩
Array(1152040, 60, 1, 1),  //銳利皇家護肩
Array(1152041, 60, 1, 1),  //幸運皇家護肩
Array(1152046, 60, 1, 1),  //堅韌閃亮皇家護肩
Array(1152047, 60, 1, 1),  //智慧閃亮皇家護肩
Array(1152048, 60, 1, 1),  //銳利閃亮皇家護肩
Array(1152049, 60, 1, 1),  //幸運閃亮皇家護肩
Array(1152125, 60, 1, 1),  //皇家護肩
Array(1042255, 60, 1, 1),  //鷹眼丹維奇長袍
Array(1042256, 60, 1, 1),  //鷹眼遊俠斗篷

// ------ 暴君 ------
Array(1132174, 10, 1, 1),  //
Array(1132175, 30, 1, 1),  //
Array(1132176, 10, 1, 1),  //
Array(1132177, 10, 1, 1),  //
Array(1132178, 20, 1, 1),  //
Array(1102481, 20, 1, 1),  //
Array(1102482, 20, 1, 1),  //
Array(1102483, 10, 1, 1),  //
Array(1102484, 30, 1, 1),  //
Array(1102485, 10, 1, 1),  //
Array(1082543, 10, 1, 1),  //
Array(1082544, 20, 1, 1),  //
Array(1082545, 10, 1, 1),  //
Array(1082546, 10, 1, 1),  //
Array(1082547, 10, 1, 1),  //
Array(1072743, 10, 1, 1),  //
Array(1072744, 10, 1, 1),  //
Array(1072745, 10, 1, 1),  //
Array(1072746, 10, 1, 1),  //
Array(1072747, 10, 1, 1)  //
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用嗎？…我的肚子裡有各類#b奇特座椅或卷軸、暴君、新奇道具、蠟筆、新椅子#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 300);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        for (var i = 0; i < itemList2.length; i++) {
            if (itemList2[i][1] >= chance) {
                finalitem.push(itemList2[i]);
            }
        }
        if (finalitem.length != 0 && cm.getPlayer().getCSPoints(1)>=10000) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "大轉盤", notice);
            if (item != -1) {
        cm.gainNX(- 5000);
                cm.sendOk("你獲得了 #b#t" + item + "##k " + quantity + "個。");
            } else {
                cm.sendOk("請你確認在背包的裝備，消耗，其他窗口中是否有一格以上的空間。\r\n確認是否有5000樂豆點。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的運氣可真差，什麼都沒有拿到。\r\n");
           // cm.gainItem(4310030, 10); (獲得了安慰獎：運動會幣 x10。)
            cm.safeDispose();
        }
    }
}