
var SelText = Array(
                    Array ("初階指導",0,0,0),
                    Array ("中階指導",1,0,0),
                    Array ("高階指導",2,0,0)
                    );
var SeleTexts;
function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
  if (a >= 2 && mode != 1){
                    cm.openNpc(9000111);
    }else{
    if (mode == -1) {
        cm.openNpc(9000111);
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1){
        cm.openNpc(9000111);
        }else
        if (a == 0) {
                var selStr = "非常感謝來到傳奇楓之谷，這裡成就高手#b";
                for (var i = 0; i < SelText.length; i++) {
                    selStr += "\r\n#L" + i + "# "+ SelText[i][0] +"#l";
                }//for
                cm.sendSimple(selStr);
        }else if (a == 1){
            SeleTexts = selection;
            selection = SelText[SeleTexts][1];
            var Text = SelText[SeleTexts][0];
            var Texts = "指導員：\r\n#b小秘書（FAQ） >> "+ Text +"#k\r\n\r\n";
            a = -1;
            if (selection == 0){//為什麼可以在自由市場升級？    
Texts += "#b角色出生：#k\r\n1.遊戲中快捷功能請點擊->拍賣\r\n2.點擊拍賣->領取經驗->可以直接達到角色10級\r\n#r------------------------------------------------------#k\r\n#b角色等級LV 8：#k\r\n1.點擊拍賣->傳送到自由->找左邊的財神->可以轉職為魔法師\r\n#r------------------------------------------------------#k\r\n#b角色等級LV 10：#k\r\n0.點擊拍賣->萬能NPC->自動領取新玩家獎勵\r\n1.點擊拍賣->萬能NPC->等級獎勵->可以領取對應等級獎勵哦\r\n2.點擊拍賣->萬能NPC->萬能傳送->可以直接傳送到任務地圖\r\n3.點擊拍賣->萬能NPC->遊戲商店->購買武器 藥水 技能書\r\n4.點擊拍賣->萬能NPC->倉庫管理->任何地方能方便存取物品\r\n5.點擊拍賣->萬能NPC->樂豆點商店->購買遊戲中絕版點裝 道具\r\n6.點擊拍賣->萬能NPC->樂豆點中介->能方便與玩家交易樂豆點\r\n7.點擊拍賣->萬能NPC->儲值轉盤->能抽到極品稀有裝備道具\r\n8.點擊拍賣->傳送到自由->找左邊的財神->可以進行任何轉職\r\n9.點擊拍賣->傳送市場->找楓之谷管理員2->參與限時活動";
            }else if (selection == 1){//中階指導
Texts += "#b角色等級 LV 10-30：#k\r\n1.萬能傳送->傳送弓箭手村->孢子山丘->升級至10-30級\r\n2.點擊拍賣->萬能NPC->快速轉職->等級30可選擇第二次轉職\r\n3.點擊拍賣->查看怪物掉落->查看怪物是否掉落你職業裝備\r\n#r------------------------------------------------------#k\r\n#b角色等級 LV 30-60：#k\r\n1.萬能傳送->傳送天空之城->雲彩公園I->升級至30-50級\r\n2.萬能傳送->傳送天空之城->雲彩階梯I->升級至30-60級\r\n3.點擊拍賣->萬能NPC->快速轉職->等級60可選擇第三次轉職\r\n4.點擊拍賣->查看怪物掉落->查看怪物是否掉落你職業裝備\r\n#r------------------------------------------------------#k\r\n#b角色等級 LV 60-120：#k\r\n1.萬能傳送->練級傳送->神秘通道3->升級至60-100級\r\n2.萬能傳送->練級傳送->幽靈船2->升級至100-120級\r\n3.點擊拍賣->查看怪物掉落->查看怪物是否掉落你職業裝備\r\n4.點擊拍賣->查看怪物掉落->查看怪物是否掉落你職業技能書\r\n5.點擊拍賣->萬能NPC->快速轉職->等級100可選擇第四次轉職\r\n6.點擊拍賣->萬能NPC->等級送禮->領取90-149的等級獎勵\r\n#r------------------------------------------------------#k\r\n#b角色等級 LV 120-150：#k\r\n1.萬能傳送->傳送神木村->火焰死亡戰場->升級至120-130級\r\n2.萬能傳送->傳送神木村->隱藏的龍廟2->升級至130-150級\r\n3.點擊拍賣->查看怪物掉落->查看怪物是否掉落你職業裝備\r\n4.點擊拍賣->查看怪物掉落->查看怪物是否掉落你職業技能書\r\n5.點擊拍賣->萬能NPC->等級送禮->領取150-199的等級獎勵";
            }else if (selection == 2){//
Texts += "#b角色等級 LV 150-180：#k\r\n1.萬能傳送->練級傳送->死龍巢穴->升級150-180級\r\n2.萬能傳送->練級傳送->後悔之路5->升級至150-180級\r\n3.點擊拍賣->查看怪物掉落->查看怪物是否掉落你職業裝備\r\n4.點擊拍賣->查看怪物掉落->查看怪物是否掉落你職業技能書\r\n#r------------------------------------------------------#k\r\n#b角色等級 LV 180-250：#k\r\n1.副本傳送->挑戰各大BOSS->升級180-250級\r\n2.副本傳送->挑戰各大BOSS->可獲得豐富獎勵\r\n3.市場泡點->角色掛機市場->可獲得積分值 可兌換樂豆點 裝備\r\n4.萬能NPC->天天日常->完成各種日常活動 可兌換豐富獎勵\r\n5.萬能NPC->樂豆點商店->卷軸商店->潛能 強化 裝備\r\n6.萬能NPC->樂豆點商店->破功石頭->突破武器攻擊上限";
            }
            cm.sendNext(Texts);
        }//status
    }
}
}


