status = -1;
var itemList = Array(
// ------ 椅子 ------
Array(3010941, 100, 1, 1), //阿卡伊農童話書椅子
Array(3010942, 100, 1, 1), //魔力皮卡啾
Array(3010943, 100, 1, 1), //殘暴炎魔的帝王椅子
Array(3010920, 100, 1, 1), //水晶月亮
Array(3010923, 100, 1, 1), //10週年椅子
Array(3010689, 100, 1, 1), //10週年椅子
Array(3010876, 100, 1, 1), //楓之谷行星椅子
//Array(3010824, 80, 1, 1), //水星椅子
Array(3010825, 140, 1, 1), //金星椅子
Array(3010826, 80, 1, 1), //地球椅子
Array(3010827, 80, 1, 1), //火星椅子
Array(2431642, 80, 1, 1), //10W樂豆點盒子
//Array(3010828, 80, 1, 1), //木星椅子
//Array(3010832, 80, 1, 1), //太陽椅子
Array(3010217, 80, 1, 1), //香橙果凍布丁
Array(3010829, 180, 1, 1), //土星椅子
Array(3010830, 80, 1, 1), //天王星椅子
Array(3010831, 80, 1, 1), //海王星椅子
Array(3010651, 100, 1, 1), //楓之谷金剛（紅）
Array(3010652, 100, 1, 1), //楓之谷金剛（黑）
Array(3010653, 100, 1, 1), //楓之谷金剛（藍）
Array(3010654, 100, 1, 1), //楓之谷金剛（粉）
Array(3010655, 100, 1, 1), //楓之谷金剛（黃）
Array(3010656, 100, 1, 1), //楓之谷金剛（綠）
Array(3010300, 100, 1, 1), //橙色HP藥水椅子
Array(3010301, 100, 1, 1), //高級HP藥水椅子
Array(3010302, 100, 1, 1), //超級藥水椅子
Array(3010303, 100, 1, 1), //加肥抱抱椅
Array(3010304, 100, 1, 1), //惡魔綿羊椅子
Array(3010305, 100, 1, 1), //玫紅手柄座椅
Array(3010306, 100, 1, 1), //生如夏花椅子
Array(3010307, 100, 1, 1), //皮卡啾椅子
Array(3010311, 100, 1, 1), //黑龍椅子
Array(3010313, 100, 1, 1), //粉色殘暴炎魔椅子
Array(3010318, 100, 1, 1), //噢我的女皇
//Array(3994417, 200, 1, 1), //紅色蠟筆
Array(5010042, 300, 1, 1), //小蜜蜂特效
Array(1112959, 300, 1, 1), //碟戀花特效
//Array(4033647, 80, 1, 1), //大麗花
Array(4000313, 100, 1, 1), //黃金楓葉
//Array(3994418, 200, 1, 1), //橙色蠟筆
//Array(3994419, 200, 1, 1), //黃色蠟筆
//Array(3994420, 200, 1, 1), //綠色蠟筆
//Array(3994421, 200, 1, 1), //青色蠟筆
//Array(3994422, 200, 1, 1), //藍色蠟筆
//Array(3994423, 200, 1, 1), //紫色蠟筆

// ------ 特殊 ------
Array(1022097, 300, 1, 1), //龍眼鏡 - 含有龍的力量的眼鏡。
Array(1202004, 300, 1, 1), //詛咒殭屍-圖騰
Array(2040807, 100, 1, 1), //手套攻擊詛咒卷軸 - 成功率100%，物理攻擊力+3
Array(2043003, 100, 1, 1), //單手劍攻擊必成卷 - 
Array(2043103, 100, 1, 1), //單手斧攻擊必成卷 - 
Array(2043203, 100, 1, 1), //單手棍攻擊必成卷
Array(2043303, 100, 1, 1), //短劍攻擊必成卷 - 
Array(2043703, 100, 1, 1), //短杖攻擊必成卷 -
Array(2043803, 100, 1, 1), //長杖攻擊必成卷 - 
Array(2044003, 100, 1, 1), //雙手劍攻擊必成卷 - 
Array(2044019, 100, 1, 1), //雙手劍魔力必成卷 - 
Array(2044203, 100, 1, 1), //雙手棍攻擊必成卷 -
Array(2044303, 100, 1, 1), //槍攻擊必成卷 - 為槍增加攻擊力屬性。\n成功率：10
Array(2044403, 100, 1, 1), //矛攻擊必成卷 - 為矛增加攻擊力屬性。\n成
Array(2044503, 100, 1, 1), //弓攻擊必成卷 - 為弓增加攻擊力屬性。\n
Array(2044603, 100, 1, 1), //弩攻擊必成卷 - 為弩增加攻擊力屬性。\n
Array(2044703, 100, 1, 1), //拳套攻擊必成卷 - 為拳套增加攻擊力屬性
Array(2044815, 100, 1, 1), //指虎攻擊必成卷 - 成功率:100%, 物理攻擊力+5, 力量+3, 物理防禦力+1
Array(2044908, 100, 1, 1), //火槍攻擊必成卷 - 成功率:100%, 物理攻擊力+5, 命中值+60, 敏捷+1
Array(2040303, 100, 1, 1), //耳環智力必成卷 - 為耳飾增加智力屬性。
Array(2040506, 100, 1, 1), //全身盔甲敏捷必成卷 - 為全身盔甲增加敏捷屬性。
Array(2040710, 300, 1, 1),  //鞋子跳躍必成卷 - 成功率:1 
Array(2432466, 400, 1, 1), //明日禮物箱子(銀)
Array(2432466, 400, 1, 1), //明日禮物箱子(銀)
Array(2290096, 100, 1, 1), //[能手冊]楓之谷勇士 20
Array(2290125, 100, 1, 1), //[能手冊]楓之谷勇士 30
// ------ 玩具 ------
Array(1442018, 100, 1, 1), //凍凍魚
Array(1092022, 200, 1, 1), //調色板盾牌
Array(1322051, 200, 1, 1), //七夕
Array(1402044, 200, 1, 1), //南瓜燈籠
Array(1302087, 200, 1, 1), //火炬
Array(1422011, 300, 1, 1), //酒瓶
//Array(1402029, 200, 1, 1), //鬼刺狼牙棒
Array(1302063, 200, 1, 1), //燃燒的火焰刀
Array(1322102, 200, 1, 1), //蛋糕大戰餡餅兵器
Array(1302084, 200, 1, 1), //火柴
Array(1402063, 200, 1, 1),  //櫻花傘
Array(1003797, 60, 1, 1),  //高貴劍士頭盔
Array(1003798, 60, 1, 1),  //高貴流丹維奇帽
Array(1003799, 60, 1, 1), //高貴遊俠貝雷帽
Array(1003800, 60, 1, 1),  //高貴刺客軟帽
Array(1003801, 60, 1, 1),  //高貴流浪者帽
Array(1042254, 60, 1, 1),  //鷹眼劍士盔甲
Array(1042255, 60, 1, 1),  //鷹眼丹維奇長袍
Array(1042257, 60, 1, 1),  //鷹眼刺客襯衣
Array(1042258, 60, 1, 1),  //鷹眼流浪者外衣
Array(1062165, 60, 1, 1),  //魔術師劍士短褲
Array(1062166, 60, 1, 1),  //魔術師丹維奇短褲
Array(1062167, 60, 1, 1),  //魔術師遊俠短褲
Array(1062168, 60, 1, 1),  //魔術師刺客短褲
Array(1062169, 60, 1, 1),  //魔術師流浪者短褲
Array(1132246, 60, 1, 1),  //最高級培羅德刻印腰帶
Array(1122267, 60, 1, 1),  //最高級培羅德刻印吊墜
Array(1032223, 60, 1, 1),  //最高級培羅德耳環
Array(1113075, 60, 1, 1),  //最高級培羅德戒指
Array(1212063, 60, 1, 1),  //法弗納魔力源泉杖
Array(1222058, 60, 1, 1),  //法弗納天使手銃
Array(1232057, 60, 1, 1),  //法弗納死亡使者
Array(1242060, 60, 1, 1),  //法弗納精神之刃
Array(1242061, 60, 1, 1),  //法弗納精神之刃
Array(1302275, 60, 1, 1),  //法弗納銀槲之劍   
Array(1312153, 60, 1, 1),  //法弗納雙刃切肉斧
Array(1322203, 60, 1, 1),  //法弗納戈耳迪錘
Array(1332225, 60, 1, 1),  //法弗納大馬士革劍
Array(1342082, 60, 1, 1),  //法弗納急速之刃   
Array(1362090, 60, 1, 1),  //法弗納洞察手杖
Array(1372177, 60, 1, 1),  //法弗納魔力奪取者
Array(1382208, 60, 1, 1),  //法弗納魔冠之杖   
Array(1402196, 60, 1, 1),  //法弗納懺悔之劍
Array(1412135, 60, 1, 1),  //法弗納戰鬥切肉斧  
Array(1422140, 60, 1, 1),  //法弗納閃電錘  
Array(1432167, 60, 1, 1),  //法弗納貫雷槍 
Array(1442223, 60, 1, 1),  //法弗納半月寬刃斧 
Array(1452205, 60, 1, 1),  //法弗納追風者
Array(1462193, 60, 1, 1),  //法弗納風翼弩   
Array(1472214, 60, 1, 1),  //法弗納危險之手
Array(1482168, 60, 1, 1),  //法弗納巨狼之爪
Array(1492179, 60, 1, 1),  //法弗納左輪槍
Array(1522094, 60, 1, 1),  //法弗納雙風翼弩
Array(1532098, 60, 1, 1),  //法弗納榮耀炮
Array(1152038, 60, 1, 1),  //堅韌皇家護肩
Array(1152039, 60, 1, 1),  //智慧皇家護肩
Array(1152040, 60, 1, 1),  //銳利皇家護肩
Array(1152041, 60, 1, 1),  //幸運皇家護肩
Array(1152046, 60, 1, 1),  //堅韌閃亮皇家護肩
Array(1152047, 60, 1, 1),  //智慧閃亮皇家護肩
Array(1152048, 60, 1, 1),  //銳利閃亮皇家護肩
Array(1152049, 60, 1, 1),  //幸運閃亮皇家護肩
Array(1152125, 60, 1, 1),  //皇家護肩
Array(1042255, 60, 1, 1),  //鷹眼丹維奇長袍
Array(1042256, 30, 1, 1)  //鷹眼遊俠斗篷
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用嗎？…我的肚子裡有各類#b奇特座椅或卷軸、暴君、新奇道具、蠟筆、新椅子#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 300);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0 && cm.getPlayer().getCSPoints(1)>=20000) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "大轉盤", notice);
            if (item != -1) {
        cm.gainNX(- 20000);
                cm.sendOk("你獲得了 #b#t" + item + "##k " + quantity + "個。");
            } else {
                cm.sendOk("請你確認在背包的裝備，消耗，其他窗口中是否有一格以上的空間。\r\n確認是否有20000樂豆點。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的運氣可真差，什麼都沒有拿到。\r\n（或沒足夠的樂豆點）)");
            //cm.gainItem(4310030, 1);
            //cm.gainNX(- 5000);
            cm.safeDispose();
        }
    }
}