status = -1;
var head = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n";
var icon = "#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#";
var Star = "#fEffect/CharacterEff/1112904/2/1#";
/***************************************/
var cost = 100;  //每次消耗的HyPay額度
var itemList = Array(
Array(1182016, 100, 1, 1),
Array(1672069, 1, 1, 1),
//Array(1322255, 1, 1, 1),// 神秘之影錘 // (無描述)
//Array(1332279, 1, 1, 1),// 神秘之影匕首 // (無描述)
//Array(1342104, 1, 1, 1),// 神秘之影刃 // (無描述)
Array(1362140, 1, 1, 1),// 神秘之影手杖 // (無描述)
//Array(1372228, 1, 1, 1),// 神秘之影短杖 // (無描述)
Array(3015263, 250, 1, 1), //海王星椅子
Array(3010119, 250, 1, 1), //羊羊椅子    
Array(3015809, 250, 1, 1), //啾啾島椅子    
Array(3016203, 250, 1, 1), //夢幻旋轉木馬椅子    
Array(3015584, 250, 1, 1), //楓之谷主播椅子
Array(3015609, 250, 1, 1), //音樂盛典全明星椅子    
Array(3015529, 250, 1, 1), //我和小雞雞椅子    
Array(3015544, 250, 1, 1), //水晶冰河椅子    
Array(1003797, 50, 1, 3), //高貴劍士頭盔 - (無描述)
Array(1003798, 50, 1, 3), //高貴流丹維奇帽 - (無描述)
Array(1003799, 50, 1, 3), //高貴遊俠貝雷帽 - (無描述)
Array(1003800, 50, 1, 3), //高貴刺客軟帽 - (無描述)
Array(1003801, 50, 1, 3), //高貴流浪者帽 - (無描述)
Array(1042254, 50, 1, 3), //鷹眼劍士盔甲 - (無描述)
Array(1042255, 50, 1, 3), //鷹眼丹維奇長袍 - (無描述)
Array(1022226, 150, 1, 3), // 獨眼巨人之眼Lv.3 // (無描述)
Array(1102476, 150, 1, 3), // 諾巴西亞戴斯披風 // (無描述)
Array(1102477, 150, 1, 3), // 諾巴赫爾梅斯披風 // (無描述)
Array(1102478, 150, 1, 3), // 諾巴凱倫披風 // (無描述)
Array(1102479, 150, 1, 3), // 諾巴利卡昂披風 // (無描述)
Array(1102455, 150, 1, 3), // 諾巴阿爾泰披風 // (無描述)
Array(1072737, 150, 1, 3), // 諾巴西亞戴斯靴 // (無描述)
Array(1072738, 150, 1, 3), // 諾巴赫爾梅斯靴 // (無描述)
Array(1072739, 150, 1, 3), // 諾巴凱倫靴 // (無描述)
Array(1072740, 150, 1, 3), // 諾巴利卡昂靴 // (無描述)
Array(1072741, 150, 1, 3), // 諾巴阿爾泰靴 // (無描述)
Array(1042256, 50, 1, 3), //鷹眼遊俠斗篷 - (無描述)
Array(1042257, 50, 1, 3), //鷹眼刺客襯衣 - (無描述)
Array(1042258, 50, 1, 3), //鷹眼流浪者外衣 - (無描述)
Array(1062165, 50, 1, 3), //魔術師劍士短褲 - (無描述)
Array(1062166, 50, 1, 3), //魔術師丹維奇短褲 - (無描述)
Array(1062167, 50, 1, 3), //魔術師遊俠短褲 - (無描述)
Array(1062168, 50, 1, 3), //魔術師刺客短褲 - (無描述)
Array(1062169, 50, 1, 3),  //魔術師流浪者短褲 - (無描述)
//Array(2432069, 25, 1, 3),  //暴君自選
//Array(1102481, 10, 1, 3), // 暴君西亞戴斯披風 // (無描述)
Array(1102482, 25, 1, 3), // 暴君赫爾梅斯披風 // (無描述)
//Array(1102483, 10, 1, 3), // 暴君凱倫披風 // (無描述)
Array(1102484, 20, 1, 3), // 暴君利卡昂披風 // (無描述)
//Array(1102485, 25, 1, 3), // 暴君阿爾泰披風 // (無描述)
//Array(1072743, 10, 1, 3), // 暴君西亞戴斯靴 // (無描述)
Array(1072744, 50, 1, 3), // 暴君赫爾梅斯靴 // (無描述)
//Array(1072745, 10, 1, 3), // 暴君凱倫靴 // (無描述)
Array(1072746, 25, 1, 3), // 暴君利卡昂靴 // (無描述)
//Array(1072747, 25, 1, 3), // 暴君阿爾泰靴 // (無描述)
Array(1132174, 10, 1, 3), // 暴君西亞戴斯腰帶 // (無描述)
Array(1132175, 50, 1, 3), // 暴君赫爾梅斯腰帶 // (無描述)
//Array(1132176, 10, 1, 3), // 暴君凱倫腰帶 // (無描述)
Array(1132177, 25, 1, 3),// 暴君利卡昂腰帶 // (無描述)
//Array(1132178, 25, 1, 3),// 暴君阿爾泰腰帶 // (無描述)
Array(1082543, 10, 1, 3), // 暴君西亞戴斯手套 // (無描述)
//Array(1082544, 25, 1, 3), // 暴君赫爾梅斯手套 // (無描述)
Array(1082545, 10, 1, 3), // 暴君凱倫手套 // (無描述)
//Array(1082546, 25, 1, 3),// 暴君利卡昂手套 // (無描述)
Array(1082547, 25, 1, 3),// 暴君阿爾泰手套 // (無描述)
//Array(1004810, 10, 1, 3),// 神秘之影弓箭手帽 // (無描述)
Array(1004808, 10, 1, 3),// 神秘之影劍士帽 // (無描述)
Array(1342101, 10, 1, 3),// 埃蘇萊布斯之刃 // (無描述)
Array(1412177, 10, 1, 3),// 埃蘇萊布斯大斧 // (無描述)
Array(1422184, 10, 1, 3),// 埃蘇萊布斯大錘 // (無描述)
Array(1552110, 10, 1, 3),// 埃蘇萊布斯扇子 // (無描述)
Array(1052882, 10, 1, 3),// 埃蘇萊布斯騎士套裝 // (無描述)
Array(1073032, 10, 1, 3),// 埃蘇萊布斯法師鞋 // (無描述)
Array(1073035, 10, 1, 3),// 埃蘇萊布斯海盜鞋 // (無描述)
Array(1102794, 10, 1, 3),// 埃蘇萊布斯魔法師披風// (無描述)
//Array(1004809, 1, 1, 3),// 神秘之影法師帽 // (無描述)
//Array(1004811, 1, 1, 3),// 神秘之影盜賊帽 // (無描述)
//Array(1004812, 1, 1, 3),// 神秘之影海盜帽 // (無描述)
//Array(1102940, 1, 1, 3),// 神秘之影劍士披風 // (無描述)
//Array(1102941, 1, 1, 3),// 神秘之影法師披風 // (無描述)
//Array(1102942, 1, 1, 3),// 神秘之影弓箭手披風 // (無描述)
//Array(1102943, 1, 1, 3),// 神秘之影盜賊披風 // (無描述)
//Array(1102944, 1, 1, 3),// 神秘之影海盜披風 // (無描述)
//Array(1082695, 1, 1, 3),// 神秘之影劍士手套 // (無描述)
//Array(1082696, 1, 1, 3),// 神秘之影法師手套 // (無描述)
//Array(1082697, 1, 1, 3),// 神秘之影弓箭手手套 // (無描述)
//Array(1082698, 1, 1, 3),// 神秘之影盜賊手套 // (無描述)
Array(1082699, 1, 1, 3),// 神秘之影海盜手套 // (無描述)
//Array(1053063, 1, 1, 3),// 神秘之影劍士套裝 // (無描述)
//Array(1053064, 1, 1, 3),// 神秘之影法師套裝 // (無描述)
//Array(1053065, 1, 1, 3),// 神秘之影弓箭手套裝 // (無描述)
Array(1053066, 1, 1, 3),// 神秘之影盜賊套裝 // (無描述)
//Array(1053067, 1, 1, 3),// 神秘之影海盜套裝 // (無描述)
//Array(1073158, 1, 1, 3),// 神秘之影劍士鞋 // (無描述)
//Array(1073159, 1, 1, 3),// 神秘之影法師鞋 // (無描述)
//Array(1073160, 1, 1, 3),// 神秘之影弓箭手鞋 // (無描述)
//Array(1073161, 1, 1, 3),// 神秘之影盜賊鞋 // (無描述)
//Array(1073162, 1, 1, 3),// 神秘之影海盜鞋 // (無描述)
//Array(1152196, 1, 1, 3),// 神秘之影劍士護肩 // (無描述)
//Array(1152197, 1, 1, 3),// 神秘之影法師護肩 // (無描述)
//Array(1152198, 1, 1, 3),// 神秘之影弓箭手護肩 // (無描述)
//Array(1152199, 1, 1, 3),// 神秘之影盜賊護肩 // (無描述)
Array(1152200, 1, 1, 3),// 神秘之影海盜護肩 // (無描述)
Array(1212120, 1, 1, 3),// 神秘之影閃亮克魯 // (無描述)
Array(1222113, 10, 1, 3),// 神秘之影靈魂射手 // (無描述)
//Array(1232113, 10, 1, 3),// 神秘之影魔劍 // (無描述)
Array(1242121, 10, 1, 3),// 神秘之影能量劍// (無描述)
//Array(1242122, 10, 1, 3),// 神秘之影能量劍 // (無描述)
//Array(1262039, 10, 1, 3),// 神秘之影ESP限製器 // (無描述)
//Array(1302343, 10, 1, 3),// 神秘之影單手劍 // (無描述)
Array(1312203, 1, 1, 3),// 神秘之影斧 // (無描述)
//Array(1382265, 1, 1, 3),// 神秘之影長杖 // (無描述)
//Array(1402259, 1, 1, 3),// 神秘之影雙手劍 // (無描述)
//Array(1412181, 1, 1, 3),// 神秘之影雙手戰斧 // (無描述)
Array(1022226, 150, 1, 3), // 獨眼巨人之眼Lv.3 // (無描述)
Array(1102476, 150, 1, 3), // 諾巴西亞戴斯披風 // (無描述)
Array(1102477, 150, 1, 3), // 諾巴赫爾梅斯披風 // (無描述)
Array(1102478, 150, 1, 3), // 諾巴凱倫披風 // (無描述)
Array(1102479, 150, 1, 3), // 諾巴利卡昂披風 // (無描述)
Array(1102455, 150, 1, 3), // 諾巴阿爾泰披風 // (無描述)
Array(1072737, 150, 1, 3), // 諾巴西亞戴斯靴 // (無描述)
Array(1072738, 150, 1, 3), // 諾巴赫爾梅斯靴 // (無描述)
Array(1072739, 150, 1, 3), // 諾巴凱倫靴 // (無描述)
Array(1072740, 150, 1, 3), // 諾巴利卡昂靴 // (無描述)
Array(1072741, 150, 1, 3), // 諾巴阿爾泰靴 // (無描述)
Array(1422189, 1, 1, 3),// 神秘之影雙手錘 // (無描述)
//Array(1432218, 1, 1, 3),// 神秘之影長槍 // (無描述)
//Array(1442274, 1, 1, 3),// 神秘之影矛 // (無描述)
//Array(1452257, 1, 1, 3),// 神秘之影弓 // (無描述)
//Array(1462243, 1, 1, 3),// 神秘之影弩 // (無描述)
//Array(1472265, 1, 1, 3),// 神秘之影拳套 // (無描述)
//Array(1482221, 1, 1, 3),// 神秘之影指虎 // (無描述)
//Array(1492235, 1, 1, 3),// 神秘之影火槍 // (無描述)
//Array(1522143, 1, 1, 3),// 神秘之影雙弩槍 // (無描述)
//Array(1532150, 1, 1, 3),// 神秘之影攻城炮 // (無描述)
//Array(1582023, 1, 1, 3),// 神秘之影機甲槍 // (無描述)
//Array(1542117, 1, 1, 3),// 神秘之影太刀 // (無描述)
//Array(1552119, 1, 1, 3),// 神秘之影扇子 // (無描述)
//Array(1252098, 1, 1, 3),// 神秘之影魔法槌 // (無描述)
/*卷軸*/
Array(1712000, 800, 1, 3),//神秘徽章
Array(1712000, 800, 1, 3),//神秘徽章
Array(1712000, 800, 1, 3),//神秘徽章
Array(1022226, 150, 1, 3), // 獨眼巨人之眼Lv.3 // (無描述)
Array(1102476, 150, 1, 3), // 諾巴西亞戴斯披風 // (無描述)
Array(1102477, 150, 1, 3), // 諾巴赫爾梅斯披風 // (無描述)
Array(1102478, 150, 1, 3), // 諾巴凱倫披風 // (無描述)
Array(1102479, 150, 1, 3), // 諾巴利卡昂披風 // (無描述)
Array(1102455, 150, 1, 3), // 諾巴阿爾泰披風 // (無描述)
Array(1072737, 150, 1, 3), // 諾巴西亞戴斯靴 // (無描述)
Array(1072738, 150, 1, 3), // 諾巴赫爾梅斯靴 // (無描述)
Array(1072739, 150, 1, 3), // 諾巴凱倫靴 // (無描述)
Array(1072740, 150, 1, 3), // 諾巴利卡昂靴 // (無描述)
Array(1072741, 150, 1, 3), // 諾巴阿爾泰靴 // (無描述)
Array(1712000, 800, 1, 3),//神秘徽章
Array(1712000, 800, 1, 3),//神秘徽章
Array(1712000, 800, 1, 3),//神秘徽章
Array(1712000, 800, 1, 3),//神秘徽章
Array(1712001, 200, 1, 3),//神秘徽章
Array(1712002, 200, 1, 3),//神秘徽章
Array(1712003, 200, 1, 3),//神秘徽章
Array(1022226, 150, 1, 3), // 獨眼巨人之眼Lv.3 // (無描述)
Array(1102476, 150, 1, 3), // 諾巴西亞戴斯披風 // (無描述)
Array(1102477, 150, 1, 3), // 諾巴赫爾梅斯披風 // (無描述)
Array(1102478, 150, 1, 3), // 諾巴凱倫披風 // (無描述)
Array(1102479, 150, 1, 3), // 諾巴利卡昂披風 // (無描述)
Array(1102455, 150, 1, 3), // 諾巴阿爾泰披風 // (無描述)
Array(1072737, 150, 1, 3), // 諾巴西亞戴斯靴 // (無描述)
Array(1072738, 150, 1, 3), // 諾巴赫爾梅斯靴 // (無描述)
Array(1072739, 150, 1, 3), // 諾巴凱倫靴 // (無描述)
Array(1072740, 150, 1, 3), // 諾巴利卡昂靴 // (無描述)
Array(1072741, 150, 1, 3), // 諾巴阿爾泰靴 // (無描述)
Array(2048821, 100, 1, 3),// V寵物裝備攻擊力卷// (無描述)
Array(2048822, 100, 1, 3),// V寵物裝備魔力卷軸    // (無描述)
Array(1032224, 150, 1, 3), // 漩渦耳環 // (無描述)
Array(1122269, 150, 1, 3), // 漩渦吊墜 // (無描述)
Array(1132247, 150, 1, 3), // 漩渦腰帶 // (無描述)
Array(1152160, 150, 1, 3), // 漩渦護肩 // (無描述)
Array(1003976, 150, 1, 3), // 漩渦帽子 // (無描述)
Array(1102623, 150, 1, 3), // 漩渦披風 // (無描述)
Array(1082556, 150, 1, 3), // 漩渦手套 // (無描述)
Array(1052669, 150, 1, 3), // 漩渦皇家外套 // (無描述)
Array(1072870, 150, 1, 3), // 漩渦鞋 // (無描述)
Array(1212089, 150, 1, 3), // 漩渦閃亮克魯 // (無描述)
Array(1222084, 150, 1, 3), // 漩渦靈魂射手 // (無描述)
Array(1232084, 150, 1, 3), // 漩渦惡魔劍 // (無描述)
Array(1242090, 150, 1, 3), // 漩渦鎖鏈劍 // (無描述)
Array(1252033, 150, 1, 3), // 漩渦虎梳魔法棒 // (無描述)
Array(1302297, 350, 1, 3), // 漩渦劍 // (無描述)
Array(1312173, 350, 1, 3), // 漩渦斧 // (無描述)
Array(1322223, 350, 1, 3), // 漩渦錘 // (無描述)
Array(1332247, 350, 1, 3), // 漩渦匕首 // (無描述)
Array(1342090, 350, 1, 3), // 漩渦刀  // (無描述)
Array(1362109, 350, 1, 3), // 漩渦手杖 // (無描述)
Array(1372195, 350, 1, 3), // 漩渦短杖 // (無描述)
Array(1382231, 350, 1, 3), // 漩渦長杖 // (無描述)
Array(1402220, 350, 1, 3), // 漩渦雙手劍 // (無描述)
Array(1412153, 350, 1, 3), // 漩渦雙手戰斧 // (無描述)
Array(1422158, 150, 1, 3), // 漩渦巨錘 // (無描述)
Array(1432187, 350, 1, 3), // 漩渦矛 // (無描述)
Array(1442242, 350, 1, 3), // 漩渦戟 // (無描述)
Array(1452226, 350, 1, 3), // 漩渦弓 // (無描述)
Array(1462213, 150, 1, 3), // 漩渦弩 // (無描述)
Array(1472235, 150, 1, 3), // 漩渦拳甲 // (無描述)
Array(1482189, 150, 1, 3), // 漩渦衝拳 // (無描述)
Array(1492199, 150, 1, 3), // 漩渦手銃 // (無描述)
Array(1522113, 150, 1, 3), // 漩渦雙翼弩 // (無描述)
Array(1532118, 150, 1, 3), // 漩渦手炮 // (無描述)
Array(1542072, 150, 1, 3), // 漩渦武士之劍 // (無描述)
Array(1552072, 150, 1, 3), // 漩渦之風 // (無描述)
Array(2049371, 200, 1, 3),//星之力17星強化券
Array(2049376, 1, 1, 3),//星之力20星強化券
Array(2049387, 100, 1, 3),//星之力18星強化券
Array(2049388, 10, 1, 3),//星之力19星強化券
//Array(2432022, 1, 1, 3),//拍賣場專屬使用券
Array(2570002, 1, 1, 3),//專屬紫金楓葉羽毛
Array(2435719, 200, 100, 3),//5轉技能核心
Array(2430209, 1, 3, 3),//龍紋紅包
Array(2430209, 100, 2, 3),//龍紋紅包
Array(2430209, 200, 1, 3),//龍紋紅包
Array(2430210, 200, 10, 3),//新年紅包
Array(2430210, 200, 9, 3),//新年紅包
Array(243021, 200, 8, 3),//新年紅包
Array(243021, 200, 7, 3),//新年紅包
Array(243021, 200, 6, 3),//新年紅包
Array(243021, 200, 5, 3),//新年紅包
Array(243021, 200, 5, 3),//新年紅包
Array(243021, 200, 5, 3),//新年紅包
Array(243021, 200, 5, 3),//新年紅包
Array(243021, 200, 5, 3),//新年紅包
Array(243021, 200, 4, 3),//新年紅包
/*160裝備*/
Array(1012438, 150, 1, 3) // 漩渦文身 // (無描述)
);

var itemList2 = Array(
/*極真裝備*/
Array(1032223, 50, 1, 3), // 最高級培羅德耳環 // (無描述)
Array(1113075, 50, 1, 3), // 最高級培羅德戒指 // (無描述)
//Array(1122267, 50, 1, 3), // 最高級培羅德刻印吊墜 // (無描述)
Array(1132246, 50, 1, 3), // 最高級培羅德刻印腰帶 // (無描述)
Array(1032219, 50, 1, 3), // 遺忘之神話耳環 // (無描述)
Array(1022226, 50, 1, 3), // 獨眼巨人之眼Lv.3 // (無描述)
Array(1102476, 150, 1, 3), // 諾巴西亞戴斯披風 // (無描述)
Array(1102477, 150, 1, 3), // 諾巴赫爾梅斯披風 // (無描述)
Array(1102478, 150, 1, 3), // 諾巴凱倫披風 // (無描述)
Array(1102479, 150, 1, 3), // 諾巴利卡昂披風 // (無描述)
Array(1102455, 150, 1, 3), // 諾巴阿爾泰披風 // (無描述)
Array(1072737, 150, 1, 3), // 諾巴西亞戴斯靴 // (無描述)
Array(1072738, 150, 1, 3), // 諾巴赫爾梅斯靴 // (無描述)
Array(1072739, 150, 1, 3), // 諾巴凱倫靴 // (無描述)
Array(1072740, 150, 1, 3), // 諾巴利卡昂靴 // (無描述)
Array(1072741, 150, 1, 3), // 諾巴阿爾泰靴 // (無描述)
Array(1132169, 150, 1, 3), // 諾巴西亞戴斯腰帶 // (無描述)
Array(1132170, 150, 1, 3), // 諾巴赫爾梅斯腰帶 // (無描述)
Array(1132171, 150, 1, 3), // 諾巴凱倫腰帶 // (無描述)
Array(1132172, 150, 1, 3), // 諾巴利卡昂腰帶 // (無描述)
Array(1132173, 150, 1, 3), // 諾巴阿爾泰腰帶 // (無描述)
Array(1032219, 150, 1, 3), // 遺忘之神話耳環 // (無描述)
Array(1022226, 150, 1, 3), // 獨眼巨人之眼Lv.3 // (無描述)
Array(1102476, 150, 1, 3), // 諾巴西亞戴斯披風 // (無描述)
Array(1102477, 150, 1, 3), // 諾巴赫爾梅斯披風 // (無描述)
Array(1102478, 150, 1, 3), // 諾巴凱倫披風 // (無描述)
Array(1102479, 150, 1, 3), // 諾巴利卡昂披風 // (無描述)
Array(1102455, 150, 1, 3), // 諾巴阿爾泰披風 // (無描述)
Array(1072737, 150, 1, 3), // 諾巴西亞戴斯靴 // (無描述)
Array(1072738, 150, 1, 3), // 諾巴赫爾梅斯靴 // (無描述)
Array(1072739, 150, 1, 3), // 諾巴凱倫靴 // (無描述)
Array(1072740, 150, 1, 3), // 諾巴利卡昂靴 // (無描述)
Array(1072741, 150, 1, 3), // 諾巴阿爾泰靴 // (無描述)
Array(1132169, 150, 1, 3), // 諾巴西亞戴斯腰帶 // (無描述)
Array(1132170, 150, 1, 3), // 諾巴赫爾梅斯腰帶 // (無描述)
Array(1132171, 150, 1, 3), // 諾巴凱倫腰帶 // (無描述)
Array(1132172, 150, 1, 3), // 諾巴利卡昂腰帶 // (無描述)
Array(1132173, 150, 1, 3), // 諾巴阿爾泰腰帶 // (無描述)
Array(1032219, 150, 1, 3), // 遺忘之神話耳環 // (無描述)
Array(1022226, 150, 1, 3), // 獨眼巨人之眼Lv.3 // (無描述)
Array(1102476, 150, 1, 3), // 諾巴西亞戴斯披風 // (無描述)
Array(1102477, 150, 1, 3), // 諾巴赫爾梅斯披風 // (無描述)
Array(1102478, 150, 1, 3), // 諾巴凱倫披風 // (無描述)
Array(1102479, 150, 1, 3), // 諾巴利卡昂披風 // (無描述)
Array(1102455, 150, 1, 3), // 諾巴阿爾泰披風 // (無描述)
Array(1072737, 150, 1, 3), // 諾巴西亞戴斯靴 // (無描述)
Array(1072738, 150, 1, 3), // 諾巴赫爾梅斯靴 // (無描述)
Array(1072739, 150, 1, 3), // 諾巴凱倫靴 // (無描述)
Array(1072740, 150, 1, 3), // 諾巴利卡昂靴 // (無描述)
Array(1072741, 150, 1, 3), // 諾巴阿爾泰靴 // (無描述)
Array(1132169, 150, 1, 3), // 諾巴西亞戴斯腰帶 // (無描述)
Array(1132170, 150, 1, 3), // 諾巴赫爾梅斯腰帶 // (無描述)
Array(1132171, 150, 1, 3), // 諾巴凱倫腰帶 // (無描述)
Array(1132172, 150, 1, 3), // 諾巴利卡昂腰帶 // (無描述)
Array(1132173, 150, 1, 3), // 諾巴阿爾泰腰帶 // (無描述)
Array(1022211, 150, 1, 3), // 漩渦眼鏡 // (無描述)
Array(1032224, 150, 1, 3), // 漩渦耳環 // (無描述)
Array(1122269, 150, 1, 3), // 漩渦吊墜 // (無描述)
Array(1132247, 150, 1, 3), // 漩渦腰帶 // (無描述)
Array(1152160, 150, 1, 3), // 漩渦護肩 // (無描述)
Array(1003976, 150, 1, 3), // 漩渦帽子 // (無描述)
Array(1102623, 150, 1, 3), // 漩渦披風 // (無描述)
Array(1082556, 150, 1, 3), // 漩渦手套 // (無描述)
Array(1052669, 150, 1, 3), // 漩渦皇家外套 // (無描述)
Array(1072870, 150, 1, 3), // 漩渦鞋 // (無描述)
Array(1212089, 150, 1, 3), // 漩渦閃亮克魯 // (無描述)
Array(1222084, 150, 1, 3), // 漩渦靈魂射手 // (無描述)
Array(1232084, 150, 1, 3), // 漩渦惡魔劍 // (無描述)
Array(1242090, 150, 1, 3), // 漩渦鎖鏈劍 // (無描述)
Array(1252033, 150, 1, 3), // 漩渦虎梳魔法棒 // (無描述)
Array(1302297, 150, 1, 3), // 漩渦劍 // (無描述)
Array(1312173, 150, 1, 3), // 漩渦斧 // (無描述)
Array(1322223, 150, 1, 3), // 漩渦錘 // (無描述)
Array(1332247, 150, 1, 3), // 漩渦匕首 // (無描述)
Array(1342090, 150, 1, 3), // 漩渦刀  // (無描述)
Array(1362109, 150, 1, 3), // 漩渦手杖 // (無描述)
Array(1372195, 150, 1, 3), // 漩渦短杖 // (無描述)
Array(1382231, 150, 1, 3), // 漩渦長杖 // (無描述)
Array(1402220, 150, 1, 3), // 漩渦雙手劍 // (無描述)
Array(1412153, 150, 1, 3), // 漩渦雙手戰斧 // (無描述)
Array(1422158, 150, 1, 3), // 漩渦巨錘 // (無描述)
Array(1432187, 150, 1, 3), // 漩渦矛 // (無描述)
Array(1442242, 150, 1, 3), // 漩渦戟 // (無描述)
Array(1452226, 150, 1, 3), // 漩渦弓 // (無描述)
Array(1462213, 150, 1, 3), // 漩渦弩 // (無描述)
Array(1472235, 150, 1, 3), // 漩渦拳甲 // (無描述)
Array(1482189, 150, 1, 3), // 漩渦衝拳 // (無描述)
Array(1492199, 150, 1, 3), // 漩渦手銃 // (無描述)
Array(1522113, 150, 1, 3), // 漩渦雙翼弩 // (無描述)
Array(1532118, 150, 1, 3), // 漩渦手炮 // (無描述)
Array(1542072, 150, 1, 3), // 漩渦武士之劍 // (無描述)
Array(1552072, 150, 1, 3), // 漩渦之風 // (無描述)
/* 150 武器 */
Array(1212063, 100, 1, 3), // 法弗納魔力源泉杖 // (無描述)
Array(1222058, 100, 1, 3), // 法弗納天使手銃 // (無描述)
Array(1232057, 100, 1, 3), // 法弗納死亡使者 // (無描述)
Array(1242060, 100, 1, 3), // 法弗納精神之刃 // (無描述)
Array(1242061, 100, 1, 3), // 法弗納精神之刃 // (無描述)
Array(1252015, 100, 1, 3), // 法弗納北極星魔法棒 // (無描述)
Array(1262016, 100, 1, 3), // 法弗納ESP限製器 // (無描述)
Array(1302275, 100, 1, 3), // 法弗納銀槲之劍 // (無描述)
Array(1312153, 100, 1, 3), // 法弗納雙刃切肉斧 // (無描述)
Array(1322203, 100, 1, 3), // 法弗納戈耳迪錘 // (無描述)
Array(1332225, 100, 1, 3), // 法弗納大馬士革劍 // (無描述)
Array(1342082, 100, 1, 3), // 法弗納急速之刃 // (無描述)
Array(1362090, 100, 1, 3), // 法弗納洞察手杖 // (無描述)
Array(1372177, 100, 1, 3), // 法弗納魔力奪取者 // (無描述)
Array(1382208, 100, 1, 3), // 法弗納魔冠之杖 // (無描述)
Array(1402196, 100, 1, 3), // 法弗納懺悔之劍 // (無描述)
Array(1412135, 100, 1, 3), // 法弗納戰鬥切肉斧 // (無描述)
Array(1422140, 100, 1, 3), // 法弗納閃電錘 // (無描述)
Array(1432167, 100, 1, 3), // 法弗納貫雷槍 // (無描述)
Array(1442223, 100, 1, 3), // 法弗納半月寬刃斧 // (無描述)
Array(1452205, 100, 1, 3), // 法弗納追風者 // (無描述)
//Array(1092113, 100, 1, 3), // 特米納斯防禦盾     // (無描述)
//Array(1212080, 100, 1, 3), // 特米納斯啟迪閃亮克魯     // (無描述)
//Array(1222075, 100, 1, 3), // 特米納斯烈焰魂手銃     // (無描述)
//Array(1232075, 100, 1, 3), // 特米納斯亡命征服者     // (無描述)
//Array(1242081, 100, 1, 3), // 特米納斯狙擊能量劍     // (無描述)
//Array(1262030, 100, 1, 3), // 特米納斯ESP限製器     // (無描述)
//Array(1302290, 100, 1, 3), // 特米納斯分裂劍     // (無描述)
//Array(1312166, 100, 1, 3), // 特米納斯撕裂斧     // (無描述)
//Array(1322216, 100, 1, 3), // 特米納斯粉碎錘     // (無描述)
//Array(1332239, 100, 1, 3), // 特米納斯徘徊刀     // (無描述)
Array(1462193, 100, 1, 3), // 法弗納風翼弩 // (無描述)
Array(1472214, 100, 1, 3), // 法弗納危險之手 // (無描述)
Array(1482168, 100, 1, 3), // 法弗納巨狼之爪 // (無描述)
Array(1492179, 100, 1, 3), // 法弗納左輪槍 // (無描述)
Array(1522094, 100, 1, 3), // 法弗納雙風翼弩 // (無描述)
Array(1532098, 100, 1, 3), // 法弗納榮耀炮 // (無描述)
Array(1542063, 100, 1, 3), // 法弗納皇刀正宗 // (無描述)
Array(1113074, 500, 1, 3),//高級貝勒戒指
Array(1132245, 500, 1, 3),//高級貝勒腰帶
Array(1122266, 500, 1, 3),//高級貝勒吊墜
Array(1032222, 500, 1, 3),//高級貝勒耳環
Array(1552063, 90, 1, 3) // 法弗納煌扇藍姬 // (無描述)

);
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用嗎？…我的肚子裡有各類#b奇特座椅或卷軸、裝備、新奇道具#k哦！");
            cm.dispose();
        }
        status--;

    }
    if (status == 0) {
        var txt = Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + "\r\n";
        txt += "#d想抽獎嗎？精品道具入誰家？我這裡有150-160不等高級道具\r\n";
        txt += "方塊 卷軸 奇特座椅 限量時裝 等新奇道具 [ #r還在等待嗎#d ]\r\n\r\n#k";
        txt += "#d[ #r#h ##d ] 玩家餘額：#r" + cm.getHyPay(1) + "　#b[ 100餘額抽一回 ]\r\n#k";
        txt += "#b#L0#開始抽獎 [ 可抽 #r" + parseInt(cm.getHyPay(1) / cost) + "#b 次 ]\t\t#r☆獎品圖鑒如下☆#l#k\r\n\r\n";
        txt += Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + "\r\n";
        txt += "#i1712000##i1712001##i1712002##i1712003##i2430209##i2430210##i2435719##i2432022##i2570002##i2049376##i1672069##i1182016##i1004808##i1004810##i1004811##i1102940##i1102942##i1102943##i1053066##i1053065##i1042257##i1042258##i1062165##i1102481##i1102482##i1102483##i1102484##i1102485##i1072743##i1072744##i1072745##i1072746##i1072747##i1222058##i1232057##i1242060##i1242061##i1302275##i1312153##i1322203##i1332225##i1262039##i1362140##i1522143##i1472265##i1452257#";
        cm.sendSimple(txt);
    } else if (status == 1) {
        if (selection == 0) {
            if (cm.getHyPay(1) < cost) {
                cm.sendOk("你好像沒有" + cost + "點餘額");
                cm.dispose();
                return;
            }
            var chance = Math.floor(Math.random() * 0);
            var finalitem = Array();
            if (chance >250){
                cm.sendOk("很遺憾未中獎");
                cm.dispose();
                return;
            }
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        for (var i = 0; i < itemList2.length; i++) {
            if (itemList2[i][1] >= chance) {
                finalitem.push(itemList2[i]);
            }
        }
        if (finalitem.length != 0) {
                var item;
                var random = new java.util.Random();
                var finalchance = random.nextInt(finalitem.length);
                var itemId = finalitem[finalchance][0];
                var quantity = finalitem[finalchance][2];
                var notice = finalitem[finalchance][3];
                item = cm.gainGachaponItem(itemId, quantity, "[餘額抽獎寶箱]", notice);
                if (item != -1) {
                    cm.addHyPay(cost);
                    cm.sendOk("你獲得了 #b#z" + item + "##k " + quantity + "個。");
                } else {
                    cm.sendOk("請你確認在背包的裝備，消耗，其他窗口中是否有一格以上的空間。");
                }
                cm.safeDispose();
            } else {
                cm.sendOk("今天的運氣可真差，什麼都沒有拿到");
                cm.addHyPay(cost);
                cm.safeDispose();
            }
        }
    }
}

