status = -1;
var head = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n";
var icon = "#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#";
var Star = "#fEffect/CharacterEff/1112904/2/1#";
/***************************************/
var cost = 6;  //每次消耗的HyPay額度
var itemList = Array(
/* 餘額抽 */

Array(2613000, 100, 1, 1), //星火單手武器攻擊力卷軸
Array(2615032, 10, 1, 1),//X飾品魔力卷軸
Array(2531000, 100, 1, 1),//防爆卷軸
Array(2340000, 100, 1, 1),//祝福卷軸
Array(2049116,  200,  1,  1),  //強化混沌卷軸
Array(2049135, 200, 1, 1),//驚人正義混沌卷軸 20%
Array(2049136, 100, 1, 1),//驚人正義混沌卷軸 20%
Array(2049137, 100, 1, 1),//驚人正義混沌卷軸 40%
Array(2049153, 100, 1, 1),//驚人正義混沌卷軸 60%
Array(2049156, 100, 1, 1),//驚人正義混沌卷軸 50%
Array(2049370, 100, 1, 1),//星之力12星強化券
Array(2049373, 100, 1, 1),//星之力10星強化券
Array(2049371, 10 , 1, 1),//星之力17星強化券
Array(2049372, 100, 1, 1),//星之力15星強化券
Array(2049376, 1  , 1, 1),//星之力20星強化券
Array(2049380, 100, 1, 1),//星之力11星強化券
Array(2049382, 100, 1, 1),//星之力13星強化券
Array(2049383, 100, 1, 1),//星之力14星強化券
Array(2049385, 100, 1, 1),//星之力16星強化券
Array(2049387, 2  , 1, 1),//星之力18星強化券
Array(2049388, 1  , 1, 1),//星之力19星強化券
Array(2049116,  200,  1,  1),  //強化混沌卷軸
Array(5064003, 100, 1, 1),//極真保護之盾
Array(5068100, 100, 1, 1),//寵物專用保護卷軸
Array(5530458, 100, 1, 1),//專屬飾品魔力卷軸
Array(5530457, 100, 1, 1),//專屬飾品攻擊力卷軸
Array(5530455, 100, 1, 1),//防具攻擊力卷軸
Array(5530456, 100, 1, 1),//防具魔力卷軸
Array(5530442, 100, 1, 1),//專屬寵物裝備攻擊力卷軸
Array(2049116,  200,  1,  1), //強化混沌卷軸
Array(5530443, 100, 1, 1),//專屬寵物裝備魔力卷軸
Array(5064100, 100, 1, 1),//保護卷軸
Array(5064300, 100, 1, 1),//卷軸防護卷軸
Array(2049004, 100, 1, 1),//純白卷軸
Array(2049602, 100, 1, 1),//還原卷軸
Array(2049602, 100, 1, 1),//還原卷軸50%
Array(2049605, 100, 1, 1),//還原卷軸 40%
Array(2049606, 100, 1, 1),//還原卷軸 50%
Array(2049607, 100, 1, 1),//還原卷軸 20%
Array(2049615, 100, 1, 1),//完美還原卷軸50%
Array(2049323, 100, 1, 1),//高級裝備強化卷軸
Array(2049323, 100, 1, 1),//高級裝備強化卷軸
Array(2049323, 100, 1, 1),//高級裝備強化卷軸
Array(2049602, 100, 1, 1),//還原卷軸
Array(2049116,  200,  1,  1),  //強化混沌卷軸
Array(2049750, 100, 1, 1),//S級潛能卷軸 80%
Array(2049116,  200,  1,  1),  //強化混沌卷軸
Array(2049751, 100, 1, 1),//S級潛能卷軸 60%
Array(2049762, 100, 1, 1),//S級潛能卷軸 100%
Array(2049752, 100, 1, 1),//S級潛能卷軸 30%
Array(2048817, 10, 1, 1),//X寵物裝備攻擊力卷軸    
Array(2048818, 10, 1, 1),//X寵物裝備魔力卷軸    
Array(2049116,  200,  1,  1),  //強化混沌卷軸    
Array(2048822, 1, 1, 1),//V寵物裝備魔力卷軸    
Array(2048821, 1, 1, 1),//V寵物裝備攻擊力卷軸    
Array(2612076, 1, 1, 1),//V雙手武器攻擊力卷軸        
Array(2612077, 1, 1, 1),//V雙手武器魔力卷軸        
Array(2615043, 1, 1, 1),//V飾品攻擊力卷軸    
Array(2616074, 1, 1, 1),//V防具攻擊力卷軸        
Array(2616075, 1, 1, 1),//V防具魔力卷軸        
Array(2613050, 10, 1, 1),//X單手武器攻擊力卷軸    
Array(2612061, 10, 1, 1),//X雙手武器攻擊力卷軸
Array(2612062, 10, 1, 1),//X雙手武器魔力卷軸
Array(2613051, 10, 1, 1),//X單手武器魔力卷軸        
Array(2616061, 10, 1, 1),//X防具攻擊力卷軸        
Array(2616062, 10, 1, 1)//X防具魔力卷軸    
);
var itemList2 = Array(
Array(2613000, 100, 1, 1), //星火單手武器攻擊力卷軸
Array(2615032, 10, 1, 1),//X飾品魔力卷軸
Array(2531000, 100, 1, 1),//防爆卷軸
Array(2340000, 100, 1, 1),//祝福卷軸
Array(2049116,  200,  1,  1),  //強化混沌卷軸
Array(2049135, 200, 1, 1),//驚人正義混沌卷軸 20%
Array(2049136, 100, 1, 1),//驚人正義混沌卷軸 20%
Array(2049137, 100, 1, 1),//驚人正義混沌卷軸 40%
Array(2049153, 100, 1, 1),//驚人正義混沌卷軸 60%
Array(2049156, 100, 1, 1),//驚人正義混沌卷軸 50%
Array(2049370, 100, 1, 1),//星之力12星強化券
Array(2049373, 100, 1, 1),//星之力10星強化券
Array(2049371, 10 , 1, 1),//星之力17星強化券
Array(2049372, 100, 1, 1),//星之力15星強化券
Array(2049376, 1  , 1, 1),//星之力20星強化券
Array(2049380, 100, 1, 1),//星之力11星強化券
Array(2049382, 100, 1, 1),//星之力13星強化券
Array(2049383, 100, 1, 1),//星之力14星強化券
Array(2049385, 100, 1, 1),//星之力16星強化券
Array(2049387, 2  , 1, 1),//星之力18星強化券
Array(2049388, 1  , 1, 1),//星之力19星強化券
Array(2049116,  200,  1,  1),  //強化混沌卷軸
Array(5064003, 100, 1, 1),//極真保護之盾
Array(5068100, 100, 1, 1),//寵物專用保護卷軸
Array(5530458, 100, 1, 1),//專屬飾品魔力卷軸
Array(5530457, 100, 1, 1),//專屬飾品攻擊力卷軸
Array(5530455, 100, 1, 1),//防具攻擊力卷軸
Array(5530456, 100, 1, 1),//防具魔力卷軸
Array(5530442, 100, 1, 1),//專屬寵物裝備攻擊力卷軸
Array(2049116,  200,  1,  1), //強化混沌卷軸
Array(5530443, 100, 1, 1),//專屬寵物裝備魔力卷軸
Array(5064100, 100, 1, 1),//保護卷軸
Array(5064300, 100, 1, 1),//卷軸防護卷軸
Array(2049004, 100, 1, 1),//純白卷軸
Array(2049602, 100, 1, 1),//還原卷軸
Array(2049602, 100, 1, 1),//還原卷軸50%
Array(2049605, 100, 1, 1),//還原卷軸 40%
Array(2049606, 100, 1, 1),//還原卷軸 50%
Array(2049607, 100, 1, 1),//還原卷軸 20%
Array(2049615, 100, 1, 1),//完美還原卷軸50%
Array(2049323, 100, 1, 1),//高級裝備強化卷軸
Array(2049323, 100, 1, 1),//高級裝備強化卷軸
Array(2049323, 100, 1, 1),//高級裝備強化卷軸
Array(2049602, 100, 1, 1),//還原卷軸
Array(2049116,  200,  1,  1),  //強化混沌卷軸
Array(2049750, 100, 1, 1),//S級潛能卷軸 80%
Array(2049116,  200,  1,  1),  //強化混沌卷軸
Array(2049751, 100, 1, 1),//S級潛能卷軸 60%
Array(2049762, 100, 1, 1),//S級潛能卷軸 100%
Array(2049752, 100, 1, 1),//S級潛能卷軸 30%
Array(2048817, 10, 1, 1),//X寵物裝備攻擊力卷軸    
Array(2048818, 10, 1, 1),//X寵物裝備魔力卷軸    
Array(2049116,  200,  1,  1),  //強化混沌卷軸    
Array(2048822, 1, 1, 1),//V寵物裝備魔力卷軸    
Array(2048821, 1, 1, 1),//V寵物裝備攻擊力卷軸    
Array(2612061, 10, 1, 1),//X雙手武器攻擊力卷軸    
Array(2616062, 10, 1, 1)//X防具魔力卷軸    

);
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用嗎？…我的肚子裡有各類#b奇特座椅或卷軸、裝備、新奇道具#k哦！");
            cm.dispose();
        }
        status--;

    }
    if (status == 0) {
        var txt = Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + "\r\n";
        txt += "#d想抽獎嗎？我這裡有數不盡的卷軸喲~\r\n";
        txt += "V寵物卷軸 星之力卷軸 X寵物卷軸 強化混沌卷軸  [ #r還在等待嗎#d ]\r\n\r\n#k";
        txt += "#d[ #r#h ##d ] 玩家餘額：#r" + cm.getHyPay(1) + "　#b[ 6餘額抽一回 ]\r\n#k";
        txt += "#b#L0#開始抽獎 [ 可抽 #r" + parseInt(cm.getHyPay(1) / cost) + "#b 次 ]\t\t#r☆獎品圖鑒如下☆#l#k\r\n\r\n";
        txt += Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + Star + "\r\n";
        txt += "#i2049376##i2049388##i2049387##i2048821##i2048822##i2048817##i2048818##i5064300##i2049762##i2049615##i5530442##i5530443##i2612076##i2616074##i2613050##i2612061##i5068100##i2049116##i2049323##i2049004#";
        cm.sendSimple(txt);
    } else if (status == 1) {
        if (selection == 0) {
            if (cm.getHyPay(1) < cost) {
                cm.sendOk("你好像沒有" + cost + "點餘額");
                cm.dispose();
                return;
            }
            var chance = Math.floor(Math.random() * 0);
            var finalitem = Array();
            if (chance >250){
                cm.sendOk("很遺憾未中獎");
                cm.dispose();
                return;
            }
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        for (var i = 0; i < itemList2.length; i++) {
            if (itemList2[i][1] >= chance) {
                finalitem.push(itemList2[i]);
            }
        }
        if (finalitem.length != 0) {
                var item;
                var random = new java.util.Random();
                var finalchance = random.nextInt(finalitem.length);
                var itemId = finalitem[finalchance][0];
                var quantity = finalitem[finalchance][2];
                var notice = finalitem[finalchance][3];
                item = cm.gainGachaponItem(itemId, quantity, "[餘額卷軸寶箱]", notice);
                if (item != -1) {
                    cm.addHyPay(cost);
                    cm.sendOk("你獲得了 #b#z" + item + "##k " + quantity + "個。");
                } else {
                    cm.sendOk("請你確認在背包的裝備，消耗，其他窗口中是否有一格以上的空間。");
                }
                cm.safeDispose();
            } else {
                cm.sendOk("今天的運氣可真差，什麼都沒有拿到");
                cm.addHyPay(cost);
                cm.safeDispose();
            }
        }
    }
}

