var status = -1;

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if ((cm.getSpace(1) > 1||cm.getSpace(2) > 1||cm.getSpace(3) > 1||cm.getSpace(4) > 1)&&cm.getHyPay(3) >= 600 && cm.getPlayer().getCSPoints(1) >= 20000) {
            cm.sendYesNo("這裡是儲值抽獎專區。我背包裡面包含了必成卷軸、大PB、150等所有裝備哦.如果你儲值滿了600可以再這裡免費抽獎一次哦！你確定要抽獎嗎？註：獲得高級裝備幾率提高10倍。");
        } else {
            cm.sendOk("我背包裡面包含了必成卷軸、大PB、150等所有裝備哦。如果你累計金額滿了600可以再這裡花費2萬樂豆點抽獎一次哦！你的儲值金額到600或足夠2萬樂豆點了嗎？");
            cm.safeDispose();
        }
    } else if (status == 1) {
            var item;
            var chance = Math.floor(Math.random() * 165);
            if(chance >= 0 && chance <= 50){
                var itemList = new Array(
1002776, // 永恆冠軍盔
1002777, // 永恆玄妙帽
1002778, // 永恆霓翎帽
1002779, // 永恆迷蹤帽
1002780, // 永恆海王星
1032031, // 永恆金盾墜
1052155, // 永恆演武鎧
1052156, // 永恆奧神袍
1052157, // 永恆巡禮者
1052158, // 永恆翻雲服
1052159, // 永恆霸七海
1072355, // 永恆堅壁靴
1072356, // 永恆縹緲鞋
1072357, // 永恆彩虹鞋
1072358, // 永恆舞空靴
1072359, // 永恆定海靴
1082234, // 永恆定邊手套
1082235, // 永恆逍遙手套
1082236, // 永恆白雲手套
1082237, // 永恆探雲手套
1082238, // 永恆撫浪手套
1092057, // 永恆魔光盾
1092058, // 永恆寒冰盾
1092059, // 永恆匿蹤盾
1102172, // 永恆不滅披風
1112312, // 永恆真愛戒指
1122012, // 永恆玉珮
1212011, // 永恆末路閃亮克魯
1222011, // 永恆紫龍  
1302081, // 永恆破甲劍
1312037, // 永恆斷蚺斧
1322060, // 永恆驚破天
1332073, // 永恆狂鯊鋸
1332074, // 永恆斷首刃
1342011, // 永恆之刃  
1362016, // 永恆手杖  
1372044, // 永恆蝶翼杖
1382057, // 永恆冰輪杖
1402046, // 永恆玄冥劍
1412033, // 永恆碎黿斧
1422037, // 永恆威震天
1432047, // 永恆顯聖槍
1442063, // 永恆神光戟
1452057, // 永恆驚電弓
1462050, // 永恆冥雷弩
1472068, // 永恆大悲賦
1482023, // 永恆孔雀翎
1492023, // 永恆鳳凰銃
1522015, // 永恆鮮花弩槍
1532015,  // 永恆拯救者
1003285, //無雙冠軍盔
1003286, //無雙玄妙帽
1003287, //無雙霓翎帽
1003288, //無雙迷蹤帽
1003289, //無雙海王星
1032108, //無雙耳環  
1052379, //無雙演武鎧
1052380, //無雙奧神袍
1052381, //無雙巡禮者
1052382, //無雙翻雲服
1052383, //無雙霸七海
1072549, //無雙堅壁靴
1072550, //無雙縹緲鞋
1072551, //無雙彩虹鞋
1072552, //無雙舞空靴
1072553, //無雙定海靴
1082333, //無雙定邊手套
1082334, //無雙逍遙手套
1082335, //無雙白雲手套
1082336, //無雙探雲手套
1082337, //無雙撫浪手套
1092092, //無雙魔光盾
1092093, //無雙寒冰盾
1092094, //無雙匿蹤盾
1102311, //無雙不滅披風
1122148, //無雙吊墜
1212018, //無雙末路閃亮克魯
1222018, //無雙紫龍  
1302174, //無雙破甲劍
1312073, //無雙斷蚺斧
1322108, //無雙驚破天
1332150, //無雙狂鯊鋸
1332151, //無雙斷首刃
1342041, //無雙之刃  
1362023, //無雙手杖  
1372101, //無雙蝶翼杖
1382125, //無雙冰輪杖
1402112, //無雙玄冥劍
1412072, //無雙碎黿斧
1422074, //無雙威震天
1432100, //無雙顯聖槍
1442137, //無雙神光戟
1452130, //無雙驚電弓
1462119, //無雙冥雷弩
1472142, //無雙大悲賦
1482103, //無雙孔雀翎
1492102, //無雙鳳凰銃
1522021, //無雙鮮花弩槍
1532038  //無雙拯救者
                    );
                item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "累計金額大轉盤(1500)");
            } else if (chance >= 51 && chance <= 100) {
                var itemList = new Array(
3010300, // 橙色HP藥水椅子 - 坐在上面可以感受補HP的快感，每10秒鐘可恢復HP50。
3010301, // 高級HP藥水椅子 - 坐在上面可以感受補HP的快感，每10秒鐘可恢復HP50。
3010302,  // 超級藥水椅子 - 坐在上面可以感受補HP/MP的快感，每10秒鐘可恢復HP、MP各50。
3010314, // 紅絲帶月妙靠墊 - 坐在靠墊上，可以觀看戴著紅絲帶的可愛月妙進行表演。
3010315, // 青絲帶月妙靠墊 - 坐在靠墊上，可以觀看戴著青絲帶的可愛月妙進行表演。
3010316, // 扇子舞月妙靠墊 - 坐在靠墊上，可以觀看拿著扇子的月妙在繩子上進行表演。
3010317, // 太平蕭月妙靠墊 - 坐在靠墊上，可以觀看月妙演奏音樂。
3010106, // 雪狼戰椅 - 狂狼勇士最愛的雪狼。\n每10秒HP和MP各恢復50。
3010107, // 龍龍的蛋殼椅 - 坐在上面時，每10秒恢復HP的龍龍的蛋殼。是只有龍魔導士可以擁有的特殊椅子。
3010108, // 幼龍鞦韆 - 幼龍晃動的鞦韆椅。坐在上面，每10秒HP恢復40，MP恢復20。
3010109, // 暖爐椅 - 讓人感覺溫暖的椅子，使用後每10秒恢復HP 40、MP 20。
3010110, // 舒適大白熊椅子 - 抱著非常的溫暖，每10秒鐘回復HP、MP各50。
3010111, // 虎虎生威 - 王者最愛的椅子。坐在上面每10秒鐘可恢復HP50、MP30。
3010112, // 情書櫃子 - 堆滿情書的櫃子,適合送給戀人的椅子..\n每10秒鐘恢復HP 50.
3010113, // 幽魂發條熊椅子 - 使用後每10秒恢復HP 50。
3010114, // 俘虜我吧！椅子 - 使用後每10秒恢復HP 50。
3010115, // 熊寶寶床 - 放置著熊寶寶娃娃的溫暖床。躺在床上每10秒恢復HP 50、MP 50。
3010116, // 搖滾之魂椅子 - 坐在上面彷彿成了搖滾明星.\n每10秒鐘恢復HP60,MP30.
3010117, // 魔法書椅子 - 坐在漂浮的魔法書上面,每10秒鐘恢復HP50,MP30.
3010118, // 糖果音符椅子 - 跟著音符一起哼歌,坐在上面能莫名的開心起來,每10秒鐘恢復HP50,MP30.
3010119, // 羊羊椅子 - 坐在上面，每10秒鐘恢復HP50，MP30。
3010120, // 彩蛋籃子 - 籃子中塞滿五彩繽紛的彩蛋!\n每10秒鐘恢復HP40,MP40.
3010123, // 夏日花朵 - 盛開的夏日花朵,有陣陣香氣撲鼻而來.每10秒鐘恢復HP,MP各50。
3010124, // 都納斯噴氣椅子 - 超強BOSS都納斯熱愛的噴氣式椅子.\n每10秒鐘恢復HP40.
3010125, // 尼貝隆戰艦椅 - 坐在尼貝隆戰艦上霸氣十足.\n每10秒鐘恢復MP40.
3010137, // 神龍椅子, // 神龍化身的神聖的椅子。每10秒鐘恢復HP 150, MP 100.
3010138, // 君主休憩椅, // 偉大的君主，休息一下吧，每10秒可恢復HP50。
3010139, // 私密空間, // 坐在上面可享受最快樂的時光!! 每10秒恢復HP50.
3010140, // 早日康復床, // 躺在早日康復床,可以迅速治癒任何病.躺在床上每10秒鐘恢復HP100
3010141, // 蛋糕椅子, // 蛋糕師精心製作的蛋糕. 坐在上面每10秒鐘恢復HP,MP各30.
3010142, // 水族館椅子, // 可以觀賞魚的水族館椅子。每10秒恢復30HP和30MP。
3010144, // 七夕椅子, // 七夕情人節戀人之間贈送的椅子. 每10秒鐘恢復HP 10 ,MP 10
3010135, // 節日獨角獸椅子, // 歐洲楓之谷玩家Lyonel設計的椅子.坐在上面可感受節日的喜慶氛圍.每10秒鐘恢復HP,MP各70.
3010170, // 雪夜椅子, // 冬天的夜晚,飄落雪. 每10秒鐘恢復HP,MP各30.
3010171, // 過來抱抱椅, // 快過來讓我抱抱，免費的溫暖擁抱噢。每10秒恢復30HP和30MP。
3010172, // 星空椅子, // 傳說在星空下許願,願望容易實現噢.每10秒鐘恢復HP,MP各20.
3010173, // 萬聖節塔羅椅子, // 萬聖節玩南瓜,玩塔羅牌, 據說塔羅牌可遇見未來.每10秒鐘恢復HP,MP各30.
3010174, // 女巫煉藥椅, // 正在煉製可怕的女巫魔藥，小心喲。每10秒恢復50HP和50MP。
3010175, // 名畫家椅子, // 坐在上面彷彿成了藝術家,我也要成為名畫家! 每10秒鐘恢復HP,MP各40.
3010177, // 手柄座椅, // 適合坐下進行遊戲的手柄型椅子，每10秒會恢復HP和MP各40。
3010179, // 燕尾服蘑菇椅, // 與穿著燕尾服的可愛蘑菇共進晚餐,每10秒鐘可恢復HP,MP50
3010180, // HP椅子, // 坐在上面可以感受補HP的快感，每10秒鐘可恢復HP50
3010181, // MP椅子 , // 坐在上面可以感受補MP的快感，每10秒鐘可恢復MP50
3010182, // 兔子公會椅, // 與兔子公會在一起無比的溫馨.每10秒鐘HP,MP各恢復50.
3010183, // 胡蘿蔔椅子, // 兔子喜歡的胡蘿蔔,胡蘿蔔富有豐富的維生素A噢.每10秒鐘恢復HP,MP各50.
3010184, // 冰釣椅子, // 在寒冷之地鑿個冰窟來垂釣。坐在上面每10秒恢復HP 50.
3010185, // 小夥伴皮卡啾, // 開心的皮卡啾對坐在沙發上的你，在施展怎樣的閃光魔法呢？坐在上面每10秒恢復HP/MP 100。
3010218, // 喬克惡靈椅子, // 十字旅團中邪惡的喬克惡靈附著的椅子。坐在上面每10秒恢復HP 50.
3010219, // 綿羊酋長椅子, // 馴服了有惡魔之力的綿羊酋長。坐在上面每10秒恢復HP 50.
3010220, // 我愛蛋糕椅子, // 蛋糕大戰餡餅特別版紀念椅子——我愛蛋糕噢，親。坐上去每10秒恢復HP、MP各60。
3010221, // 我愛餡餅椅子, // 蛋糕大戰餡餅特別版紀念椅子——我愛餡餅噢，親。坐上去每10秒恢復HP、MP各60。
3010222 // 兔兔伴讀椅子, // 和愛讀書的眼鏡兔一起看書。
                                    );
                item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "累計金額大轉盤(1500)");
            } else if (chance >= 101 && chance <= 130) {
                var itemList = new Array(
1003443, // 君主英勇頭箍
1003444, // 君主記憶頭箍
1003445, // 君主鋒銳頭箍
1003446, // 君主迅捷頭箍
1003447, // 君主熾熱頭箍
1052429, // 君主英勇鎖子甲
1052430, // 君主記憶鎖子甲
1052431, // 君主鋒銳鎖子甲
1052432, // 君主迅捷鎖子甲
1052433, // 君主熾熱鎖子甲
1072641, // 君主英勇靴  
1072642, // 君主記憶靴  
1072643, // 君主鋒銳靴  
1072644, // 君主迅捷靴  
1072645, // 君主熾熱靴  
1082416, // 君主英勇手套
1082417, // 君主記憶手套
1082418, // 君主鋒銳手套
1082419, // 君主迅捷手套
1082420, // 君主熾熱手套
1102362, // 君主英勇披風
1102363, // 君主記憶披風
1102364, // 君主鋒銳披風
1102365, // 君主迅捷披風
1102366, // 君主熾熱披風
1112712, // 君主戒指    
1132141, // 君主腰帶    
1152079, // 君主護肩    
1212034, // 君主閃亮克魯
1222034, // 君主血月    
1302207, // 君主單手劍  
1312110, // 君主斧      
1322150, // 君主錘      
1332184, // 君主屠殺者  
1342064, // 君主刀      
1362056, // 君主手杖    
1372130, // 君主權杖    
1382158, // 君主長杖    
1402142, // 君主雙手劍  
1412099, // 君主雙手斧  
1422102, // 君主巨錘    
1432131, // 君主槍      
1442170, // 君主矛      
1452162, // 君主長弓    
1462152, // 君主弩      
1472174, // 君主拳套    
1482135, // 君主指虎
1492135, // 君主沙漠之鷹
1522064, // 君主雙弩槍  
1532068, // 君主火炮
1003589, // 豪華阿加雷斯頭箍
1003590, // 豪華艾裡格斯頭箍
1003591, // 豪華伊布斯頭箍  
1003592, // 豪華赫爾巴斯頭箍
1003593, // 豪華維帕爾頭箍  
1052498, // 豪華阿加雷斯鎖子甲
1052499, // 豪華艾裡格斯鎖子甲
1052500, // 豪華伊布斯鎖子甲
1052501, // 豪華赫爾巴斯鎖子甲
1052502, // 豪華維帕爾鎖子甲
1072703, // 豪華阿加雷斯靴  
1072704, // 豪華艾裡格斯靴  
1072705, // 豪華伊布斯靴    
1072706, // 豪華赫爾巴斯靴  
1072707, // 豪華維帕爾靴    
1082466, // 豪華阿加雷斯手套
1082467, // 豪華艾裡格斯手套
1082468, // 豪華伊布斯手套  
1082469, // 豪華赫爾巴斯手套
1082470, // 豪華維帕爾手套  
1102445, // 豪華阿加雷斯披風
1102446, // 豪華艾裡格斯披風
1102447, // 豪華伊布斯披風  
1102448, // 豪華赫爾巴斯披風
1102449, // 豪華維帕爾披風  
1212043, // 豪華艾裡格斯閃亮克魯
1222043, // 豪華維帕爾血月  
1302228, // 豪華阿加雷斯拳刃
1312117, // 豪華阿加雷斯頭盔
1322163, // 豪華阿加雷斯錘  
1332194, // 豪華赫爾巴斯獵手
1362068, // 豪華赫爾巴斯手杖
1372140, // 豪華艾裡格斯短杖
1382169, // 豪華艾裡格斯笞鞭
1402152, // 豪華阿加雷斯雙手劍
1412105, // 豪華阿加雷斯拳套
1422108, // 豪華阿加雷斯大槌
1432139, // 豪華阿加雷斯之矛
1442183, // 豪華阿加雷斯之矛
1452171, // 豪華伊布斯長弓  
1462160, // 豪華伊布斯弩    
1472180, // 豪華赫爾巴斯手套
1482141, // 豪華維帕爾指虎手套
1492153, // 豪華維帕爾之鷹  
1522072, // 豪華伊布斯雙弩槍
1532075 // 豪華維帕爾火炮    
                                    );
                item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "累計金額大轉盤(1500)");
            } else if (chance >= 131 && chance <= 150) {
                var itemList = new Array(
1003622, // 布萊克繽帽
1052527, // 布萊克繽大衣
1302070, // 布萊克繽單手劍
1312142, // 布萊克繽單手斧
1322100, // 布萊克繽單手棍
1332214, // 布萊克繽短劍
1342079, // 布萊克繽影武
1362081, // 布萊克繽手杖
1372168, // 布萊克繽短杖
1382199, // 布萊克繽長杖
1402185, // 布萊克繽雙手劍
1412126, // 布萊克繽雙手斧
1422129, // 布萊克繽雙手棍
1432158, // 布萊克繽長槍
1442209, // 布萊克繽長矛
1452196, // 布萊克繽弓
1462184, // 布萊克繽弩
1472205, // 布萊克繽拳套
1482159, // 布萊克繽指虎
1492170, // 布萊克繽火槍
1522085, // 布萊克繽雙弩槍
1532089, // 布萊克繽火炮
1212044, // 無愛閃亮克魯
1222044, // 無愛紫龍  
1302248, // 無愛破甲劍
1312135, // 無愛斷蚺斧
1322181, // 無愛驚破天
1332205, // 無愛狂鯊鋸
1342075, // 無愛之刃  
1362074, // 無愛手杖  
1372161, // 無愛蝶翼杖
1382192, // 無愛冰輪杖
1402172, // 無愛玄冥劍
1412122, // 無愛碎黿斧
1422124, // 無愛威震天
1432150, // 無愛顯聖槍
1442202, // 無愛神光戟
1452189, // 無愛驚電弓
1462177, // 無愛冥雷弩
1472197, // 無愛大悲賦
1482151, // 無愛孔雀翎
1492162, // 無愛鳳凰銃
1522078, // 無愛鮮花弩槍
1532081 // 無愛救世炮
                                    );
                item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "累計金額大轉盤(600)");
            } else if (chance >= 151 && chance <= 160) {
                var itemList = new Array(2040303, //耳環智力必成卷
                    2040006, //頭盔防禦必成卷
                    2040007, //頭盔體力必成卷
                    2040403, //上衣防禦必成卷
                    2040506, //全身盔甲敏捷必成卷
                    2040507, //全身盔甲防禦必成卷
                    2040603, //褲裙防禦必成卷
                    2040507, //全身盔甲防禦必成卷
                    2040603, //褲裙防禦必成卷
                    2040709, //鞋子敏捷必成卷
                    2040710, //鞋子跳躍必成卷
                    2040711, //鞋子速度必成卷
                    2040806, //手套敏捷必成卷
                    2040903, //盾牌防禦必成卷
                    2040507, //全身盔甲防禦必成卷
                    2040603, //褲裙防禦必成卷
                    2041024, //披風魔法防禦必成卷
                    2041025, //披風物理防禦必成卷
                    2043003, //單手劍攻擊必成卷
                    2044019, //雙手劍魔力必成卷
                    2044019, //雙手劍魔力必成卷
                    2043103, //單手斧攻擊必成卷
                    2043203, //單手棍攻擊必成卷
                    2043303, //短劍攻擊必成卷
                    2043703, //短杖攻擊必成卷
                    2043803, //長杖攻擊必成卷
                    2044003, //雙手劍攻擊必成卷
                    2044019, //雙手劍魔力必成卷
                    2044103, //雙手斧攻擊必成卷
                    2040903, //盾牌防禦必成卷
                    2040903, //盾牌防禦必成卷
                    2044203, //雙手棍攻擊必成卷
                    2044303, //槍攻擊必成卷
                    2044403, //矛攻擊必成卷
                    2044503, //弓攻擊必成卷
                    2044603, //弩攻擊必成卷
                    2044703, //拳套攻擊必成卷
                    2044815, //指虎攻擊必成卷
                    2044908, //火槍攻擊必成卷
                    2340000, //祝福卷軸
                    2049406, //特殊潛能附加卷軸
                    2049303, //高級裝備強化卷軸
                    3010070, //巨無霸皮卡啾
                    3010073, //baby皮卡啾
                    3010073, //baby皮卡啾
                    1402014, //溫度計
                    1003172, //獅心戰鬥頭盔
                    1102275, //獅心戰鬥披風
                    1082295, //獅心戰鬥護腕
                    1052314, //獅心戰鬥鎖子甲
                    1072485, //獅心戰鬥鞋
                    1003173, //龍尾法師帽子
                    1102276, //龍尾法師披風
                    1082296, //龍尾法師手套
                    1052315, //龍尾法師長袍
                    1072486, //龍尾法師鞋
                    1003174, //鷹翼哨兵便帽
                    1102277, //鷹翼哨兵披風
                    1082297, //鷹翼哨兵手套
                    1052316, //鷹翼哨兵服
                    1072487, //鷹翼哨兵鞋
                    1003175, //渡鴉之魂追蹤者帽
                    1102278, //渡鴉之魂獵人披風
                    1082298, //渡鴉之魂追蹤者手套
                    1052317, //渡鴉之魂追蹤者盔甲
                    1072488, //渡鴉之魂追蹤者鞋
                    1003176, //鯊齒船長帽
                    1102279, //鯊齒船長披風
                    1082299, //鯊齒船長手套
                    1052318, //鯊齒船長外套
                    1072489, //鯊齒船長鞋
                    1432086, //獅心長槍
                    1442116, //獅心長矛
                    1322096, //獅心震雷
                    1422066, //獅心巨錘
                    1402095, //獅心戰刀
                    1412065, //獅心戰斧
                    1302152, //獅心彎刀
                    1312065, //獅心勇斧
                    1372084, //龍尾短杖
                    1382104, //龍尾長杖
                    1452111, //鷹翼重弓
                    1462099, //鷹翼重弩
                    1332130, //渡鴉之魂（短劍）
                    1472122, //渡鴉之魂
                    1342036, //精靈角刀
                    1492085, //鯊齒手銃
                    1532018, //鯊齒鷹爪
                    1302016, //鯊齒火炮
                    1522018, //龍翼弩槍
1072732, // 赫裡希安精銳劍士靴
1072733, // 赫裡希安精銳法師靴
1072734, // 赫裡希安精銳弓箭手靴
1072735, // 赫裡希安精銳盜賊靴
1072736, // 赫裡希安精銳海盜靴
1102471, // 赫裡希安精銳劍士披風
1102472, // 赫裡希安精銳法師披風
1102473, // 赫裡希安精銳弓箭手披風
1102474, // 赫裡希安精銳盜賊披風
1102475, // 赫裡希安精銳海盜披風
1132164, // 赫裡希安精銳劍士腰帶
1132165, // 赫裡希安精銳法師腰帶
1132166, // 赫裡希安精銳弓箭手腰帶
1132167, // 赫裡希安精銳盜賊腰帶
1132168 // 赫裡希安精銳海盜腰帶
                    );
                item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "累計金額大轉盤(600)");
            } else {
         var itemList = new Array(
1532098, //法弗納榮耀炮 - (無描述)
1522094, //法弗納雙風翼弩 - (無描述)
1492179, //法弗納左輪槍 - (無描述)
1482168, //法弗納巨狼之爪 - (無描述)
1472214, //法弗納危險之手 - (無描述)
1462193, //法弗納風翼弩 - (無描述)
1452205, //法弗納追風者 - (無描述)
1442223, //法弗納半月寬刃斧 - (無描述)
1432167, //法弗納貫雷槍 - (無描述)
1422140, //法弗納閃電錘 - (無描述)
1412135, //法弗納戰鬥切肉斧 - (無描述)
1402196, //法弗納懺悔之劍 - (無描述)
1382208, //法弗納魔冠之杖 - (無描述)
1372177, //法弗納魔力奪取者 - (無描述)
1362090, //法弗納洞察手杖 - (無描述)
1342082, //法弗納急速之刃 - (無描述)
1332225, //法弗納大馬士革劍 - (無描述)
1322203, //法弗納戈耳迪錘 - (無描述)
1312153, //法弗納雙刃切肉斧 - (無描述)
1302275, //法弗納銀槲之劍 - (無描述)
1242061, //法弗納精神之刃 - 魯塔比斯套裝(海盜)專用武器
1242060, //法弗納精神之刃 - 魯塔比斯套裝(盜賊)專用武器
1232057, //法弗納死亡使者 - (無描述)
1222058, //法弗納天使手銃 - (無描述)
1003797, //高貴劍士頭盔 - (無描述)
1003798, //高貴流丹維奇帽 - (無描述)
1003799, //高貴遊俠貝雷帽 - (無描述)
1003800, //高貴刺客軟帽 - (無描述)
1003801, //高貴流浪者帽 - (無描述)
1042254, //鷹眼劍士盔甲 - (無描述)
1042255, //鷹眼丹維奇長袍 - (無描述)
1042256, //鷹眼遊俠斗篷 - (無描述)
1042257, //鷹眼刺客襯衣 - (無描述)
1042258, //鷹眼流浪者外衣 - (無描述)
1062165, //魔術師劍士短褲 - (無描述)
1062166, //魔術師丹維奇短褲 - (無描述)
1062167, //魔術師遊俠短褲 - (無描述)
1062168, //魔術師刺客短褲 - (無描述)
1062169, //魔術師流浪者短褲 - (無描述)
1212063//法弗納魔力源泉杖 - (無描述)
            );
                item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "累計金額大轉盤(600)");
        }
            if (item != -1) {
        cm.gainNX( -20000);
                cm.sendOk("你獲得了 #b#t" + item + "##k.");
        cm.dispose();
            } else {
                cm.sendOk("你確實累計金額到600了嗎或足夠2萬樂豆點?如果是,請你確認在背包的裝備,消耗,其他窗口中是否有一格以上的空間?");
        cm.dispose();
            }
        } else {
            cm.sendOk("出現錯誤 或 您取消");
        cm.dispose();
}
}
