/*      
 *  
 *  功能：絕版點裝
 *  
 */


﻿var a = 0;
var text;
var selects; //記錄玩家的選項
var buynum = 0;
var itemlist = Array(
        Array(1004156, 300), // 來自星星的你 // 由中國楓之谷玩家"小術"設計。人物帶上耳罩後，漂浮起來。後面出現動畫效果。
        Array(1004157, 300), // 來自心心的我 // 由中國楓之谷玩家"小術"設計。帶上耳罩後，漂浮起來。後面出現動畫效果。
        Array(1402037, 200), //龍背
        Array(1402014, 200),
        Array(1072337, 50), // 喜洋洋拖鞋 // (無描述)
        Array(1042198, 80), // 彩虹T恤 // (無描述)
        Array(1042321, 50), // 心花怒放T恤 // (無描述)
        Array(1112254, 80), // 豪華珍珠聊天戒指 // 由中國楓之谷玩家小術設計，在海底珍珠玲瓏光芒的環繞下輕鬆愉快的聊天吧。
        Array(1112143, 80), // 豪華珍珠名片戒指 // 由中國楓之谷玩家小術設計，在海底珍珠玲瓏光芒的環繞下展示自己的暱稱吧。
        Array(1112118, 50), // 可樂名片戒指 // 角色造型下面，以可口可樂顏色作為底色，以白色字體顯示角色名稱。
        Array(1112119, 50), // 可樂(Red) 名片戒指 // 角色造型下面，以可口可樂顏色作為底色，以白色字體顯示角色名稱。
        Array(1112120, 50), // 可樂(White) 名片戒指 // 角色造型下面，以可口可樂顏色作為底色，以紅色字體顯示角色名稱。
        Array(1112228, 50), // 可樂聊天戒指 // 角色對話的時候，聊天窗會變成可口可樂樣子
        Array(1112229, 50), // 可樂(Red)聊天戒指 // 角色對話的時候，聊天窗會變成類似可口可樂樣子
        Array(1112230, 50), // 可樂(White)聊天戒指 // 角色對話的時候，聊天窗會變成類似可口可樂樣子
        Array(1002524, 50), // 可樂帽 // (無描述)
        Array(1702533, 100), // 奶兔立拍得 // 由中國玩家「小術」設計的奶兔立拍得。\n可以裝備在#c所有武器#上的武器。
        Array(1702020, 10), // 棒棒糖 // 可裝備在#c/單手劍/單手斧/單手棍/短杖/長杖/短劍/魔法棒/的主武器#上。
        Array(1702459, 100), // 棉花糖武器 // 攻擊時可以看到羊形態的棉花糖。可裝備在#c所有的主武器#上。
        Array(1702302, 100), // 杯具 // 可裝備在#c除了/手炮/雙弩槍/以外的主武器#上。
        Array(1042285, 50), // 拼色點點T恤 // (無描述)
        Array(1042204, 50), // 漢堡T恤 // (無描述)
        Array(1000050, 30), // 薄荷雪水晶 // 裝備後可以漂浮在空中，同時伴隨雪花特效。
        Array(1112103, 20), // 嫩黃名片戒指 // 在角色的下面出來黃底黑字角色名。
        Array(1112253, 50), // 木乃伊對話框戒指 // 角色對話時, 顯示繃帶對話框。
        Array(1112142, 50), // 木乃伊名片戒指 // 在角色下面的繃帶上顯示角色名。
        Array(1112135, 50), // 水墨花名片戒指 // 在角色腳底下，用以水墨畫背景用白色的字體顯示角色名字。
        Array(1112238, 50), // 水墨花聊天戒指 // 角色在聊天時，會出現水墨畫對話框。
        Array(1004014, 50),
        Array(1004026, 25),
        Array(1004027, 25),
        Array(1004028, 25),
        Array(1004029, 30),
        Array(1003588, 50), // 玩具粉熊帽子 // (無描述)
        Array(1003843, 300), // 奇怪的狐狸面具 // 平時附在頭頂，會根據動作顯示不一樣的形象。攻擊時會戴在臉上的面具型帽子
        Array(1002846, 20), //華爾茲絲帶貝雷帽
        Array(1050152, 15), //水兵服(男)
        Array(1051180, 15), //水兵服(女)
        Array(1042104, 15), //小綠葉T恤
        Array(1042105, 15), //小紅葉T恤
        Array(1002845, 20), //粉紅兔耳帽
        Array(1052224, 20), //草莓baby裝
        Array(1702228, 30), //可可香蕉
        Array(1002721, 10), //狸毛護耳
        Array(1002568, 10), //手工編織髮夾
        Array(1702155, 30), //絢麗彩虹
        Array(1042142, 30), //彩虹條背心
        Array(1062093, 30), //嫩綠休閒短褲
        Array(1112904, 50), //彩虹星環繞戒指
        Array(1041142, 20), //巨星蛋糕吊帶
        Array(1061148, 20), //巨星粉色短裙
        Array(1702182, 50), //洛麗波板糖
        Array(1002888, 10), //絲帶髮箍(紅色)
        Array(1002890, 10), //絲帶髮箍(藍色)
        Array(1052200, 30), //羅麗粉色娃娃套服
        Array(1702208, 50), //搞怪鱷魚
        Array(1002863, 10), //小熊熊可愛帽
        Array(1052061, 5), //巴西足球服No.9
        Array(1052059, 5), //法國足球服No.14
        Array(1003207, 30), //胡蘿蔔兔爆炸頭
        Array(1702285, 50), //藍色蝴蝶結手提包
        Array(1012131, 5), //好白的牙
        Array(1702261, 50), //櫻花棒
        Array(1702091, 50), //網球拍
        Array(1702168, 100), //閃亮聖誕樹
        Array(1003051, 50), //小狐狸
        Array(1003048, 20), //聖誕裝飾帽
        Array(1002995, 20), //皇家海軍帽
        Array(1003012, 5), //嫦娥髮式
        Array(1002876, 10), //聖誕紅髮夾
        Array(1002839, 20), //南瓜棒球帽
        Array(1001048, 20), //鬼娃娃帽
        Array(1102225, 20), //嫦娥披風
        Array(1102217, 20), //九尾披風
        Array(1102157, 15), //傀儡枷鎖
        Array(1051131, 20), //聖誕女孩子服
        Array(1112916, 50), //寂寞單身戒指
        Array(1012179, 10), //鹿鼻子
        Array(1051152, 10), //玫瑰紅晚宴裙
        Array(1050210, 30), //藍色小背帶服
        Array(1112141, 10), //紅玫瑰名片戒指
        Array(1112252, 10), //紅玫瑰聊天戒指
        Array(1051280, 20), //端莊航服
        Array(1052426, 20), //戰鬥修女服
        Array(1051278, 20), //櫻桃雪套服
        Array(1050229, 20), //端莊韓服
        Array(1050227, 20), //薄荷雪套服
        Array(1051235, 10), //橙色小雞裙子
        Array(1052201, 10), //閃亮水手外套
        Array(1050232, 10), //甘菊下午茶
        Array(1051282, 10), //迷迭香下午茶
        Array(1052425, 10), //戰鬥牧師服
        Array(1052412, 10), //淘氣王子
        Array(1102503, 30), //貓咪洛麗塔披風
        Array(1052455, 10), //小蜜蜂外套
        Array(1052503, 10), //涼爽夏日全身裝
        Array(1051261, 10), //童話幻想
        Array(1050230, 10), //淘淘可愛禮服
        Array(1050231, 10), //侍女服
        Array(1051149, 10), //韓式公主服
        Array(1051192, 10), //海洋裹裹短裙
        Array(1051255, 10), //黃色晚禮服
        Array(1051256, 10), //藍色小背帶裙
        Array(1112422, 100), //炫色板戒指
        Array(1112424, 100), //黑羽筆戒指
        Array(1112930, 50), //西紅柿效果90天
        Array(1112136, 5), //香臘腸名片戒指
        Array(1102453, 50),
        Array(1102450, 50),
        Array(1102451, 50),
        Array(1102452, 50),
        Array(1102511, 50),
        Array(1102385, 50),
        Array(1102386, 50),
        Array(1102487, 50),
        Array(1112920, 15), //
        Array(1702367, 15),
        Array(1702341, 15),
        Array(1322102, 15),
        Array(1702366, 15),
        Array(1702352, 15),
        Array(1302037, 15),
        Array(1302061, 15),
        Array(1302063, 15),
        Array(1302080, 15),
        Array(1302084, 15),
        Array(1302085, 15),
        Array(1302087, 15),
        Array(1302169, 15),
        Array(1322051, 15),
        Array(1332032, 15),
        Array(1332053, 15),
        Array(1372017, 15),
        Array(1372031, 15),
        Array(1402049, 15),
        Array(1402063, 15),
        Array(1422011, 15),
        Array(1432039, 15),
        Array(1432046, 15),
        Array(1442026, 15),
        Array(1442065, 15),
        Array(1442088, 15),
        Array(1472063, 15),
        Array(1702342, 15),
        Array(1702337, 15),
        Array(1702335, 15),
        Array(1702330, 15),
        Array(1702346, 15),
        Array(1702341, 15),
        Array(1702340, 15),
        Array(1702324, 15),
        Array(1322102, 15),
        Array(1412056, 15),
        Array(1402110, 15),
        Array(1702310, 15),
        Array(1702329, 15),
        Array(1702316, 15),
        Array(1702309, 15),
        Array(1102380, 15),
        Array(1102385, 15),
        Array(1102386, 15),
        Array(1102238, 15),
        Array(1102241, 15),
        Array(1102248, 15),
        Array(1102245, 15),
        Array(1102265, 15),
        Array(1102285, 15),
        Array(1102286, 15),
        Array(1102287, 15),
        Array(1102270, 15),
        Array(1102273, 15),
        Array(1102288, 15),
        Array(1102253, 15),
        Array(1102298, 15),
        Array(1102299, 15),
        Array(1102297, 15),
        Array(1102310, 15),
        Array(1102319, 15),
        Array(1102272, 15),
        Array(1102323, 15),
        Array(1102324, 15),
        Array(1102349, 15),
        Array(1102325, 15),
        Array(1102326, 15),
        Array(1102338, 15),
        Array(1102350, 15),
        Array(1102374, 15),
        Array(1102353, 15),
        Array(1102357, 15),
        Array(1003214, 15),
        Array(1003141, 15),
        Array(1003269, 15),
        Array(1003268, 15),
        Array(1003492, 15),
        Array(1003493, 15),
        Array(1003494, 15),
        Array(1003495, 15),
        Array(1003496, 15),
        Array(1003519, 15),
        Array(1003520, 15),
        Array(1002726, 15),
        Array(1002524, 15),
        Array(1002714, 15),
        Array(1002841, 15),
        Array(1003220, 15),
        Array(1003219, 15),
        Array(1003170, 15),
        Array(1003226, 15),
        Array(1003227, 15),
        Array(1003232, 15),
        Array(1001064, 15),
        Array(1001075, 15),
        Array(1003252, 15),
        Array(1003249, 15),
        Array(1001036, 15),
        Array(1002425, 15),
        Array(1002677, 15),
        Array(1002702, 15),
        Array(1002707, 15),
        Array(1002728, 15),
        Array(1002743, 15),
        Array(1002749, 15),
        Array(1002758, 15),
        Array(1002788, 15),
        Array(1002812, 15),
        Array(1002851, 15),
        Array(1002858, 15),
        Array(1002867, 15),
        Array(1002939, 15),
        Array(1002971, 15),
        Array(1002972, 15),
        Array(1002980, 15),
        Array(1002997, 15),
        Array(1002998, 15),
        Array(1003091, 15),
        Array(1003114, 15),
        Array(1003075, 15),
        Array(1000043, 15),
        Array(1003149, 15),
        Array(1002988, 15),
        Array(1003154, 15),
        Array(1003159, 15),
        Array(1003169, 15),
        Array(1003193, 15),
        Array(1003194, 15),
        Array(1003195, 15),
        Array(1003196, 15),
        Array(1003271, 15),
        Array(1003360, 15),
        Array(1003359, 15),
        Array(1003417, 15),
        Array(1112204, 15),
        Array(1003581, 20),
        Array(1042263, 20),
        Array(1062173, 10),
        Array(1072820, 10),
        Array(1702422, 20),
        Array(1112101, 10),
        Array(1112937, 20),
        Array(1012134, 10),
        Array(1112907, 20),
        Array(1112928, 20),
        Array(1050119, 20),
        Array(1042198, 20),
        Array(1062072, 20),
        Array(1002566, 20),
        Array(1112145, 20),
        Array(1112257, 20),
        Array(1112146, 20),
        Array(1112258, 20),
        Array(1082549, 20),
        Array(1082548, 20),
        Array(1072843, 20),
        Array(1072832, 20),
        Array(1062174, 20),
        Array(1042204, 20),
        Array(1012208, 20),
        Array(1012165, 20),
        Array(1012412, 20),
        Array(1012413, 20),
        Array(1702442, 20),
        Array(1702422, 20),
        Array(1702446, 20),
        Array(1702460, 20),
        Array(1702408, 20),
        Array(1702415, 20),
        Array(1702403, 20),
        Array(1702402, 20),
        Array(1702375, 20),
        Array(1702348, 20),
        Array(1003965, 20),
        Array(1003964, 20),
        Array(1003920, 20),
        Array(1003921, 20),
        Array(1003918, 20),
        Array(1003861, 20),
        Array(1003865, 20),
        Array(1003919, 20),
        Array(1102593, 20),
        Array(1102564, 20),
        Array(1102615, 20),
        Array(1052661, 20),
        Array(1042277, 20),
        Array(1060181, 20),
        Array(1052593, 20),
        Array(1052536, 20),
        Array(1050312, 20),
        Array(1042236, 20),
        Array(1042240, 20),
        Array(1062157, 20),
        Array(1042265, 20),
        Array(1042241, 20),
        Array(1062156, 20),
        Array(1042238, 20),
        Array(1040192, 20),
        Array(1041194, 20),
        Array(1003505, 20),
        Array(1003504, 20),
        Array(1061207, 20)
        );

function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
            text = "#h0#,您可以在這裡兌換#e#b絕版點裝#r(試穿模式)#n#k,所購買物品#r試穿時間為5分鐘#k，請選擇你想要購買的物品\r\n#b#L0#點我進入到永久商城#l\r\n\r\n#b";
            for (var i = 1; i <= itemlist.length; i++) {
                if (!cm.isCash(itemlist[i - 1][0]))
                {
                    continue;
                }
                text += "#L" + (i) + "##i" + itemlist[i - 1] + ":##t" + itemlist[i - 1] + "# - #r" + (itemlist[i - 1][1] * 10) + "#b楓點  \r\n";
                if (i != 0 && (i + 1) % 5 == 0) {
                    text += "\r\n";
                }
            }
            cm.sendSimple(text);
        } else if (a == 1) {
            if (selection == 0) {
                cm.dispose();
                cm.openNpc(9000069, 1);
                return;
            } else {
                selects = (selection - 1);
                // cm.sendGetNumber("請輸入你請你輸入想要購買的數量#v"+itemlist[selects]+"#\r\n\r\n#r1個需要" + (itemlist[selects][1]*10) + "個#b楓點#k", 0, 0, 999999);
            }
            buynum = 1;
            cm.sendYesNo("你想購買" + buynum + "個#r#i" + itemlist[selects][0] + "##k？\r\n你將使用掉" + (buynum * itemlist[selects][1] * 10) + "楓點。");
        } else if (a == 2) {
            if (cm.getPlayer().getCSPoints(2) >= buynum * itemlist[selects][1] * 10) {
                cm.gainNX(2, -buynum * itemlist[selects][1] * 10);
                cm.gainItemPeriod(itemlist[selects][0], buynum, 5 * 60 * 1000);
                cm.sendOk("購買成功了！#r試穿時間為5分鐘#k");
                cm.dispose();
            } else {
                cm.sendOk("對不起，你沒有足夠的楓點。");
                cm.dispose();
            }
        }
    }//mode
}//f