var a = 0;
var text;
var selects; //記錄玩家的選項
var buynum = 0;
var itemlist = Array(
Array(2040633, 400), //褲裙體力卷軸65%
Array(2040634, 400), //褲裙體力卷軸15%
Array(2040635, 200), //褲裙敏捷卷軸65%
Array(2040636, 400), //褲裙敏捷卷軸15%
Array(2040700, 200), //鞋子敏捷度卷軸100%
Array(2040701, 300), //鞋子敏捷度卷軸60%
Array(2040702, 400), //鞋子敏捷度卷軸10%
Array(2040703, 200), //鞋子跳躍卷軸100%
Array(2040704, 300), //鞋子跳躍卷軸60%
Array(2040705, 400), //鞋子跳躍卷軸10%
Array(2040706, 500), //鞋子速度卷軸100%
Array(2040707, 500), //鞋子速度卷軸60%
Array(2040708, 500), //鞋子速度卷軸10%
Array(2040712, 500), //鞋子敏捷詛咒卷軸70%
Array(2040713, 500), //鞋子敏捷詛咒卷軸30%
Array(2040714, 500), //鞋子跳躍詛咒卷軸70%
Array(2040715, 500), //鞋子跳躍詛咒卷軸30%
Array(2040716, 500), //鞋子速度詛咒卷軸70%
Array(2040717, 500), //鞋子速度詛咒卷軸30%
Array(2040718, 300), //鞋子敏捷卷軸65%
Array(2040719, 400), //鞋子敏捷卷軸15%
Array(2040720, 300), //鞋子跳躍卷軸65%
Array(2040721, 300), //鞋子跳躍卷軸15%
Array(2040722, 500), //鞋子速度卷軸65%
Array(2040723, 500), //鞋子速度卷軸15%
Array(2040727, 500), //鞋子防滑卷軸10%
Array(2040800, 300), //手套敏捷卷軸100%
Array(2040801, 400), //手套敏捷卷軸60%
Array(2040802, 300), //手套敏捷卷軸10%
Array(2040803, 100), //手套攻擊卷軸100%
Array(2040804, 400), //手套攻擊卷軸60%
Array(2040805, 200), //手套攻擊卷軸10%
Array(2040808, 500), //手套敏捷詛咒卷軸70%
Array(2040809, 500), //手套敏捷詛咒卷軸30%
Array(2040810, 100), //手套攻擊詛咒卷軸70%
Array(2040811, 100), //手套攻擊詛咒卷軸30%
Array(2040812, 500), //手套體力卷軸70%
Array(2040813, 500), //手套體力卷軸30%
Array(2040814, 500), //手套魔力詛咒卷軸70%
Array(2040815, 500), //手套魔力詛咒卷軸30%
Array(2040816, 500), //手套魔力卷軸10%
Array(2040817, 500), //手套魔力卷軸60%
Array(2040818, 500), //手套魔力卷軸100%
Array(2040819, 500), //手套敏捷卷軸65%
Array(2040820, 500), //手套敏捷卷軸15%
Array(2040821, 300), //手套攻擊卷軸65%
Array(2040822, 300), //手套攻擊卷軸15%
Array(2040823, 200), //手套體力卷軸100%
Array(2040824, 500), //手套體力卷軸60%
Array(2040825, 500), //手套體力卷軸10%
Array(2040831, 500), //手套體力卷軸65%
Array(2040832, 500), //手套體力卷軸15%
Array(2040900, 500), //盾牌防禦卷軸
Array(2040901, 500), //盾牌防禦卷軸60%
Array(2040902, 500), //盾牌防禦卷軸10%
Array(2040904, 500), //盾牌防禦詛咒卷軸70%
Array(2040905, 500), //盾牌防禦詛咒卷軸30%
Array(2040906, 500), //盾牌運氣卷軸70%
Array(2040907, 500), //盾牌運氣卷軸30%
Array(2040908, 500), //盾牌體力卷軸70%
Array(2040909, 500), //盾牌體力卷軸30%
Array(2040910, 500), //盾牌防禦卷軸65%
Array(2040911, 500), //盾牌防禦卷軸15%
Array(2040914, 300), //盾牌攻擊卷軸60%
Array(2040915, 300), //盾牌攻擊卷軸10%
Array(2040916, 400), //盾牌攻擊詛咒卷軸70%
Array(2040917, 200), //盾牌攻擊詛咒卷軸30%
Array(2040919, 200), //盾牌魔力卷軸60%
Array(2040920, 300), //盾牌魔力卷軸10%
Array(2040921, 300), //盾牌魔力詛咒卷軸70%
Array(2040922, 400), //盾牌魔力詛咒卷軸30%
Array(2040923, 200), //盾牌運氣卷軸100%
Array(2040924, 300), //盾牌運氣卷軸60%
Array(2040925, 400), //盾牌運氣卷軸10%
Array(2040926, 800), //盾牌體力卷軸100%
Array(2040927, 800), //盾牌體力卷軸60%
Array(2040928, 800), //盾牌體力卷軸10%
Array(2040929, 400), //盾牌力量卷軸100%
Array(2040930, 300) //盾牌力量卷軸70%
);

function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
            text = "#h0#,您可以在這裡購買#e#b普通卷軸#n#k,請選擇你想要購買的物品\r\n#b";
            for (var i=0; i<itemlist.length; i++) {
                text += "#L" + i + "##i" + itemlist[i] + ":##t" + itemlist[i] + "# - #r"+(itemlist[i][1]*500)+"#b遊戲幣  \r\n";
                if (i != 0 && (i+1) % 5 == 0) {
                    text += "\r\n";
                }
            }
            cm.sendSimple(text);
        } else if (a == 1) {
            selects = selection;
            cm.sendGetNumber("請輸入你請你輸入想要購買的數量\r\n\r\n#r1個需要" + (itemlist[selects][1]*500) + "個#b遊戲幣#k", 0, 0, 999999);
        } else if (a == 2) {
            buynum = selection;
            cm.sendNext("你想購買" + buynum + "個#r#i" + itemlist[selects][0] + "##k？\r\n你將使用掉" + (buynum * itemlist[selects][1]*500) + "遊戲幣。");
        } else if (a == 3) {
            if (cm.getPlayer().getMeso() >= -buynum * itemlist[selects][1]*500) {
                cm.gainMeso(-buynum * itemlist[selects][1]*500);
                cm.gainItem(itemlist[selects][0], buynum);
                cm.sendOk("購買成功了！");
                cm.dispose();
            } else {
                cm.sendOk("對不起，你沒有足夠的遊戲幣。");
                cm.dispose();
            }
        }
    }//mode
}//f