var a = 0;
var text;
var selects; //記錄玩家的選項
var buynum = 0;
var itemlist = Array(
Array(2040407, 500), //上衣力量卷軸30%
Array(2040408, 500), //上衣體力卷軸70%
Array(2040409, 500), //上衣體力卷軸30%
Array(2040410, 300), //上衣運氣詛咒卷軸70%
Array(2040411, 300), //上衣運氣詛咒卷軸30%
Array(2040412, 300), //上衣運氣卷軸10%
Array(2040413, 300), //上衣運氣卷軸60%
Array(2040414, 500), //上衣運氣卷軸100%
Array(2040415, 500), //上衣防禦力卷軸65%
Array(2040416, 500), //上衣防禦力卷軸15%
Array(2040417, 500), //上衣力量卷軸100%
Array(2040418, 500), //上衣力量卷軸60%
Array(2040419, 500), //上衣力量卷軸10%
Array(2040420, 500), //上衣體力卷軸100%
Array(2040421, 500), //上衣體力卷軸60%
Array(2040422, 500), //上衣體力卷軸10%
Array(2040423, 500), //上衣運氣卷軸100%
Array(2040424, 500), //上衣運氣卷軸70%
Array(2040425, 500), //上衣運氣卷軸60%
Array(2040426, 500), //上衣運氣卷軸30%
Array(2040427, 500), //上衣運氣卷軸10%
Array(2040431, 500), //上衣力量卷軸65%
Array(2040432, 500), //上衣力量卷軸15%
Array(2040433, 500), //上衣體力卷軸65%
Array(2040434, 500), //上衣體力卷軸15%"
Array(2040435, 500), //上衣運氣卷軸65%
Array(2040436, 500), //上衣運氣卷軸15%
Array(2040500, 500), //全身鎧甲敏捷卷軸100%
Array(2040501, 200), //全身鎧甲敏捷卷軸60%
Array(2040502, 100), //全身鎧甲敏捷卷軸10%
Array(2040503, 300), //全身鎧甲防禦卷軸100%
Array(2040504, 100), //全身鎧甲防禦卷軸60%
Array(2040505, 200), //全身鎧甲防禦卷軸10%
Array(2040508, 300), //全身鎧甲敏捷詛咒卷軸70%
Array(2040509, 300), //全身鎧甲敏捷詛咒卷軸30%
Array(2040510, 300), //全身鎧甲防禦詛咒卷軸70%
Array(2040511, 300), //全身鎧甲防禦詛咒卷軸70%
Array(2040512, 300), //全身鎧甲智力卷軸100%
Array(2040513, 300), //全身鎧甲智力卷軸60%
Array(2040514, 200), //全身鎧甲智力卷軸10%
Array(2040515, 400), //全身鎧甲運氣卷軸100%
Array(2040516, 400), //全身鎧甲運氣卷軸60%
Array(2040517, 300), //全身鎧甲運氣卷軸10%
Array(2040518, 400), //全身盔甲智力卷軸70%
Array(2040519, 400), //全身盔甲智力卷軸30%
Array(2040520, 400), //全身盔甲幸運卷軸70%
Array(2040521, 400), //全身盔甲幸運卷軸30%
Array(2040522, 400), //全身盔甲敏捷卷軸65%
Array(2040523, 300), //全身盔甲敏捷卷軸15%
Array(2040524, 400), //全身盔甲防禦卷軸65%
Array(2040525, 400), //全身盔甲防禦卷軸15%
Array(2040526, 300), //全身盔甲智力卷軸65%
Array(2040527, 400), //全身盔甲智力卷軸15%
Array(2040528, 300), //全身盔甲幸運卷軸65%
Array(2040529, 400), //全身盔甲幸運卷軸15%
Array(2040530, 500), //全身盔甲力量卷軸100%
Array(2040531, 400), //全身盔甲力量卷軸70%
Array(2040532, 400), //全身盔甲力量卷軸60%
Array(2040533, 400), //全身盔甲力量卷軸30%
Array(2040534, 300), //全身盔甲力量卷軸10%
Array(2040540, 400), //全身盔甲力量卷軸65%
Array(2040541, 500), //全身盔甲力量卷軸15%
Array(2040600, 500), //褲/裙防禦卷軸100%
Array(2040601, 500), //褲/裙防禦卷軸60%
Array(2040602, 500), //褲/裙防禦卷軸10%
Array(2040604, 500), //褲/裙防禦詛咒卷軸70%
Array(2040605, 500), //褲/裙防禦詛咒卷軸30%
Array(2040606, 500), //褲裙跳躍詛咒卷軸70%
Array(2040607, 500), //褲裙跳躍詛咒卷軸30%
Array(2040608, 500), //褲裙體力詛咒卷軸70%
Array(2040609, 500), //褲裙體力詛咒卷軸30%
Array(2040610, 500), //褲裙敏捷詛咒卷軸70%
Array(2040611, 500), //褲裙敏捷詛咒卷軸30%
Array(2040612, 500), //褲裙敏捷卷軸10%
Array(2040613, 500), //褲裙敏捷卷軸60%
Array(2040614, 500), //褲裙敏捷卷軸100%
Array(2040615, 500), //褲裙防禦卷軸65%
Array(2040616, 500), //褲裙防禦卷軸15%
Array(2040617, 500), //褲裙跳躍卷軸100%
Array(2040618, 500), //褲裙跳躍卷軸60%
Array(2040619, 500), //褲裙跳躍卷軸10%
Array(2040620, 500), //褲裙體力卷軸100%
Array(2040621, 500), //褲裙體力卷軸60%
Array(2040622, 500), //褲裙體力卷軸10%
Array(2040623, 300), //褲裙敏捷卷軸100%
Array(2040624, 300), //褲裙敏捷卷軸70%
Array(2040625, 300), //褲裙敏捷卷軸60%
Array(2040626, 300), //褲裙敏捷卷軸30%
Array(2040627, 200), //褲裙敏捷卷軸10%
Array(2040631, 100), //褲裙跳躍卷軸65%
Array(2040632, 300)//褲裙跳躍卷軸15%
);

function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
            text = "#h0#,您可以在這裡購買#e#b普通卷軸#n#k,請選擇你想要購買的物品\r\n#b";
            for (var i=0; i<itemlist.length; i++) {
                text += "#L" + i + "##i" + itemlist[i] + ":##t" + itemlist[i] + "# - #r"+(itemlist[i][1]*500)+"#b遊戲幣  \r\n";
                if (i != 0 && (i+1) % 5 == 0) {
                    text += "\r\n";
                }
            }
            cm.sendSimple(text);
        } else if (a == 1) {
            selects = selection;
            cm.sendGetNumber("請輸入你請你輸入想要購買的數量\r\n\r\n#r1個需要" + (itemlist[selects][1]*500) + "個#b遊戲幣#k", 0, 0, 999999);
        } else if (a == 2) {
            buynum = selection;
            cm.sendNext("你想購買" + buynum + "個#r#i" + itemlist[selects][0] + "##k？\r\n你將使用掉" + (buynum * itemlist[selects][1]*500) + "遊戲幣。");
        } else if (a == 3) {
            if (cm.getPlayer().getMeso() >= -buynum * itemlist[selects][1]*500) {
                cm.gainMeso(-buynum * itemlist[selects][1]*500);
                cm.gainItem(itemlist[selects][0], buynum);
                cm.sendOk("購買成功了！");
                cm.dispose();
            } else {
                cm.sendOk("對不起，你沒有足夠的遊戲幣。");
                cm.dispose();
            }
        }
    }//mode
}//f