/*      
 *  
 *  功能：趣味問答
 *  
 */

﻿var tknow = 0;
var typed = 0;
var Qicon = "#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#";
var icon = "#fUI/Basic/BtHide3/mouseOver/0#";
var tzIcon = "#fUI/Basic/BtCoin/mouseOver/1#";
var ca = java.util.Calendar.getInstance();
var year = ca.get(java.util.Calendar.YEAR); //獲得年份
var month = ca.get(java.util.Calendar.MONTH) + 1; //獲得月份
var day = ca.get(java.util.Calendar.DATE);//獲取日
var hour = ca.get(java.util.Calendar.HOUR_OF_DAY); //獲得小時
var minute = ca.get(java.util.Calendar.MINUTE);//獲得分鐘
var second = ca.get(java.util.Calendar.SECOND); //獲得秒
var time1;
var time2;
var startTime = 55;
var endTime = 59;
var timeout = 5; //超時時間

function updateDate() {
    ca = java.util.Calendar.getInstance();
    year = ca.get(java.util.Calendar.YEAR); //獲得年份
    month = ca.get(java.util.Calendar.MONTH) + 1; //獲得月份
    day = ca.get(java.util.Calendar.DATE);//獲取日
    hour = ca.get(java.util.Calendar.HOUR_OF_DAY); //獲得小時
    minute = ca.get(java.util.Calendar.MINUTE);//獲得分鐘
    second = ca.get(java.util.Calendar.SECOND); //獲得秒
}
function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (status >= 0 && mode == 0) {
            cm.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        } else {
            status--;
        }
        if (status == 0) {
            var text = "我是飽讀詩書的孔明，答題時間為每時#r" + startTime + "-" + endTime + "分#n#k,請準備：#b\r\n";
            text += "伺服器當前時間：#r" + hour + ":" + minute + ":" + second + "#n#k\r\n\r\n";
            text += Qicon + "今日答題總數: #r" + cm.getPQLog("答題總數") + " #b道#n#k\r\n";
            text += Qicon + "今日正確題目: #r" + cm.getPQLog("答題正確") + " #b道#n#k\r\n";
            text += "#L1##b" + icon + " 點此查看答題詳細規則（新手必看）#l\r\n";
            text += "#L2##b" + icon + " 開始答題（" + timeout + "秒限時，速度要快哦）#l\r\n";
            text += "#L3##r" + icon + " 答對題目數兌換/方塊/卷軸/樂豆點#l\r\n\r\n";
            text += "#b    <注意>:每天0點#r清空答題數據#b，請及時兌換\r\n";
            cm.sendSimple(text);
        } else if (status == 1) {
            if (selection == 1) {
                cm.sendOk("每次答題都有#b" + timeout + "秒鐘時間限制#k，超過時間則失敗，指定時間內回答錯誤也失敗！點擊開始答題後開始記時，在給出的題目中，#r一般有4個選項#k，請輸入你認為正確的選項，點擊確認即可完成答題.\r\n#r#e注意：每天的" + startTime + "分，#b如（1點" + startTime + "分至1點" + endTime + "分）#r,都可以答題，答題時間為5分鐘。每次回答正確後，將會#d隨機給你獎勵，如楓幣、樂豆點、活力值、積分或是楓葉！");
                cm.dispose();
                return;
            }
            if (selection == 2) {
                updateDate();
                if (minute >= startTime && minute <= endTime) {
                    var randx = Math.floor(Math.random() * 2);
                    typed = 1;
                    if (randx = 0) {
                        var randy = Math.floor(Math.random() * itemtk1.length);//取題庫1
                        tknow = itemtk1[randy];
                        cm.sendGetText(Qicon + "#b問題：" + tknow[0] + "\r\n#r============================================#n#k\r\n#d答案1:" + tknow[1] + "\r\n答案2:" + tknow[2] + "\r\n答案3:" + tknow[3] + "\r\n答案4:" + tknow[4] + "\r\n============================================#n#k\r\n#r請輸入你認為正確的答案,如果是答案1就填1，答案2就填2\r\n\r\n");
                        time1 = cm.getCurrentTime();
                    } else {
                        var randy = Math.floor(Math.random() * itemtk2.length);//取題庫2
                        tknow = itemtk2[randy];
                        cm.sendGetText(Qicon + "#b問題：" + tknow[0] + "\r\n#r============================================#n#k\r\n#d答案1:" + tknow[1] + "\r\n答案2:" + tknow[2] + "\r\n答案3:" + tknow[3] + "\r\n答案4:" + tknow[4] + "\r\n============================================#n#k\r\n#r請輸入你認為正確的答案,如果是答案1就填1，答案2就填2\r\n");
                        time1 = cm.getCurrentTime();
                    }
                } else {
                    cm.sendOk("當前伺服器時間:" + hour + "點" + minute + "分\r\n時間還沒到哦.整點的" + startTime + "-" + endTime + "分可以答題，例如:\r\n#b1點" + startTime + "分至1點" + endTime + "分\r\n#r而且可以答題的時候，系統會公告，請不要錯過。");
                    cm.dispose();
                }
            }
            if (selection == 3) {
                typed = 2;
                var selText = "截至目前為止，您答對的題目總數為:#r" + cm.getPQLog("答題正確") + "道#b\r\n";
                selText += "#L1#" + icon + " 換取(#i5062002#x2#i5062500#x2#i5064000#x1)(需要答對題目128道)#l\r\n";
                selText += "#L2#" + icon + " 換取答題高手勳章(#i1142072#)(需要答對題目400道)#l\r\n";
                selText += "#L3#" + icon + " 換取週年慶100%武器卷軸箱子(#i2431990#)(需要答對題目600道)#l\r\n";
                //selText += "#L4#" + icon + " 換取150級武器箱子(#i2431988#)(需要答對題目800道)#l\r\n\r\n";
                selText += "#e#r注意：第一項換取方塊和卷軸後，不會減少答題數目，但後面的選項會扣掉相應的答題數目！\r\n\r\n";
                cm.sendSimple(selText);
            }
        } else if (status == 2) {
            if (typed == 1) {
                cm.setPQLog("答題總數");
                time2 = cm.getCurrentTime();   //取出答題後的時間
                fee = cm.getText();
                if (selection == tknow[5] || fee == tknow[5]) {
                    //計算兩個時間差
                    if ((time2 - time1) / 1000 > timeout) {
                        status = -1;
                        cm.sendOk("很遺憾，回答是正確的，但是超時了！\r\n");
                        return;
                    }
                    var randx = Math.floor(Math.random() * 12) + 1;
                    var randy = Math.floor(Math.random() * 200000) + 5000;//楓幣
                    var randdj = Math.floor(Math.random() * 100) + 100;//樂豆點
                    var randdy = Math.floor(Math.random() * 10) + 5;//樂豆點
                    var randjf = Math.floor(Math.random() * 1) + 1;//積分
                    var randred = Math.floor(Math.random() * 5) + 5;//楓葉
                    cm.setPQLog("答題正確");
                    if (randx < 3) {//楓幣
                        cm.gainMeso(randy);
                        cm.sendOk("恭喜，您答對了！#b 正確答案:" + tknow[5] + "#k\r\n您獲得了 " + randy + " 楓幣.");
//                        cm.worldSpouseMessage(0x8, "[答題系統]：恭喜 " + cm.getChar().getName() + " 正確回答<諸葛孔明>的問題~得到 " + randy + " 楓幣~");
                    }
                    if (randx >= 3 && randx < 6) {//
                        cm.gainNX(2, randdj);
                        cm.sendOk("恭喜，您答對了！#b正確答案:" + tknow[5] + "#k\r\n您獲得了 " + randdj + "楓點.");
//                        cm.worldSpouseMessage(0x8, "[答題系統]：恭喜 " + cm.getChar().getName() + " 正確回答<諸葛孔明>的問題,得到 " + randdj + " 楓點~");
                    }
                    if (randx >= 6 && randx < 9) {//
                        cm.gainNX(1, randdy);
                        cm.sendOk("恭喜，您答對了！#b正確答案:" + tknow[5] + "#k\r\n您獲得了 " + randdy + " 樂豆點");
                        cm.worldSpouseMessage(0x8, "[答題系統]：恭喜 " + cm.getChar().getName() + " 正確回答<諸葛孔明>的問題,得到 " + randdy + " 樂豆點~");
                    }
                    if (randx >= 9 && randx <= 12) {//
                        //cm.gainPlayerPoints(randjf);
                        cm.gainItem(5072000, randjf);
//                        cm.sendOk("恭喜，您答對了！#b正確答案:" + tknow[5] + "#k\r\n您獲得了 " + randjf + " 高質地喇叭.");
//                        cm.worldSpouseMessage(0x8, "[答題系統]：恭喜 " + cm.getChar().getName() + " 正確回答<諸葛孔明>的問題,得到 " + randjf + " 高質地喇叭~");
                    }
//                    if (randx >= 12 && randx <= 15) {//楓葉
//                        cm.gainItem(4001126, randred);
//                        cm.sendOk("恭喜，您答對了！#b正確答案:" + tknow[5] + "#k\r\n您獲得了 " + randred + " 楓葉.");
//                        cm.worldSpouseMessage(0x8, "[答題系統]：恭喜 " + cm.getChar().getName() + " 正確回答<諸葛孔明>的問題,得到 " + randred + " 楓葉~");
//                    }
                    status = -1;
                    return;
                } else {
                    status = -1;
                    cm.sendOk("很遺憾，回答錯誤！\r\n");
                    //正確答案是：#r[" + tknow[5] + "]、" + tknow[tknow[5]]);
                    return;
                }
                cm.dispose();
                return;
            }
            if (typed == 2) {
                if (selection == 1) {//換取6個方塊和3個防爆卷軸
                    if (cm.getPQLog("答題128兌換") < 1) {
                        if (cm.getPQLog("答題正確") < 128) {
                            cm.sendOk("抱歉，您今天還沒有答對128道題目，請繼續努力！\r\n");
                            cm.dispose();
                            return;
                        }
                        if (cm.getSpace(2) < 3 || cm.getSpace(5) < 2) {
                            cm.sendOk("您的背包沒有空間，請保證消耗欄3空格、特殊欄2空格！\r\n");
                            cm.dispose();
                            return;
                        }
                        cm.gainItem(5062002, 2);//神奇方塊
                        cm.gainItem(5062500, 2);//神奇方塊
                        cm.gainItem(5064000, 1);//防爆卷
                        cm.setPQLog("答題128兌換");
                        cm.sendOk("恭喜，您使用正確答題數目兌換了#i5062000#x10,#i2531000#x5.");
                        cm.worldSpouseMessage(0x8, "[答題系統]:恭喜[" + cm.getChar().getName() + "]用正確答題數目兌換了大量方塊和卷軸~");
                    } else {
                        cm.sendOk("抱歉，您今天已經領取過了.");
                        cm.dispose();
                        return;
                    }
                } else if (selection == 2) {//換取135級武器箱子
                    if (cm.getPQLog("答題正確") < 400) {
                        cm.sendOk("抱歉，您今天還沒有答對400道題目，請繼續努力！\r\n");
                        cm.dispose();
                        return;
                    }
                    if (cm.getSpace(1) < 1) {
                        cm.sendOk("您的背包沒有空間，請至少保證裝備欄1空格！\r\n");
                        cm.dispose();
                        return;
                    }
                    cm.setPQLog("答題正確", 0, -400);
                    cm.gainItem(1142072, 1);//135級武器箱子
                    cm.sendOk("恭喜，您使用正確答題數目兌換了答題高手勳章#i1142072#.");
                    cm.worldSpouseMessage(0x8, "[答題系統]:恭喜[" + cm.getChar().getName() + "]用正確答題數目兌換了答題高手勳章~");
                } else if (selection == 3) {//換取140級武器箱子
                    if (cm.getPQLog("答題正確") < 600) {
                        cm.sendOk("抱歉，您今天還沒有答對600道題目，請繼續努力！\r\n");
                        cm.dispose();
                        return;
                    }
                    if (cm.getSpace(2) < 1) {
                        cm.sendOk("您的背包沒有空間，請至少保證消耗欄1空格！\r\n");
                        cm.dispose();
                        return;
                    }
                    cm.setPQLog("答題正確", 0, -600);
                    cm.gainItem(2431990, 1);//140級武器箱子
                    cm.sendOk("恭喜，您使用正確答題數目兌換了週年慶100%武器攻擊卷軸箱子#i2431990#.");
                    cm.worldSpouseMessage(0x8, "[答題系統]:恭喜[" + cm.getChar().getName() + "]用正確答題數目兌換了週年慶100%武器攻擊卷軸箱子~");
                } else if (selection == 4) {//換取150級武器箱子
                    if (cm.getPQLog("答題正確") < 800) {
                        cm.sendOk("抱歉，您今天還沒有答對800道題目，請繼續努力！\r\n");
                        cm.dispose();
                        return;
                    }
                    if (cm.getSpace(2) < 1) {
                        cm.sendOk("您的背包沒有空間，請至少保證消耗欄1空格！\r\n");
                        cm.dispose();
                        return;
                    }
                    cm.setPQLog("答題正確", 0, -800);
                    //cm.gainItem(2431996, 1);//150級武器箱子                    
                    cm.sendOk("恭喜，您使用正確答題數目兌換了150級武器箱子#i2431988#.");
                    cm.worldSpouseMessage(0x8, "[答題系統]:恭喜[" + cm.getChar().getName() + "]用正確答題數目兌換了150級武器箱子~");
                }
                cm.dispose();
                return;
            }
        }
    }
}


var itemtk1 = Array(
        Array("大煮乾絲是哪個菜系的代表菜之一", "四川菜系", "山東菜系", "廣東菜系", "淮揚菜系", "4"),
        Array("紅茶屬於( )茶", "半發酵", "發酵", "不發酵", "微發酵", "1"),
        Array("滿漢全席起興於", "清代", "唐代", "宋代", "兩漢", "1"),
        Array("吃冰淇淋不解渴主要是因為它:", "含蛋白質", "含脂肪", "含糖", "含鹽", "3"),
        Array("下列哪項是人體的造血器官?", "心臟", "骨髓", "腎臟", "脾臟", "2"),
        Array("下列哪種球類沒有越位的規則?", "足球", "籃球", "冰球", "橄欖球", "2"),
        Array("我國鐵路部門規定身高多少的兒童要買全票?", "1.2米", "1.3米", "1.4米", "1.5米", "3"),
        Array("敲門磚一詞源於:", "考試", "拜師", "做官", "應聘", "3"),
        Array("工筆是哪種繪畫形式的技法", "水彩畫", "油畫", "水粉畫", "國畫", "4"),
        Array("冰淇淋是從哪國傳進的外來語", "英國", "法國", "美國", "俄羅斯", "1"),
        Array("席夢思三個字源於", "人名", "地名", "字典", "文獻", "1"),
        Array("八仙過海中的八仙除鐵拐李、張果老、呂洞賓、曹國舅外還有", "韓非子、藍采和、何翠姑、漢鍾離", "藍采和、何仙姑、韓非子、漢鍾離", "韓湘子、藍采和、何仙姑、紅孩兒", "韓湘子、藍采和、何仙姑、漢鍾離", "4"),
        Array("無冕之王的由來與下列哪一個有關", "英國《泰晤士報》", "法國《費加羅報》", "美國《太陽報》", "德國《明鏡》週刊", "1"),
        Array("老三屆指的是那幾年畢業的初、高中畢業生", "1964--1966 ", "1966--1968 ", "1969--1971", "1972--1975", "2"),
        Array("博士作為官名最早出現在", "秦", "漢", "唐", "宋", "1"),
        Array("謬種流傳最早是宋朝人批評當時的", "官場黑暗", "科舉制度", "社會風氣", "詩詞風格", "2"),
        Array("《在那遙遠的地方》是哪裡的民歌", "四川民歌", "江蘇民歌", "蒙古民歌", "青海民歌", "4"),
        Array("人體含水量百分比最高的器官是", "心臟", "肝臟", "腎臟", "眼球", "4"),
        Array("人體最大的解毒器官是", "胃", "腎臟", "肝臟", "脾臟", "3"),
        Array("下半旗是把旗子下降到", "旗桿的一半處", "下降1米", "下降1．5米", "距離桿頂的1/3處", "4"),
        Array("下列地點與電影獎搭配不正確的是", "戛納-金棕櫚 ", "亞洲-金馬", "洛杉磯-奧斯卡", "柏林-聖馬克金獅", "4"),
        Array("下列哪種郵件如果丟失了，郵局不負賠償責任", "平信", "掛號信", "保價郵件", "特快轉遞郵件", "1"),
        Array("下面哪種酸，人在品嚐時不是酸味的", "琥珀酸", "蘋果酸", "檸檬酸", "單寧酸", "4"),
        Array("土豆不宜存放在什麼地方", "乾燥處", "通風處", "日光照射處", "臥室內", "3"),
        Array("小華家的電燈絲斷了，他把燈泡晃了晃使燈絲又搭上了，再用的時候會發現", "燈比原來亮了", "燈比原來暗了", "跟原來一樣", "燈不亮了", "1"),
        Array("飛機票頭等艙的票價一般為普通艙票價的", "200%", "180%", "150%", "130%", "3"),
        Array("馬拉松賽跑中的馬拉松一詞是指", "人名", "地名", "書本名", "文獻名", "1"),
        Array("中國無聲影片的最高峰《神女》是誰的代表作", "阮玲玉", "王人美", "上官雲珠", "張瑞芳", "1"),
        Array("中國民間送灶神時要吃粘牙的甜食，這是為了", "容易打發小孩子", "是灶神喜歡的食品", "甜為吉利", "用糖粘住灶神的牙", "4"),
        Array("中國抗日戰爭中，最早為抗擊日寇犧牲的中國將領是", "張治中", "張自忠", "趙登禹", "左權", "3"),
        Array("中國鐵路車票一般分為幾種", "3種", "4種", "5種", "6種", "1"),
        Array("什麼時間吃水果比較好", "起床後", "睡覺前", "吃飯前", "吃飯後", "3"),
        Array("從何時起，對最高統治者稱王", "夏", "商", "周", "春秋", "2"),
        Array("方便面裡必然有哪種食品添加劑", "防腐劑", "合成抗氧化劑", "食用色素", "甜蜜素", "2"),
        Array("父母和一個已婚子女及其配偶、後代所組成的家庭屬於什麼類型的家庭", "復閤家庭", "單身家庭", "核心家庭", "直系家庭", "4"),
        Array("世界上最大最貴的鑽石藏在", "中國紫禁城", "英國王室", "法國盧浮宮", "美國華爾街", "2"),
        Array("世界上最高的立式佛像--巴米楊佛在哪個國家", "印度尼西亞", "伊拉克", "阿富汗", "中國", "3"),
        Array("仙人掌進行光合作用是依靠", "根", "莖", "葉", "花", "3"),
        Array("以下哪一類茶是半發酵茶", "紅茶", "綠茶", "烏龍茶", "花茶", "3"),
        Array("古時戒指用來表示", "榮譽", "富貴", "禁戒", "婚否", "3"),
        Array("漢朝最先下詔廢除肉刑的皇帝是", "漢武帝", "漢成帝", "漢文帝", "漢景帝", "3"),
        Array("全世界最大的石佛像在", "四川樂山", "河南洛陽", "四川屏山", "四川江津", "1"),
        Array("吃太多手搖爆米花機爆出的米花會導致", "錫中毒", "鉛中毒", "汞中毒", "銀中毒", "2"),
        Array("在英語當中，哪兩個字母的出現頻率最高", "e.t", "t.h", "h.m", "m.e", "1"),
        Array("多大的數字被稱為天文數字", "千萬以上", "億以上", "百億以上", "千億以上", "2"),
        Array("有植物熊貓之稱的是", "銀杏", "銀杉", "雲杉", "紅豆杉", "2"),
        Array("自來水表上的一度水表示耗水量為", "100公斤水", "1000公斤水", "1噸水", "1立方米水", "4"),
        Array("西印度群島位於", "印度洋", "大西洋", "太平洋", "地中海", "2"),
        Array("我國最先出現的紙幣是", "元代寶鈔", "元代交子", "宋代寶鈔", "宋代交子", "4"),
        Array("只獲得過1次諾貝爾獎的有", "居里夫人", "格林加德", "桑格", "巴丁", "2"),
        Array("麥當勞的經營方式是什麼", "直營連鎖", "特許加盟", "特許經營", "加盟連鎖", "3"),
        Array("味精的主要成分是什麼", "谷氨酸鈉", "醋酸", "氯化鈉", "碘化鈉", "1"),
        Array("狗熱時用什麼散熱", "皮膚", "舌頭", "鼻子", "耳朵", "2"),
        Array("現在美國國旗星條旗上有多少顆星", "25", "30", "50", "60", "3"),
        Array("蘋果中含有增強記憶力的微量元素是", "鐵", "鋅", "鈣", "鈉", "2"),
        Array("陝西乾陵武則天墓碑上有幾個字", "1000", "899", "699", "0", "4"),
        Array("魚、蛙、蛇等冷血動物的體溫是", "冷的", "隨外界的溫度變化而變化", "隨體形的大小變化而變化", "熱的", "2"),
        Array("舉世聞名的泰姬陵在", "泰國", "印度", "柬埔寨", "老撾", "2"),
        Array("俗稱四不像的動物是", "麋鹿", "白唇鹿", "斑馬", "梅花鹿", "1"),
        Array("按照風俗習慣戒指帶在中指上表示", "正在尋找對象", "正在戀愛之中", "表示獨身", "表示離婚", "2"),
        Array("樹幹為什麼常常刷成白色", "防火", "滅菌", "放蟲", "保暖", "2"),
        Array("洗魚後手上有腥味用下列哪種東西可以去除", "肥皂", "牙膏", "奶粉", "自來水", "2"),
        Array("相傳我國古代能作掌上舞的人是", "楊玉環", "趙飛燕", "西施", "貂蟬", "2"),
        Array("美國的那斯達克股票市場屬於", "主板股票市場", "創業板股票市場", "權重板股票市場", "期貨市場", "2"),
        Array("骨折時伴隨休克發生，應先治", "骨折", "休克", "止痛", "止血", "2"),
        Array("射出去的子彈頭是怎麼飛行", "直線", "旋轉", "弧線", "交叉線", "2"),
        Array("被公認為體育運動和健美體魄象徵的雕像是", "大衛", "維納斯", "擲鐵餅者", "思想者", "3"),
        Array("菊花在秋天開，如果把菊花一直放在溫暖的環境裡，這些菊花會怎麼樣", "全開花", "全不開花", "開一半的花", "全部死掉", "2"),
        Array("智力的核心是", "機械記憶能力", "注意力", "抽像思維能力", "觀察力", "3"),
        Array("最初糖果的糖取自", "甜菜", "蜂蜜", "甘蔗", "蘿蔔", "2"),
        Array("遺產繼承的第二順序是", "祖父母、外祖父母、兄弟姐妹", "兄弟姐妹、外祖父母、祖父母", "兄弟姐妹、祖父母、外祖父母", "祖父母、兄弟姐妹、外祖父母", "3"),
        Array("數學符號中的0起源於", "古印度", "古希臘", "古埃及", "古羅馬", "1"),
        Array("饅頭起源於", "東方", "南方", "西方", "北方", "2"),
        Array("醋放久了會生白，為了防止其生白，最好在醋內加一些黃酒後再摻入少許", "薑末", "白糖", "精鹽", "味精", "3"),
        Array("燕窩中最珍貴的是", "官燕", "毛燕", "血燕", "白燕", "3"),
        Array("感冒忌用下列哪一種食物", "海魚", "豆漿", "青菜", "生薑", "1"),
        Array("老年人一天吃幾隻雞蛋才合適", "2", "1－2", "1", "2－3", "2"),
        Array("檸檬汁有哪些營養含量", "維生素A和維生素C", "維生素B1和維生素C", "維生素C ", "維生素B6", "1"),
        Array("酒中含有酒精，飲酒過多或經常飲酒，會造成酒精中毒，使身體受損，那麼，飲酒對人體的哪些器官最為有害？", "眼睛", "皮膚", "心臟", "肺", "3"),
        Array("關於合理飲食有利於健康的下列說法正確的是", "沒有水就沒有生命", "飲用水越純淨越好", "養成良好的飲食習慣，多吃蔬菜、水果等鹼性食物", "調味劑和營養劑加得越多越好", "3"),
        Array("低鹽飲食有利於預防什麼疾病？", "乙型肝炎", "糖尿病", "高血壓", "貧血", "3"),
        Array("碘缺乏會導致兒童、青少年", "甲亢", "無力", "心理疾病", "生長發育和智力受影響", "4"),
        Array("夏季在烈日下工作或運動量過大出汗多時，為預防中暑應多喝", "糖水", "糖醋水", "鹽開水", "白開水", "3"),
        Array("燒菜時最好在何時加碘鹽以減少碘的損失？", "燒菜前用碘鹽爆鍋", "燒菜加水後", "燒菜加水前", "菜將出鍋時", "4"),
        Array("某人由於營養不良，身體浮腫，其食療補救措施是", "多吃蔬菜", "多喝豆汁", "多吃饅頭", "多喝水", "2"),
        Array("下列不屬於營養物質的是", "食物中的葡萄糖", "肝糖元分解形成的葡萄糖", "飲水中的碘", "食物中的胡蘿蔔素", "2"),
        Array("下列關於營養物質的敘述中，正確的是", "營養物質攝入過多時，一定使人發胖", "營養物質攝入過多時，一定排出", "營養物質攝入過多時，氧化分解加強，釋放能量多", "在人體內可以利用必需氨基酸合成非必需氨基酸", "4"),
        Array("某小學組織學生體檢時發現一學生頭圍較小，智商較低，情感淡漠。據老師反映該學生書寫困難，學習能力差。其原因是", "嬰幼兒時期嚴重營養不良", "嚴重缺鈣", "兒童時期營養不良", "缺鋅", "1"),
        Array("在人的一生中，腦發育的最關鍵時期是", "胎兒期和嬰兒期", "嬰兒期和兒童期", "兒童期和青春期", "青春期和嬰兒期", "1"),
        Array("有關維生素的敘述不正確的是", "是維持機體新陳代謝必不可少的物質", "是構建機體組織和調節機體生理功能必不可少的物質", "是某些特殊生理功能所不可缺少的物質", "絕大多數維生素不能在人體內合成", "2"),
        Array("自然界中，有智慧元素之稱的是", "鐵", "碘", "鈣", "鋅", "2"),
        Array("食品的保質期是指它的", "生產日期", "最終食用期", "最佳食用期", "出廠日期", "3"),
        Array("下列說法中不正確的是", "長期多食雞蛋會導致膽固醇偏高", "空腹不宜飲茶", "死鱔魚、死甲魚、死螃蟹只要做熟了還是能吃的", "關節炎患者不宜吃海鮮時喝啤酒", "3"),
        Array("綠色食品、有機食品、無公害農產品標準對產品的要求由高到低依次排列為", "綠色食品、有機食品、無公害食品", "有機食品、綠色食品、無公害食品", "綠色食品、無公害食品、有機食品", "無公害食品、有機食品、綠色食品", "2"),
        Array("以下哪種食品可以食用?", "發霉的茶葉", "發芽的土豆", "變綠的豆芽", "變紅的湯圓", "3"),
        Array("豆漿又叫植物奶，被國際營養協會評定為健康食品和世界六大營養飲料之一。但是喝豆漿也有注意事項，以下正確的食用方法是", "喝沒有煮沸的豆漿", "豆漿中衝入雞蛋", "喝豆漿時搭配其他食物", "用保溫瓶長時間儲存豆漿", "3"),
        Array("亞硝酸鹽屬劇毒類化學物質，又叫工業用鹽，如酸菜中就含一定量的亞硝酸鹽，吃酸菜時最好吃一些什麼，可減少亞硝酸鹽的危害。", "綠色食品", "新鮮蔬菜", "富含維生素c的水果", "各種雜糧", "3"),
        Array("郊遊時，看見野生蘑菇，您應該怎麼做？", "採下來帶回家食用", "憑經驗判斷無毒的就可帶回家食用", "咨詢圍人後感覺安全再食用", "野生的蘑菇不安全，不採摘也不食用", "4"),
        Array("出現食物中毒症狀或者誤食化學品時，最先採取的急救措施是", "催吐", "吃止瀉藥物", "進行人工呼吸", "向衛生防疫部門報告", "1"),
        Array("銅器與什麼不宜長久接觸，否則會產生銅綠。用生有銅綠的銅器盛放食品或烹炒菜餚易中毒。", "醬油", "花椒面", "味精", "醋", "4"),
        Array("如將電線插頭脫離插座，以下哪一項是安全的做法？", "用工具猛力撬出", "用力拉引電線，使插頭脫離插座", "小心地用手把插頭從插座拔出來", "用鉗子把插頭拉出來", "3")
        );

var itemtk2 = Array(
        Array("有生命物質(即生物)和無生命物質的根本區別是", "反應性", "反映形式", "感應性", "信號性反應", "3"),
        Array("人以感知、記憶、思維等心理活動過程為基礎的系統整體對自己身心狀態與外界環境變化的覺知和認識是", "思維活動", "語言活動", "認識活動", "意識活動", "4"),
        Array("教育學研究的對象是", "教育現象", "教育方針", "教育政策", "教育理論", "1"),
        Array("標誌著教育學作為一門獨立的學科開始形成的教育論著是", "《學記》", "《普通教育學》", "《大教學論》", "《教育論》", "3"), Array("下列不屬於騎士七技的範圍的是", "騎馬", "投槍", "音樂", "吟詩", "3"),
        Array("蓬生麻中,不扶而直；白沙在涅,與之俱黑反映了對人的發展的影響的是", "教育", "環境", "遺傳", "主觀努力", "2"),
        Array("學校體育的最為基本的組織形式是", "早操、課間操", "體育課", "體育競賽", "學生自覺鍛煉", "2"),
        Array("教學過程是一種特殊的", "心理過程", "信息過程", "邏輯過程", "認識過程", "4"),
        Array("要盡量多地要求一個人,也要盡可能多地尊重一個人所體現的德育原則是", "從學生實際出發的原則", "知行統一的原則", "尊重、信任學生與嚴格要求學生相結合的原則", "集體教育和個別教育相結合的原則", "3"),
        Array("布魯納所倡導的發現學習的教學方法是一種", "以直觀感知為主的教學方法", "以實際訓練為主的教學方法", "以探究活動為主的教學方法", "以情感陶冶為主的教學方法", "3"),
        Array("班主任工作計劃一般包括", "學期計劃和具體活動計劃", "全面計劃和專題計劃", "課內計劃和課外計劃", "教學工作計劃和思想工作計劃", "1"),
        Array("在三結合教育中,占主導地位的是", "家庭教育", "學校教育", "自我教育", "社會教育", "2"),
        Array("學校對學生進行德育的重要而又特殊的途徑是", "課外校外教育", "各科教學", "社會實踐活動", "班主任工作", "4"),
        Array("長期以來的教育實踐證明,學校工作必須做到", "以教學為主", "教學、科研並重", "教學、科研、生產三中心", "所有時間用於搞教學", "1"),
        Array("班級授課制在我國正式實行一般認為是在", "唐朝中期", "明朝中期 ", "清朝末年", "辛亥革命以後", "3"),
        Array("中國歷史上最早提出教學相長的著作是", "《大學》", "《中庸》", "《學記》", "《春秋》", "1"),
        Array("實用主義教育流派的代表人物是", "誇美紐斯", "赫爾巴特", "裴斯泰洛齊", "杜威", "4"),
        Array("教育心理起源論認為教育起源於", "生產勞動", "模仿", "語言", "動物本能", "2"),
        Array("普通中小學經常組織諸如生物、物理、航模等興趣小組,主要是為了", "深化課堂教學", "培養競賽人才", "因材施教,發展青少年個性特長", "充分發掘學有餘力的學生的學習潛力", "3"),
        Array("西漢初期實行的罷黜百家,獨尊儒術的文教政策體現了教育的", "永恆性", "歷史性", "相對獨立性", "繼承性", "2"),
        Array("學生在教育過程中,處於", "主導地位", "主體地位", "被動地位", "輔助地位", "2"),
        Array("教學過程的中心環節是", "感知教材、形成表象", "理解教材、形成概念", "鞏固與保持知識", "運用知識,形成技能技巧", "2"),
        Array(".班集體形成的主要標誌之一是", "成立了班委會", "開展了班級工作", "形成了正確輿論", "確定了班級工作計劃", "3"),
        Array("英國教育家斯賓塞的教育代表作是", "《愛彌兒》", "《人的教育》", "《教育漫話》 ", "《教育論》", "4"),
        Array("孟母三遷的故事說明了哪種因素對人發展的影響?", "遺傳", "環境", "教育", "社會活動", "2"),
        Array("毛澤東同志在1957年首次提出的我國社會主義的教育目的是", "培養有社會主義覺悟有文化的勞動者", "培養德智體全面發展的社會主義新人", "培養又紅又專的社會主義接班人", "培養腦體結合的社會主義建設者", "1"),
        Array("教學工作的中心環節是", "備課", "上課", "課外輔導", "檢查評定成績", "2"),
        Array("被稱為世界上第一部研究教育的專著是", "《教育沒話》 ", "《教育學》", "《學記》", "《雄辯術原理》", "3"),
        Array("()年,頒布了《中華人民共和國義務教育法》", "1985", "1986", "1988", "1993", "2"),
        Array("我國目前主要由下列哪一主體承擔普及九年義務教育的責任?", "地方", "中央", "社會力量", "學生家長", "1"),
        Array("智力可以分解為多種因素,下列哪種因素是智力的核心?", "觀察力", "想像力", "思維力", "判斷力", "3"),
        Array("學為人師,行為世范體現了教師工作的", "複雜性、創造性", "連續性、廣延性", "長期性、間接性  ", "主體性、示範性", "4"),
        Array("學而時習之體現的教學原則是", "理論聯繫實際的原則", "啟發性原則", "循序漸進的原則", "鞏固性原則", "4"),
        Array("三軍可奪帥,匹夫不可奪志說的是", "道德認識", "道德情感", "道德意志", "道德行為", "3"),
        Array("三結合的教育一般是指", "學校、家庭、社會教育三結合", "班主任、科任教師和家長教育三結合", "校長、教師和家長教育三結合", "家庭、環境和學校教育三結合", "1"),
        Array(".孔子說：其身正,不令而行；其身不正,雖令不從.這反映教師勞動的哪種特點?", "主體性", "創造性", "間接性", "示範法", "4"),
        Array("近代教育史上,是下列哪一位教育家首次試圖把教育學建立在心理學和哲學的基礎之上", "誇美紐斯", "赫爾巴特", "杜威", "洛克", "2"),
        Array("贊科夫在《教學與發展》一書中提出五條新的教學原則,不在此列的一條是", "高難度原則", "高速度原則", "理論知識起主導作用的原則", "循序漸進原則", "4"),
        Array("體育的根本任務是", "通過體育對學生進行思想品德教育", "增強學生體質", "向學生傳授體育和衛生的基本知識和基本技能", "向國家輸送優秀運動員", "2"),
        Array("我國實行的第一個現代學制是", "壬寅學制", "癸卯學制", "壬子癸丑學制", "壬戌學制", "2"),
        Array("班級授課制的實施在我國始於", "唐代", "清末", "民國初期", "新中國成立", "2"),
        Array("哪個社會的教育具有教育與生產勞動相脫離的特點", "原始社會", "古代社會", "資本主義", "社會主義", "2"),
        Array("在古代歐洲,曾經出現過一種旨在培養多方面發展的人的和諧教育,它是", "斯巴達教育", "雅典教育", "教會教育", "騎士教育", "2"),
        Array("學生既是教育的對象,又是教育過程中的主體.學生主體作用的最高表現形式為", "自覺性", "獨立性", "創造性", "主動性", "3"),
        Array("德育過程的基本矛盾是", "知與行的矛盾", "外界多種良莠摻雜的教育影響之間的矛盾", "教育者提出的德育要求與受教育者已有的品德基礎之間的矛盾", "學生的上進心與情性之間的矛盾", "3"),
        Array("教育要適應人的發展的個別差異性,做到", "循序漸進", "因材施教", "教學相長", "防微杜漸", "2"),
        Array("狹義的教育制度是指", "國民教育制度", "社會教育制度", "高等教育制度", "學校教育制度", "4"),
        Array("古希臘斯巴達教育比較重視", "軍事體操教育", "政治哲學教育", "天文數學教育 ", "全面發展教育", "1"),
        Array("我國首次把美育列為教育的重要組成部分是在", "1911年", "1912年", "1957年", "1958年", "2"),
        Array("我國頒布實行的壬戌學制是在", "1902年", "1903年", "1912年", "1922年", "4"),
        Array("學校工作必須堅持以", "教學為主", "德育為主", "教師為主", "學生為主", "1"),
        Array("前蘇聯教育家馬卡連柯所倡導的平行教育的德育原則是指", "知行統一原則", "尊重信任與嚴格要求學生相結合原則", "教育影響的一致性與連貫性原則", "集體教育與個別教育相結合的原則", "4"),
        Array("89.課外校外教育與課堂教學的共同之處在於它們都是", "師生共同參加的", "學生自願選擇的", "有目的、有計劃、有組織的", "受教學計劃、教學大綱規範的", "3"),
        Array("得道者多助，失道者寡助。出自", "《禮記》", "《老子》", "《孟子》", "《孫子》", "3"),
        Array("溫故而知新，可以為師矣。出自 ", "《論語》", "《莊子》", "《禮記》", "《孟子》", "1"),
        Array("滿園春色關不住，一枝紅杏出牆來出自葉紹翁的", "《遊園不值》", "《春望》", "《春夜喜雨》", "《夢遊》", "1"),
        Array("《賦得古原草送別》是（）的作品", "李白", "杜甫", "白居易", "陳天橋", "3"),
        Array("先天下之憂而憂，後天下之樂而樂出自（）的文章", "文天祥", "辛棄疾", "范仲淹", "范瑋琪", "3"),
        Array("《七步詩》的作者是", "曹操", "曹丕", "曹植", "曹格", "3"),
        Array("海內存知己，天涯若比鄰是（）的詩句。", "王勃", "李白", "白居易", "杜甫", "2"),
        Array("我住長江頭，君住長江尾是（）的詩句", "李白", "蘇軾", "李之儀", "芙蓉姐姐", "2"),
        Array("昔人已乘黃鶴去，此地空餘黃鶴樓是（）的詩句", "李白", "崔顥", "王維", "馬化騰", "2"),
        Array("《黔之驢》是（）的作品", "韓非子", "王安石", "柳宗元", "崔永元", "3"),
        Array("獨在異鄉為異客，每逢佳節倍思親是（）的詩句", "王維", "王之渙", "王勃", "王心凌", "1"),
        Array("《陋室銘》的作者是", "韓愈", "劉禹錫", "歐陽修", "劉德華", "2"),
        Array("著名邊塞詩《白雪歌送武判官歸京》的作者是", "王翰", "高適", "岑參", "陳奕迅", "3"),
        Array("學然後知不足，教然後知困。出自", "《論語》", "《荀子》", "《禮記》", "《老子》", "3"),
        Array("屈原是偉大的愛國詩人，他是", "春秋時期楚國人", "戰國時期楚國人", "唐朝人", "清朝人", "2"),
        Array("《史記》的作者司馬遷是（）代著名史學家", "宋", "漢", "明", "清", "2"),
        Array("我國最早的詩歌總集是", "《古詩十九首》", "《詩經》", "《離騷》", "《古詩十八首》", "2"),
        Array("大詩人陶淵明是（）時期人", "東漢", "三國", "東晉", "唐朝", "3"),
        Array("《孟子》是（）重要經典人物之一", "儒家", "法家", "道家", "武家", "1"),
        Array("（）是與岑參齊名的唐代著名邊塞詩人。", "王翰", "高適", "李賀", "刀郎", "2"),
        Array("曉鏡但愁雲鬢改，夜吟應覺月光寒出自（）的《無題》。", "李賀", "李清照", "李商隱", "李宇春", "3"),
        Array("人有悲歡離合，月有陰晴圓缺，此事古難全。出自蘇軾的", "《江城子》", "《江城子》", "《念奴嬌》", "《莊子》", "2"),
        Array("先帝創業未半，而中道崩殂。這句話出自（）的《前出師表》", "諸葛亮", "曹操", "杜甫", "濟公", "1"),
        Array("三十功名塵與土，八千里路雲和月。是（）的詞句", "岳飛", "辛棄疾", "陸游", "小瀋陽", "1"),
        Array("《蘭亭集序》是（）的著名作品", "王勃", "蘇軾", "王羲之", "周傑倫", "3"),
        Array("古詩《遊子吟》的作者是", "賈島", "孟郊", "孟浩然", "鳳凰傳奇", "2"),
        Array("兩情若是久長時，又豈在朝朝暮暮是（）詞作中的名句", "秦觀", "李清照", "柳永", "張傑", "1"),
        Array("李煜是南唐最後一位君主，也是唐五代成就最高的", "詩人", "詞人", "散文家", "藝人", "2"),
        Array("南宋豪放派代表詞人是", "辛棄疾", "蘇軾", "陸游", "屠洪綱", "3"),
        Array("《少年中國說》的作者是", "康有為", "梁啟超", "譚嗣同", "後弦", "2"),
        Array("一片冰心在玉壺，出自（）的詩", "王昌齡", "李白", "高適", "阿杜", "1"),
        Array("《竇娥冤》的作者是", "白居易", "關漢卿", "湯顯祖", "李白", "2"),
        Array("我勸天公重抖擻，不拘一格降人才，的作者龔自珍是（）人", "宋朝", "清朝", "明朝", "唐朝", "2"),
        Array("《文心雕龍》的作者是", "劉向", "劉勰", "曹丕", "陳小春", "2"),
        Array("《春江花月夜》是（）的著名作品", "張繼", "張九齡", "張若虛公", "張柏芝", "3"),
        Array("國際社會公認的第一禮俗是", "女士優先", "尊重原則", "寬容的原則", "男士優先", "1"),
        Array("正確握手的時長一般為", "3-4秒", "5-6秒", "10秒", "24小時", "1"),
        Array("女士攜帶的手提包,在正式宴會就餐期間應", "放在背部與椅背之間", "掛在自己椅子的靠背上", "掛在衣架上", "提在手上", "1"),
        Array("宴會上,為表示尊重,主賓的座位應", "在主人的右側", "在主人的左側", "隨其所好", "都可以", "1"),
        Array("使用餐巾時,不可以用餐巾來", "擦嘴角的油漬", "擦手上的油漬", "擦臉上的油漬", "擦拭餐具", "4"),
        Array("不分年齡輩份的差異而結成的好朋友稱", "世交", "莫逆交", "忘年交", "年忘交", "3"),
        Array("在涉外交往中,對外國部長以上的高級官員可稱為", "陛下", "殿下", "閣下", "尊下", "3"),
        Array("初次見面時,客套話稱", "久仰", "久違", "久別", "久愛", "1"),
        Array("下列幾種花中,()花最適合贈送給母親", "玫瑰", "月季", "康乃馨", "喇叭花", "4"),
        Array("別人給你服務,做事和幫忙,無論給你的幫助多麼微不足道,都要說", "謝謝", "請", "對不起", "滾", "1"),
        Array("結婚時所行的三拜禮的三拜是", "一拜天地 二拜高堂 三拜親友", "一拜天地  二拜高堂  三新人交拜", "一拜高堂 二拜天地 三夫妻對拜", "一拜天地 二拜親友 三夫妻對拜", "2"),
        Array("三星高照作為我國古代的祝福用語,其中三星是指", "福星,祿星,壽星", "冥王星,海王星,北斗星", "啟明星,智多星,北斗星", "星爺,星哥,周星星", "1"),
        Array("我國古代的拜年一詞特指行為", "向長輩叩歲", "平輩相互道賀", "親戚互相走動", "饋贈禮品", "1"),
        Array("我國古代的賀年一詞特指行為", "向長輩叩歲", "平輩相互道賀", "親戚互相走動", "饋贈禮品", "2"),
        Array("被認為是我國古代中華民族共有的崇拜物是", "麒麟", "龍", "虎", "彪", "2"),
        Array("醉翁之意不在酒中的醉翁是指", "陶淵明", "歐陽修", "李白", "張學友", "2"),
        Array("（）是我國最早的一部詩歌總集，共收錄周代詩歌305篇", "唐詩", "宋詞", "樂府詩", "詩經", "4"),
        Array("（）是戰國時代的偉大詩人屈原創造的一種詩體", "唐詩", "宋詞", "楚詞", "詩經", "3"),
        Array("（）是指由朝廷樂府系統或相當於樂府職能的音樂管理機關搜集、保存而流傳下來的漢代詩歌", "唐詩", "宋詞", "兩漢樂府詩", "詩經", "3"),
        Array("（）描寫的是從東漢末年到西晉初年之間近一百年的歷史風雲", "《三國演義》", "《水滸傳》", "《西遊記》", "《紅樓夢》", "1"),
        Array("筆墨紙硯是文房四寶。四寶又以（）為首。", "筆", "墨", "紙", "硯", "4"),
        Array("中秋節的習俗很多，形式也各不相同，但都寄托著人們對生活無限的熱愛和對美好生活的嚮往。最早記載中秋節吃月餅的習俗是在（）", "西漢", "唐代", "宋代", "元代", "2"),
        Array("每逢佳節倍思親，這裡的佳節指的是", "春節", "七夕節", "重陽節", "中秋節", "3"),
        Array("農曆的十月初一是（），源於秦時孟蓋女為被抓去修萬里長城的丈夫送寒衣的民間傳說", "寒食節", "寒衣節", "上工節", "縫衣", "2")
        );
