var a = 0;
var text;
var selects; //記錄玩家的選項
var buynum = 0;
var itemlist = Array(
//Array(2432069, 20),//公測刪
//Array(2432741, 20),//公測刪
//Array(1672016, 20),//公測刪
//Array(2431938, 20),//公測刪
//Array(1402180, 20),//公測刪
Array(1022148, 390),//  這個是眼飾的 
//Array(1012319, 410), // 這個是臉飾的
//Array(1112918, 30),
//Array(2431938, 288),
Array(2070019, 20),
//Array(1132246, 228),
//Array(1122267, 228),
//Array(1032223, 300),
//Array(1113075, 300),
//Array(1122122, 420),//冒險覺醒之心
//Array(1122123, 420),//冒險覺醒之心
//Array(1122124, 420),// -冒險覺醒之心
//Array(1122125, 420),//  - 冒險覺醒之心
//Array(1122126, 420),//  -冒險覺醒之心
Array(1102471, 160), // 赫裡希安精銳劍士披風 // (無描述)
Array(1102472, 160), // 赫裡希安精銳法師披風 // (無描述)
Array(1102473, 160), // 赫裡希安精銳弓箭手披風 // (無描述)
Array(1102474, 160), // 赫裡希安精銳盜賊披風 // (無描述)
Array(1102475, 160), // 赫裡希安精銳海盜披風 // (無描述)
Array(1072732, 160), // 赫裡希安精銳劍士靴 // (無描述)
Array(1072733, 160), // 赫裡希安精銳法師靴 // (無描述)
Array(1072734, 160), // 赫裡希安精銳弓箭手靴 // (無描述)
Array(1072735, 160), // 赫裡希安精銳盜賊靴 // (無描述)
Array(1072736, 160), // 赫裡希安精銳海盜靴 // (無描述)
Array(1132164, 160), // 赫裡希安精銳劍士腰帶 // (無描述)
Array(1132165, 160), // 赫裡希安精銳法師腰帶 // (無描述)
Array(1132166, 160), // 赫裡希安精銳弓箭手腰帶 // (無描述)
Array(1132167, 160), // 赫裡希安精銳盜賊腰帶 // (無描述)
Array(1132168, 160), // 赫裡希安精銳海盜腰帶 // (無描述)
/*
Array(1102476, 220), // 諾巴西亞戴斯披風 // (無描述)
Array(1102477, 220), // 諾巴赫爾梅斯披風 // (無描述)
Array(1102478, 220), // 諾巴凱倫披風 // (無描述)
Array(1102479, 220), // 諾巴利卡昂披風 // (無描述)
Array(1102480, 220), // 諾巴阿爾泰披風 // (無描述)
Array(1072737, 220), // 諾巴西亞戴斯靴 // (無描述)
Array(1072738, 220), // 諾巴赫爾梅斯靴 // (無描述)
Array(1072739, 220), // 諾巴凱倫靴 // (無描述)
Array(1072740, 220), // 諾巴利卡昂靴 // (無描述)
Array(1072741, 220), // 諾巴阿爾泰靴 // (無描述)
Array(1132169, 250), // 諾巴西亞戴斯腰帶 // (無描述)
Array(1132170, 250), // 諾巴赫爾梅斯腰帶 // (無描述)
Array(1132171, 250), // 諾巴凱倫腰帶 // (無描述)
Array(1132172, 250), // 諾巴利卡昂腰帶 // (無描述)
Array(1132173, 250), // 諾巴阿爾泰腰帶 // (無描述)
/*
Array(1102481, 298), // 暴君西亞戴斯披風 // (無描述)
Array(1102482, 298), // 暴君赫爾梅斯披風 // (無描述)
Array(1102483, 298), // 暴君凱倫披風 // (無描述)
Array(1102484, 298), // 暴君利卡昂披風 // (無描述)
Array(1102485, 298), // 暴君阿爾泰披風 // (無描述)
Array(1072743, 298), // 暴君西亞戴斯靴 // (無描述)
Array(1072744, 298), // 暴君赫爾梅斯靴 // (無描述)
Array(1072745, 298), // 暴君凱倫靴 // (無描述)
Array(1072746, 298), // 暴君利卡昂靴 // (無描述)
Array(1072747, 298), // 暴君阿爾泰靴 // (無描述)
Array(1132174, 298), // 暴君西亞戴斯腰帶 // (無描述)
Array(1132175, 298), // 暴君赫爾梅斯腰帶 // (無描述)
Array(1132176, 298), // 暴君凱倫腰帶 // (無描述)
Array(1132177, 298),// 暴君利卡昂腰帶 // (無描述)
Array(1132178, 298),// 暴君阿爾泰腰帶 // (無描述)*/
Array(1142210, 60),//  - 
Array(1142178, 60)//  -
//Array(3994417,260)// - 紅色蠟筆 - 紅色蠟筆。
//Array(3994418,260),// - 橙色蠟筆 - 橙色蠟筆。
//Array(3994419,260)// - 黃色蠟筆 - 黃色蠟筆。
/*
Array(3994420,260),// - 綠色蠟筆 - 綠色蠟筆。
Array(3994421,260),// - 青色蠟筆 - 青色蠟筆。
Array(3994422,260)// - 藍色蠟筆 - 藍色蠟筆。Array(3994423,260)// - 紫色蠟筆 - 紫色蠟筆。 */
);

function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.sendOk("好吧，等你考慮清楚了再來找我。");
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
            text = "#h0#,您可以在這裡兌換#e#b上乘裝備#n#k,請選擇你想要購買的物品\r\n#b";
            for (var i=0; i<itemlist.length; i++) {
                var validtime = "";
                if (itemlist[i][2]!=null) {
                    validtime="/ #e"+itemlist[i][2]+"天權#n";
                }
                text += "#L" + i + "##i" + itemlist[i] + ":##t" + itemlist[i] + "# "+validtime+" - #r"+itemlist[i][1]+"#b中介幣  \r\n";
                if (i != 0 && (i+1) % 5 == 0) {
                    text += "\r\n";
                }
            }
            cm.sendSimple(text);
            /*
        } else if (a == 1) {
            selects = selection;
            cm.sendGetNumber("請輸入你請你輸入想要購買的數量\r\n\r\n#r1個需要" + itemlist[selects][1] + "個#b中介幣#k", 0, 0, 999999);*/
        } else if (a == 1) {
            selects = selection;
            buynum = 1;
            cm.sendYesNo("你想購買" + buynum + "個#r#i" + itemlist[selects][0] + "##k？\r\n你將使用掉" + (buynum * itemlist[selects][1]) + "中介幣。");
        } else if (a == 2) {
            if (cm.haveItem(4000463,buynum * itemlist[selects][1])) {
                cm.gainItem(4000463, -buynum * itemlist[selects][1]);
                if (itemlist[selects][2]!=null) {
                    cm.gainItem(itemlist[selects][0], buynum, itemlist[selects][2]);    
                } else {
                    cm.gainItem(itemlist[selects][0], buynum);
                }
                cm.sendOk("購買成功了！");
                cm.dispose();
            } else {
                cm.sendOk("對不起，你沒有足夠的中介幣。");
                cm.dispose();
            }
        }
    }//mode
}//f
