/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package client;

/**
 * @author PlayDK
 */
public enum MapleExpStat {

    // [Int] 活動獎勵經驗值(+%d)
    活動獎勵經驗值(0x1, 0),
    // [Byte] 怪物額外經驗值(+%d%)
    怪物額外經驗值(0x2, 0), //每次打3個怪物時給你特別經驗值X%
    // [Byte] 活動組隊經驗值(+%d)
    活動組隊經驗值(0x4, 0), //活動組隊經驗獎勵倍數(i x 100)最大3倍
    未知(0x8, 0),
    組隊額外經驗值(0x10, 0),
    結婚紅利經驗值(0x20, 0), //結婚經驗要在組隊經驗前面
    道具裝備紅利經驗值(0x40, 0),
    高級服務贈送經驗值(0x80, 0),
    彩虹週獎勵經驗值(0x100, 0),
    爆發獎勵經驗值(0x200, 0),
    秘藥額外經驗值(0x400, 0),
    // (null)額外經驗值(+%d) - null處客戶端會判斷是否有精靈遊俠的LINK「精靈的祝福」跟神之子角色卡「神使 神之子」
    額外經驗值(0x800, 0),
    加持獎勵經驗值(0x1000, 0),
    休息獎勵經驗值(0x2000, 0),
    道具獎勵經驗值(0x4000, 0),
    // %s經驗值(+%d)
    道具名經驗值(0x8000, 0),
    // 依道具%增加經驗值(+%d)
    依道具趴增加經驗值(0x10000, 0),
    超值包獎勵經驗值(0x20000, 0),
    // 依道具的組隊任務%增加經驗值(+%d)
    依道具的組隊任務趴增加經驗值(0x40000, 0),
    累積狩獵數紅利經驗值(0x80000, 0),
    家族經驗值獎勵(0x100000, 0),
    冷凍勇士經驗值獎勵(0x200000, 0),
    // d-[Int]x-[Int] 燃燒場地獎勵經驗 x%(+%d)
    燃燒場地獎勵經驗(0x400000, 0),
    HP風險經驗值(0x800000, 0),
    場地紅利經驗(0x1000000, 0),
    //累積狩獵數紅利經驗值
    累計打獵數量獎勵經驗(0x2000000, 0),
    活動獎勵經驗值2(0x4000000, 0),
    網咖摯友獎勵經驗值(0x8000000, 0),
    場地紅利經驗2(0x10000000, 0),
    超級小豬幸運_攻擊額外經驗值(0x20000000, 0),
    伺服器計量條活動獎勵經驗值(0x40000000, 0),
    未知2(0x80000000, 0),
    // 公會的訣竅獎勵經驗值(+%d) 和 組隊經驗值增加x%(+%d)
    組隊經驗值增加x趴(0x1, 1),
    蛋糕vs派餅_EXP紅利(0x2, 1),
    Pvp_Bonus_EXP(0x4, 1),
    寵物訓練紅利經驗值(0x8, 1),
    組合道具獎勵經驗值(0x10, 1),
    組合道具獎勵組隊經驗值(0x20, 1),
    伺服器加持經驗值(0x40, 1),
    累積狩獵數紅利經驗值2(0x80, 1),
    艾爾達斯還原追加經驗值(0x100, 1),
    ;

    private final int value;
    private final int position;

    MapleExpStat(int value, int position) {
        this.value = value;
        this.position = position;
    }

    public int getValue() {
        return value;
    }

    public int getPosition() {
        return position;
    }
}
