status = -1;
var itemList = Array(
// ------ 椅子 ------
Array(3010044, 700, 1, 1), //同一紅傘下
Array(3012002, 700, 1, 1), //浴桶
Array(3012003, 700, 1, 1), //愛心椅子
Array(3010038, 700, 1, 1), //愛心椅子
Array(3010043, 700, 1, 1), //魔女的飛掃把
Array(3010046, 700, 1, 1), //紅龍椅
Array(3010047, 700, 1, 1), //藍龍椅
Array(3010048, 700, 1, 1), //聖誕樹椅子
Array(3010050, 700, 1, 1), //公主凳
// ------ 卷軸 ------
Array(2043002, 600, 1, 1), //單手劍攻擊卷軸10%
Array(2043008, 600, 1, 1), //單手劍魔力卷軸10%
Array(2044002, 600, 1, 1), //雙手劍攻擊卷軸10%
Array(2043202, 600, 1, 1), //單手棍攻擊卷軸10%
Array(2044202, 600, 1, 1), //雙手棍攻擊卷軸10%
Array(2043102, 600, 1, 1), //單手斧攻擊卷軸10%
Array(2044102, 600, 1, 1), //雙手斧攻擊卷軸10%
Array(2044302, 600, 1, 1), //槍攻擊卷軸10%
Array(2044402, 600, 1, 1), //矛攻擊卷軸10%
Array(2043702, 600, 1, 1), //短杖魔力卷軸10%
Array(2043802, 600, 1, 1), //長杖魔力卷軸10%
Array(2044502, 600, 1, 1), //弓攻擊卷軸10%
Array(2044602, 600, 1, 1), //弩攻擊卷軸10%
Array(2044702, 600, 1, 1), //拳套攻擊卷軸10%
Array(2043302, 600, 1, 1), //短劍攻擊卷軸10%
Array(2043402, 600, 1, 1), //刀攻擊力卷軸 10%
Array(2044902, 600, 1, 1), //火槍攻擊卷軸10%
Array(2044802, 600, 1, 1), //拳甲攻擊卷軸10%
Array(2040915, 600, 1, 1), //盾牌攻擊卷軸10%
Array(2040920, 600, 1, 1), //盾牌魔力卷軸10%
Array(2049116, 600, 1, 1), //強化混沌卷軸
Array(2340000, 500, 1, 1), //祝福卷軸
Array(2049004, 500, 1, 1), //白醫卷軸—仙
Array(2049300, 500, 1, 1), //高級裝備強化卷軸
Array(2049400, 500, 1, 1), //高級潛能附加卷軸
Array(2049304, 500, 1, 1), //3星裝備強化卷軸
Array(2049309, 500, 1, 1), //2星裝備強化卷軸
Array(2290285, 700, 1, 1), //神秘能手冊
// ------ 裝備 ------
Array(1112586, 500, 1, 1), //黑天使的祝福
Array(1202004, 500, 1, 1), //詛咒殭屍-圖騰
Array(1202024, 400, 1, 1), //金·喬圖騰
Array(1202025, 500, 1, 1), //銀·喬圖騰
Array(1202028, 400, 1, 1), //金·海麗蜜圖騰
Array(1202029, 500, 1, 1), //銀·海麗蜜圖騰
Array(1202032, 400, 1, 1), //金·小龍圖騰
Array(1202033, 500, 1, 1), //銀·小龍圖騰
Array(1202036, 400, 1, 1), //金·李卡司圖騰
Array(1202037, 500, 1, 1), //銀·李卡司圖騰
Array(1132085, 400, 1, 1), //旭日腰帶
Array(1132013, 700, 1, 1), //不滅的法老腰帶
Array(1032102, 500, 1, 1), //完整的萊克斯綠色耳環
Array(1032103, 500, 1, 1), //完整的萊克斯紅色耳環
Array(1032104, 500, 1, 1), //完整的萊克斯藍色耳環
Array(1132091, 500, 1, 1), //十字旅團基本腰帶
Array(1102041, 700, 1, 1), //浪人披風(粉)
Array(1102042, 700, 1, 1), //浪人披風(紫)
Array(1012319, 700, 1, 1), //8週年點點紅
Array(1152054, 700, 1, 1), //完成的護肩
Array(1032026, 700, 1, 1), //黃水晶耳環
// ------ 特殊 ------
Array(5062000, 500, 1, 1), //神奇方塊
Array(4031997, 700, 1, 1), //蘑菇楓幣
Array(5064000, 500, 1, 1), //防爆卷軸
Array(5064100, 400, 1, 1), //保護卷軸
Array(2022800, 700, 1, 1), //心跳停止糖
Array(4031996, 400, 1, 1), //蘑菇銅牌
Array(4310015, 700, 1, 1), //鬥神證物
Array(4021012, 700, 1, 1), //強烈靈魂的淨水
Array(4021011, 700, 1, 1), //純潔靈魂的火花
Array(5220040, 500, 1, 1), //楓之谷轉蛋券
Array(5570000, 500, 1, 1), //金錘子
Array(5150040, 500, 1, 1), //皇家理發券
Array(5062002, 500, 1, 1), //高級神奇方塊
// ------ 玩具 ------
Array(1302087, 700, 1, 1), //火炬
Array(1422011, 700, 1, 1), //酒瓶
Array(1402029, 700, 1, 1), //鬼刺狼牙棒
Array(1302063, 700, 1, 1), //燃燒的火焰刀
// ------ 任務物品 ------
Array(4032177, 500, 1, 1), //褪色的冒險之心項墜
Array(4001226, 500, 1, 1), //褪色的勇氣之心
Array(4001227, 500, 1, 1), //褪色的智慧之心
Array(4001228, 500, 1, 1), //褪色的精準之心
Array(4001229, 500, 1, 1), //褪色的敏捷之心
Array(4001230, 500, 1, 1), //褪色的自由之心
Array(4001563, 300, 1, 1), //特殊項鏈
Array(4033001, 300, 1, 1), //冒險之心的項墜
Array(4001558, 100, 1, 1), //勇氣之心
Array(4001559, 100, 1, 1), //智慧之心
Array(4001560, 100, 1, 1), //精準之心
Array(4001561, 100, 1, 1), //敏捷之心
Array(4001562, 100, 1, 1) //自由之心
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用嗎？…我的肚子裡有各類#b奇特座椅或卷軸、裝備、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 700);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "明日禮物箱子(銀)", notice);
            if (item != -1) {
            im.gainItem(2430639, -1);
                im.sendOk("你獲得了 #b#t" + item + "##k " + quantity + "個。");
            } else {
                im.sendOk("請你確認在背包的裝備，消耗，其他窗口中是否有一格以上的空間。");
            }
            im.safeDispose();
        } else {
            im.sendOk("今天的運氣可真差，什麼都沒有拿到。\r\n(獲得了安慰獎：運動會幣 x3。)");
            im.gainItem(4310030, 3);
            im.safeDispose();
        }
    }
}