/*  This is mada by Kent    
 *  This source is made by Funms Team
 *  功能：里諾赫的黃金袋子
 *  每日尋寶任務  需要添加獎勵
 *  @Author Kent 
 */

var status = 0;
var psrw = Array(
Array(1004492,150,1,3),//楓之谷尋寶帽子
Array(1102828,150,1,3),//楓之谷尋寶披風
Array(1082647,150,1,3),//楓之谷尋寶手套
Array(1052929,150,1,3),//楓之谷尋寶套裝
Array(1098008,150,1,3),//楓之谷尋寶靈魂盾牌
Array(1099014,150,1,3),//楓之谷尋寶精氣之盾
Array(1073057,150,1,3),//楓之谷尋寶鞋子
Array(1212117,150,1,3),//楓之谷尋寶閃亮克魯
Array(1222111,150,1,3),//楓之谷尋寶靈魂射手
Array(1232111,150,1,3),//楓之谷尋寶惡魔劍
Array(1242118,150,1,3),//楓之谷尋寶鎖鏈劍
Array(1302336,150,1,3),//楓之谷尋寶劍
Array(1312201,150,1,3),//楓之谷尋寶斧
Array(1322253,150,1,3),//楓之谷尋寶錘
Array(1332277,150,1,3),//楓之谷尋寶切割者
Array(1342103,150,1,3),//楓之谷尋寶刀
Array(1352011,150,1,3),//楓之谷尋寶魔法箭矢
Array(1352111,150,1,3),//楓之谷尋寶卡片
Array(1352208,150,1,3),//楓之谷尋寶吊墜
Array(1352218,150,1,3),//楓之谷尋寶念珠
Array(1352228,150,1,3),//楓之谷尋寶鎖鏈
Array(1352238,150,1,3),//赤銅之書 &lt;楓之谷尋寶&gt;
Array(1352248,150,1,3),//青銀之書 &lt;楓之谷尋寶&gt;
Array(1352258,150,1,3),//白金之書 &lt;楓之谷尋寶&gt;
Array(1352268,150,1,3),//楓之谷尋寶羽毛
Array(1352278,150,1,3),//楓之谷尋寶千發全中
Array(1352288,150,1,3),//楓之谷尋寶暗影
Array(1352298,150,1,3),//楓之谷尋寶破邪符
Array(1352408,150,1,3),//楓之谷尋寶寶珠
Array(1352508,150,1,3),//楓之谷尋寶精髓
Array(1352608,150,1,3),//楓之谷尋寶靈魂戒指
Array(1352709,150,1,3),//楓之谷尋寶麥林彈
Array(1352908,150,1,3),//楓之谷尋寶手腕護甲
Array(1352918,150,1,3),//楓之谷尋寶雕眼
Array(1352937,150,1,3),//楓之谷尋寶天龍錘
Array(1352947,150,1,3),//楓之谷尋寶的遺產
Array(1352959,150,1,3),//楓之谷尋寶極限球
Array(1352969,150,1,3),//楓之谷尋寶狂野之喙
Array(1352977,150,1,3),//楓之谷尋寶聖地之光
Array(1352980,150,1,3),//楓之谷尋寶中心發火火藥桶
Array(1353008,150,1,3),//楓之谷尋寶控制器
Array(1353107,150,1,3),//楓之谷尋寶狐狸珠
Array(1362137,150,1,3),//楓之谷尋寶手杖
Array(1372225,150,1,3),//楓之谷尋寶杖
Array(1382263,150,1,3),//楓之谷尋寶長杖
Array(1402253,150,1,3),//楓之谷尋寶雙手劍
Array(1412180,150,1,3),//楓之谷尋寶雙手戰斧
Array(1422187,150,1,3),//楓之谷尋寶錘
Array(1432216,150,1,3),//楓之谷尋寶槍
Array(1442270,150,1,3),//楓之谷尋寶矛
Array(1452255,150,1,3),//楓之谷尋寶長弓
Array(1462241,150,1,3),//楓之谷尋寶弩
Array(1472263,150,1,3),//楓之谷尋寶拳
Array(1482218,150,1,3),//楓之谷尋寶衝拳
Array(1492233,150,1,3),//楓之谷尋寶手銃
Array(1522140,150,1,3),//楓之谷尋寶雙翼弩
Array(1532146,150,1,3),//楓之谷尋寶火炮
Array(1353206,150,1,3),//楓之谷尋寶象棋子
Array(1353406,150,1,3),//楓之谷尋寶破甲彈
Array(1252097,150,1,3),//楓之谷尋寶魔法棒
Array(1542116,150,1,3),//楓之谷尋寶太刀
Array(1552118,150,1,3),//楓之谷尋寶扇
Array(1582028,150,1,3),//楓之谷尋寶拳炮
Array(1352818,150,1,3),//楓之谷尋寶私語
Array(1352830,150,1,3),//楓之谷尋寶刀
Array(1262037,150,1,3),//楓之谷尋寶ESP限製器
Array(1122306,150,1,3),//楓之谷尋寶玉珮
Array(1132287,150,1,3),//楓之谷尋寶腰帶
Array(1142833,150,1,3),//楓之谷尋寶
Array(1152187,150,1,3),//楓之谷尋寶肩章


        Array(2049130, 500, 1), //正義混沌卷40%
        Array(2049137, 500, 1), //驚人正義混沌卷40%
        Array(2340000, 380, 1), //祝福卷軸
        Array(2340000, 340, 2), //祝福卷軸
        Array(2340000, 300, 3), //祝福卷軸
        Array(2340000, 280, 5), //祝福卷軸
        Array(5064000, 210, 1), //裝備保護卷軸
        Array(5064000, 190, 2), //裝備保護卷軸
        Array(5064000, 170, 3), //裝備保護卷軸
        Array(5064000, 150, 5), //裝備保護卷軸
        Array(5062500, 550, 1), // 附加方塊
        Array(5062500, 500, 2), // 附加方塊
        Array(5062500, 450, 3), // 附加方塊
        Array(5062500, 400, 5), // 附加方塊
        Array(4001714, 500, 1), // 定居金100萬楓幣
        Array(4001784, 500, 1), // 裝備金額50萬楓幣
        Array(4001785, 500, 1), // 裝備金額500萬楓幣
        Array(2048700, 250, 1), // - 涅槃火焰110級
        Array(2048701, 220, 1), // - 涅槃火焰120級
        Array(2048702, 200, 1), // - 涅槃火焰130級
        Array(2048703, 160, 1), // - 涅槃火焰140級
        Array(3015002, 800, 1), //七彩摩天輪
        Array(1003422, 100, 1), //石榴石渡鴉面具
        Array(2430030, 500, 1), //黃金羅盤
        Array(3010832, 90, 1), //太陽椅子
        Array(1662027, 100, 1), //女僕機器人
        Array(2430354, 800, 1),//巨無霸兔子
        Array(2430352, 250, 1),//力量兔 交換券
        Array(2430348, 250, 1),//越野機車交換券
        Array(2430346, 250, 1),//粉紅迪歐 交換券
        Array(2430343, 250, 1),//鱷魚王 交換券
        Array(2430321, 250, 1),//無辜水牛 交換券
        Array(5062400, 150, 1),//神秘鐵砧
        Array(1662032, 100, 1), //魅魔洛伊德
        Array(5077000, 350, 7), //三行喇叭
        Array(5390003, 330, 7), //福運到心情喇叭
        Array(5390004, 320, 7), //福來了~！喇叭
        Array(5390007, 310, 7), //達陣喇叭
        Array(5390008, 300, 7), //我是冠軍喇叭
        Array(5390010, 350, 7), //幽靈喇叭
        Array(5390018, 200, 7), //夕陽奔馬喇叭
        Array(5390019, 200, 7), //楓葉新聞喇叭
        Array(5390020, 200, 7), //搖滾喇叭
        Array(5390022, 200, 7) //追趕小羊的狼情景喇叭
        );
var psrw2 = Array(

        );

var rand = Math.floor(Math.random() * psrw.length);
var randList = Math.floor(Math.random() * 3);
function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 0) {
        im.dispose();
        return;
    } else {
        status++;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 570);
        var finalitem = Array();//psrw
        for (var i = 0; i < psrw.length; i++) {
            if (chance <= psrw[i][1] && chance + 300 >= psrw[i][1]) {
                finalitem.push(psrw[i]);
            }
        }
        var itemId = 2430030;
        var quantity = 1;
        var mapid = im.getMapId();
        if (finalitem.length != 0) {
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            itemId = finalitem[finalchance][0];
            quantity = finalitem[finalchance][2];
        }
        if (im.getSpace(1) < 1 || im.getSpace(2) < 1 || im.getSpace(3) < 1 || im.getSpace(4) < 1 || im.getSpace(5) < 1) {
            im.sendOk("找到了寶藏！但是你要保證你背包的每一欄都有空位，請先整理一下吧。");
            im.dispose();
            return;
        }

        //var ii = im.getItemInfo();
        im.gainItem(itemId, quantity); //隨機這個道具
        im.used(1);
        im.worldSpouseMessage(0x18, "『每日尋寶』" + "[" +im.getChar().getName()+ "] 打開里諾赫的黃金袋子獲得了" + quantity + "個<" + im.getItemName(itemId) + ">, 大家快去尋寶吧！");
        im.dispose();
    }
}
