status = -1;
var itemList = Array(
// ------ 卷軸 ------
        Array(2049100, 500, 1, 2), //混沌卷軸60%
        Array(2340000, 600, 1, 2), //祝福卷軸
        Array(2049752, 100, 1, 2), //S級潛能卷軸 30%
        Array(2049750, 50, 1, 3),
        Array(2049704, 500, 1, 2), //A級潛能附加卷軸 40%
        Array(2048311, 500, 1, 2), //附加潛能附加卷軸 50%
        Array(2049304, 500, 1, 2), //3星裝備強化卷軸 80%
        Array(2049135, 300, 1, 2),
        Array(2049137, 150, 1, 3),
// ------ 裝備 ------
        Array(1112915, 500, 1, 2), //藍調戒指
        Array(2432069, 2, 1, 3), //暴君防具交換
//
        Array(2046913, 150, 1, 3), // 宿命正義單手武器攻擊力卷軸 100% // 為單手武器增加攻擊力屬性。
        Array(2046914, 150, 1, 3), // 宿命正義單手武器魔力卷軸 100% // 為單手武器增加魔法攻擊力屬性。
        Array(2046173, 150, 1, 3), // 宿命正義雙手武器攻擊力卷軸 100% // 為雙手武器增加攻擊力屬性。
        Array(2046577, 150, 1, 3), // 宿命正義防具力量卷軸 100% // 為防具增加力量屬性。
        Array(2046578, 150, 1, 3), // 宿命正義防具智力卷軸 100% // 為防具增加智力屬性。
        Array(2046579, 150, 1, 3), // 宿命正義防具敏捷卷軸 100% // 為防具增加敏捷屬性。
        Array(2046580, 150, 1, 3), // 宿命正義防具運氣卷軸 100% // 為防具增加運氣屬性。
        Array(2046763, 150, 1, 3), // 宿命正義飾品力量卷軸 100% // 為飾品增加力量屬性。
        Array(2046764, 150, 1, 3), // 宿命正義飾品智力卷軸 100% // 為飾品增加智力屬性。
        Array(2046765, 150, 1, 3), // 宿命正義飾品敏捷卷軸 100% // 為飾品增加敏捷屬性。
        Array(2046766, 150, 1, 3), // 宿命正義飾品運氣卷軸 100% // 為飾品增加運氣屬性。
        Array(1012283, 50, 1, 3), // 烈日臉飾 // (無描述)
//帥氣勳章

        Array(1142500, 100, 1, 3), // 神秘凡雷恩的惡夢 // (無描述)
        Array(1142501, 100, 1, 3), // 神秘阿卡伊農的惡夢 // (無描述)
        Array(1142502, 100, 1, 3), // 神秘希拉的惡夢 // (無描述)
        Array(1142503, 100, 1, 3), // 神秘殘暴炎魔的惡夢 // (無描述)
        Array(1142504, 100, 1, 3), // 神秘闇黑龍王的惡夢 // (無描述)
        Array(1142505, 100, 1, 3), // 神秘之門研究者 // (無描述)

// 圖騰
        Array(1202023, 600, 1, 3), // 真·喬圖騰 // 聚集了喬的強烈靈魂的強力圖騰。
        Array(1202024, 600, 1, 3), // 金·喬圖騰 // 根據喬的樣子所做的黃金圖騰。
        Array(1202025, 600, 1, 3), // 銀·喬圖騰 // 根據喬的樣子所做的銀圖騰。
        Array(1202026, 600, 1, 3), // 木·喬圖騰 // 根據喬的樣子所做的木圖騰。
        Array(1202027, 600, 1, 3), // 真·海麗蜜圖騰 // 聚集了海麗蜜的強烈靈魂的強力圖騰。
        Array(1202028, 300, 1, 3), // 金·海麗蜜圖騰 // 根據海麗蜜的樣子所做的黃金圖騰。
        Array(1202029, 300, 1, 3), // 銀·海麗蜜圖騰 // 根據海麗蜜的樣子所做的銀圖騰。
        Array(1202030, 300, 1, 3), // 木·海麗蜜圖騰 // 根據海麗蜜的樣子所做的木圖騰。
        Array(1202031, 300, 1, 3), // 真·小龍圖騰 // 聚集了小龍的強烈靈魂的強力圖騰。
        Array(1202032, 300, 1, 3), // 金·小龍圖騰 // 根據小龍的樣子所做的黃金圖騰。
        Array(1202033, 300, 1, 3), // 銀·小龍圖騰 // 根據小龍的樣子所做的銀圖騰。
        Array(1202034, 300, 1, 3), // 木·小龍圖騰 // 根據小龍的樣子所做的木圖騰。
        Array(1202035, 300, 1, 3), // 真·李卡司圖騰 // 聚集了李卡司的強烈靈魂的強力圖騰。
        Array(1202036, 300, 1, 3), // 金·李卡司圖騰 // 根據李卡司的樣子所做的黃金圖騰。
        Array(1202037, 300, 1, 3), // 銀·李卡司圖騰 // 根據李卡司的樣子所做的銀圖騰。
        Array(1202038, 300, 1, 3), // 木·李卡司圖騰 // 根據李卡司的樣子所做的木圖騰。
        Array(1202039, 300, 1, 3), // 黑·酷咪圖騰 // 根據穿著黑色運動服的酷咪導師的樣子所做的圖騰。
        Array(1202040, 300, 1, 3), // 粉·酷咪圖騰 // 根據穿著粉紅色運動服的酷咪導師的樣子所做的圖騰。
        Array(1202041, 300, 1, 3), // 白·酷咪圖騰 // 根據穿著白色運動服的酷咪導師的樣子所做的圖騰。
        Array(1202042, 300, 1, 3), // 紅·酷咪圖騰 // 根據穿著紅色運動服的酷咪導師的樣子所做的圖騰。
        Array(1202083, 300, 1, 3), // 真·伊昆圖騰 // (無描述)
        Array(1202084, 300, 1, 3), // 金·伊昆圖騰 // (無描述)
        Array(1202085, 300, 1, 3), // 銀·伊昆圖騰 // (無描述)
        Array(1202086, 300, 1, 3), // 銅·伊昆圖騰 // (無描述)
//Array(1202098, 600, 1, 3),  // 未知的便當圖騰 // 無任何屬性的空白圖騰.製作便當的話也許長老斯坦會根據美味來進行升級.
        Array(1202099, 600, 1, 3), // 深藍色便當圖騰 // 升級1次的圖騰.
        Array(1202100, 300, 1, 3), // 紫色便當圖騰 // 升級2次的圖騰.
        Array(1202101, 300, 1, 3), // 綠色便當圖騰 // 升級3次的圖騰.
        Array(1202102, 300, 1, 3), // 紅色便當圖騰 // 升級4次的圖騰.
        Array(1202103, 300, 1, 3), // 藍色便當圖騰 // 升級5次的圖騰.
        Array(1202104, 300, 1, 3), // 黃色便當圖騰 // 升級6次的圖騰.
        Array(1202105, 300, 1, 3), // 橘黃色便當圖騰 // 升級7次的圖騰.
        Array(1202106, 300, 1, 3), // 真正的便當圖騰 // 升級8次的圖騰.
        Array(1202107, 300, 1, 3), // 斯坦的美味便當圖騰 // 這是受到感動的長老斯坦所給予,裝滿祝福的最終版美味圖騰.
        Array(1202108, 300, 1, 3), // 真深藍色便當圖騰 // 升級1次的圖騰.
        Array(1202109, 300, 1, 3), // 真紫色便當圖騰 // 升級2次的圖騰.
        Array(1202110, 300, 1, 3), // 真綠色便當圖騰 // 升級3次的圖騰.
        Array(1202111, 300, 1, 3), // 真紅色便當圖騰 // 升級4次的圖騰.
        Array(1202112, 300, 1, 3), // 真藍色便當圖騰 // 升級5次的圖騰.
        Array(1202113, 300, 1, 3), // 真黃色便當圖騰 // 升級6次的圖騰.
        Array(1202114, 300, 1, 3), // 真橘黃色便當圖騰 // 升級7次的圖騰.
        Array(1202115, 300, 1, 3), // 真正的便當圖騰 // 升級8次的圖騰.
        Array(1202094, 300, 1, 3), // 王魔女圖騰 // 表現出班主任王美女真正恐怖之處的圖騰
        Array(1202095, 300, 1, 3), // 王美女圖騰 // 表現出班主任王美女深藏不露之美的圖騰
        Array(1202096, 300, 1, 3), // 王微笑圖騰 // 表現出班主任王美女多情一面的圖騰
        Array(3010007, 300, 1, 3), // 粉色海豹靠墊, 10, 1, 3), // 是一款可愛的粉色海豹模樣的靠墊，靠在上面每10秒鐘HP恢復60。
        Array(3010008, 300, 1, 3), // 藍色海豹靠墊, 10, 1, 3), // 是一款可愛的藍色海豹模樣的靠墊，靠在上面每10秒鐘HP恢復60。
        Array(3010009, 300, 1, 3), // 榻榻凳, 10, 1, 3), // 有著心型靠墊的可愛的凳子．坐著的時候每10秒回復HP 20, MP 30
        Array(3010010, 300, 1, 3), // 白色海豹靠墊, 10, 1, 3), // 是一款可愛的白色海豹模樣的靠墊，靠在上面每10秒鐘HP恢復50。
        Array(3010014, 300, 1, 3), // 月亮彎, 10, 1, 3), // 每10秒鐘恢復HP&MP30，無法交換&交易.
        Array(3010016, 300, 1, 3), // 黑色海豹靠墊, 10, 1, 3), // 是一款可愛的黑色海豹模樣的靠墊，靠在上面每10秒鐘HP恢復60。
        Array(3010017, 300, 1, 3), // 金色海豹靠墊, 10, 1, 3), // 是一款可愛的金色海豹模樣的靠墊，靠在上面每10秒鐘HP恢復60。
        Array(3010018, 300, 1, 3), // 椰子樹沙灘椅, 10, 1, 3), // 放置在納希沙漠涼爽的椰子樹樹蔭下的沙灘椅。坐下時，每10秒中，恢復HP 40, MP 20。
        Array(3010029, 300, 1, 3), // 藍環凳, 10, 1, 3), // 閃耀著藍色光芒的圓環凳子
        Array(3010030, 300, 1, 3), // 黑環凳, 10, 1, 3), // 閃耀著黑色光芒的圓環凳子
        Array(3010031, 300, 1, 3), // 紅環凳, 10, 1, 3), // 閃耀著紅色光芒的圓環凳子
        Array(3010032, 300, 1, 3), // 黃環凳, 10, 1, 3), // 閃耀著黃色光芒的圓環凳子
        Array(3010033, 300, 1, 3), // 綠環凳, 10, 1, 3), // 閃耀著綠色光芒的圓環凳子
        Array(3010039, 300, 1, 3), // 黑色海狗靠墊, 10, 1, 3), // 是一款可愛的黑色海狗模樣的靠墊，靠在上面每10秒鐘HP恢復60。
        Array(3010046, 300, 1, 3), // 紅龍椅, 10, 1, 3), // 與紅龍一起休息,每10秒可恢復HP 60.
        Array(3010047, 300, 1, 3), // 藍龍椅, 10, 1, 3), // 與藍龍一起休息,每10秒可恢復MP 60.
        Array(3010181, 300, 1, 3), // MP椅子 , 10, 1, 3), // 坐在上面可以感受補MP的快感，每10秒鐘可恢復MP50
        Array(3010406, 300, 1, 3), // 迷你神獸椅子, 10, 1, 3), // 坐在迷你神獸椅子上，每10秒恢復HP50, MP50。
        Array(3010691, 300, 1, 3), // 粉色海豹椅子, 10, 1, 3), // 可愛的粉色海豹椅子。每10秒，HP和MP各恢復50。
        Array(3010692, 300, 1, 3), // 藍色海豹椅子, 10, 1, 3), // 可愛的藍色海豹椅子。每10秒，HP和MP各恢復50。
        Array(3010405, 3, 1, 3), // 擺鐘椅子, 3, 1, 3), // 坐在擺鐘椅子上，每10秒恢復HP50, MP50。
        Array(3010406, 3, 1, 3), // 迷你神獸椅子, 3, 1, 3), // 坐在迷你神獸椅子上，每10秒恢復HP50, MP50。
        Array(3010421, 3, 1, 3), // 發財椅, 3, 1, 3), // 即便短暫，也去感受下大款們的感覺吧！每10秒恢復HP100點，MP50點。
        Array(3010586, 3, 1, 3), // 發財椅, 3, 1, 3), // 即便短暫，也去感受下大款們的感覺吧！每10秒恢復HP100點，MP50點。
        Array(3010423, 3, 1, 3), // 蘑菇朋友椅子, 3, 1, 3), // 又可愛又好吃，去和蘑菇交朋友吧。每10秒恢復HP100點，MP50點。
        Array(3010505, 3, 1, 3), // 和殺人鯨一起看棒球, 3, 1, 3), // 和殺人鯨、史烏一起愉快的玩棒球。坐下每10秒恢復50點HP和MP。
        Array(3010506, 3, 1, 3), // 萬聖節南瓜椅, 3, 1, 3), // 為了紀念萬聖節而製作的椅子。休息期間，每10秒HP恢復50點。 
        Array(3010516, 3, 1, 3), // 嚕嚕啦啦印第安小孩, 3, 1, 3), // 成為了淘氣的印第安小孩們的俘虜。每10秒HP恢復50點，MP恢復50點。
        Array(3010517, 3, 1, 3), // 印第安小孩的朋友, 3, 1, 3), // 和印第安村莊中生長出來的新芽一起，沉醉在叢林的寂靜中吧。每10秒HP恢復50點，MP恢復50點。
        Array(3010518, 3, 1, 3), // 印第安元老的兄弟, 3, 1, 3), // 真誠的印第安元老們，坐下來感覺很有負擔。坐在上面時，每10秒HP恢復50點，MP恢復50點。
        Array(3010519, 3, 1, 3), // 巨大白雪人椅子, 3, 1, 3), // 企鵝王一定會羨慕的。體驗變成企鵝國王的感覺吧。每10秒HP恢復50點，MP恢復50點。 
        Array(3010520, 3, 1, 3), // 巨大企鵝王椅子, 3, 1, 3), // 企鵝王什麼的很容易馴服。為帥氣的我特別準備的椅子。每10秒HP恢復50點，MP恢復50點。 
        Array(3010521, 3, 1, 3), // 水晶椅, 3, 1, 3), // 用閃閃發光的神秘水晶做成的椅子。看上去很昂貴。休息期間，每10秒HP恢復50點。
        Array(3010522, 3, 1, 3), // 兔子旋風, 3, 1, 3), // 狂躁的兔子乘著旋風飛起來了。注意保持重心。每10秒HP恢復50點，MP恢復50點。 
        Array(3010523, 3, 1, 3), // 白雲漫步椅, 3, 1, 3), // 讓人感覺像在天上漫步一樣的椅子。每10秒HP恢復50點，MP恢復50點。
        Array(3010524, 3, 1, 3), // 威爾士柯基犬椅子, 3, 1, 3), // 可以成為可愛的威爾士柯基犬們的朋友的椅子。坐在上面時，每10秒HP恢復50點，MP恢復50點。
        Array(3010525, 3, 1, 3), // 貓頭鷹椅子, 3, 1, 3), // 可以讓人理解關在鳥籠中的貓頭鷹的心情的椅子。坐在上面時，每10秒HP恢復50點，MP恢復50點。
        Array(3010526, 3, 1, 3), // 白鸛飛行員椅子, 3, 1, 3), // 喙的力量世界最強的白鸛飛行員椅子。坐在上面時，每10秒HP恢復50點，MP恢復50點。
        Array(3010530, 3, 1, 3), // 埃歐雷的小型音樂會, 3, 1, 3), // 可以欣賞精靈女王精靈遊俠的特別演唱會的椅子。每10秒HP恢復50，MP恢復50。
        Array(3010531, 3, 1, 3), // 小企鵝合唱團, 3, 1, 3), // 正在唱聖誕頌歌的小企鵝們。每10秒HP恢復50，MP恢復50。
        Array(3010532, 3, 1, 3), // 藍色木椅, 3, 1, 3), // 只能在維多利亞港買到的藍色木椅。 坐在上面，每10秒HP恢復35。
        Array(3010533, 3, 1, 3), // 椰子樹沙灘椅, 3, 1, 3), // 放在納希沙漠涼爽的椰子樹下的沙灘椅。坐在上面，每10秒HP恢復40，MP恢復20。
        Array(3010534, 3, 1, 3), // 公沙沙兔靠墊, 3, 1, 3), // 靠著可愛的公沙沙兔坐著，每10秒HP恢復60。
        Array(3010535, 3, 1, 3), // 海藍天鵝絨沙發, 3, 1, 3), // 奢華的海藍色天鵝絨沙發。坐在上面，每10秒HP恢復60。
        Array(3010536, 3, 1, 3), // 紅色設計師椅子, 3, 1, 3), // 採用明亮紅色的設計師椅子。坐在上面，每10秒HP恢復60。
        Array(3010537, 3, 1, 3), // 惡靈附身的娃娃椅子, 3, 1, 3), // 惡靈附身的娃娃椅子。坐在上面，每10秒HP恢復50。
        Array(3010538, 3, 1, 3), // 機械椅, 3, 1, 3), // 坐在上面，每10秒恢復HP的機械椅。
        Array(3010539, 100, 1, 3), // 紅色龍椅, 3, 1, 3), // 有嚴肅的火龍相伴的椅子。每10秒HP恢復50，MP恢復50。
        Array(3010540, 100, 1, 3), // 藍色龍椅, 3, 1, 3), // 有嚴苛的青龍相伴的椅子。每10秒HP恢復50，MP恢復50。
        Array(3010541, 3, 1, 3), // 發財椅, 3, 1, 3), // 暫時感受一下富翁的感覺吧！每10秒HP恢復100，MP恢復50。
        Array(3010542, 3, 1, 3), // 夏日喵喵椅, 3, 1, 3), // 和貓咪一起在電扇前面閒坐吧！每10秒HP恢復50，MP恢復50。
        Array(3010543, 3, 1, 3), // 魔力皮卡啾, 3, 1, 3), // 可以體驗到皮卡啾的強大魔力的椅子。每10秒HP恢復50，MP恢復50。
        Array(3010544, 3, 1, 3), // 熱帶夏日椅子, 3, 1, 3), // 滿眼都是水果！每10秒HP恢復50，MP恢復50。
        Array(3010545, 3, 1, 3), // 千年狐椅子, 3, 1, 3), // 夢幻的千年狐椅子。每10秒HP恢復50，MP恢復50。
        Array(3010546, 3, 1, 3), // 邪惡黑龍椅子, 3, 1, 3), // 代表著黑暗的王座。每10秒HP恢復50，MP恢復50。
        Array(3010547, 3, 1, 3), // 魔法之書, 3, 1, 3), // 會讓人感覺變聰明。每10秒HP恢復50，MP恢復50。
        Array(3010548, 3, 1, 3), // 可愛音符椅子, 3, 1, 3), // 讓人很想邀請戀人一起坐的椅子。沒有戀人的話，就獨自享受孤獨吧。每10秒HP恢復50，MP恢復50。
        Array(3010549, 3, 1, 3), // 羊羔椅子, 3, 1, 3), // 毛絨絨的羊羔。讓人不想出去打獵。每10秒HP恢復50，MP恢復50。
        Array(3010550, 3, 1, 3), // 尋找故鄉的月妙椅子, 3, 1, 3), // 據說會在明後天帶著年糕回來。每10秒HP恢復50，MP恢復50。
        Array(3010551, 3, 1, 3), // 邪惡之毒椅子, 3, 1, 3), // 看上去非常兇惡的椅子。每10秒HP恢復50，MP恢復50。
        Array(3010552, 3, 1, 3), // 喵喵的免費擁抱, 3, 1, 3), // 看上去很善良的貓咪。感覺像跟人擁抱一樣的貓咪椅子。每10秒HP恢復50，MP恢復50。
        Array(3010553, 3, 1, 3), // 邪惡羊椅子, 3, 1, 3), // 可怕的羊。不要隨便餵它。每10秒HP恢復50，MP恢復50。
        Array(3010554, 3, 1, 3), // 粉色手柄, 3, 1, 3), // 夢想進入遊戲排名的少女的夢想，粉紅色的遊戲手柄椅子。每10秒HP恢復50，MP恢復50。
        Array(3010555, 3, 1, 3), // 深夜貓頭鷹, 3, 1, 3), // 寂靜森林中的貓頭鷹，還有我。每10秒HP恢復50，MP恢復50。
        Array(3010556, 3, 1, 3), // 皮膚皇后椅子, 3, 1, 3), // 不要害羞。專為在皮膚保養方面決不妥協的你準備的椅子。每10秒HP恢復50，MP恢復50。
        Array(3010557, 3, 1, 3), // 睡覺小鳥椅子, 3, 1, 3), // 坐在天真的小鳥們中間，和它們一起打盹吧。每10秒HP恢復50，MP恢復50。
        Array(3010558, 3, 1, 3), // 泡泡浴椅子, 3, 1, 3), // 讓人感覺自己好像變乾淨了。每10秒HP恢復50，MP恢復50。
        Array(3010559, 3, 1, 3), // 龍蛋, 3, 1, 3), // 裂開的蛋。坐在上面休息時，每10秒HP恢復50，MP恢復50。

        Array(1190401, 300, 1, 3), // C等級BOSS競技場徽章 // (無描述)
        Array(1190402, 200, 1, 3), // B//等級BOSS競技場徽章 // (無描述)
        Array(1190403, 100, 1, 3), // B等級BOSS競技場徽章 // (無描述)
        Array(1190404, 100, 1, 3), // B+等級BOSS競技場徽章 // (無描述)
        Array(1190405, 100, 1, 3), // A等級BOSS競技場徽章 // (無描述)
        Array(1190406, 100, 1, 3), // A+等級BOSS競技場徽章 // (無描述)
        Array(1190407, 50, 1, 3), // S等級BOSS競技場徽章 // (無描述)
// ------ 特殊 ------
        Array(5064300, 600, 2, 2), //卷軸防護卷軸
        Array(5062500, 600, 1, 2), //大師附加神奇方塊
        Array(5062000, 600, 2, 2), //神奇方塊
//Array(5064000, 600, 1, 2), //防爆卷軸
        Array(5064100, 600, 1, 2), //保護卷軸
        Array(5062002, 600, 1, 2), //高級神奇方塊
// ------ 150級武器 ------
        Array(1402196, 2, 1, 3),
        Array(1432167, 2, 1, 3),
        Array(1452205, 2, 1, 3),
        Array(1462193, 2, 1, 3),
        Array(1472214, 2, 1, 3),
        Array(1332225, 2, 1, 3),
        Array(1342082, 2, 1, 3),
        Array(1362090, 2, 1, 3),
        Array(1382208, 2, 1, 3),
        Array(1372177, 2, 1, 3),
        Array(1212063, 2, 1, 3),
        Array(1242060, 2, 1, 3),
        Array(1232057, 2, 1, 3),
        Array(1522094, 2, 1, 3),
// 椅子 
        Array(3010225, 50, 1, 3),
        Array(3010226, 50, 1, 3),
        Array(3010824, 50, 1, 3),
        Array(3010825, 50, 1, 3),
        Array(3010826, 50, 1, 3),
        Array(3010827, 50, 1, 3),
        Array(3010829, 50, 1, 3),
        Array(3010828, 50, 1, 3),
        Array(3010830, 50, 1, 3),
        Array(3010831, 50, 1, 3),
//Array(3010832, 50, 1, 3),
        Array(3010279, 50, 1, 3),
        Array(4310030, 100, 10, 3), //運動會幣
        Array(4310030, 70, 50, 3),
        Array(4310030, 50, 100, 3),
        Array(4310036, 300, 10, 3), //征服者幣
        Array(4310036, 200, 50, 3), //征服者幣
        Array(4310036, 100, 100, 3), //征服者幣
//必成卷
        Array(2040006, 200, 1, 3), //頭盔防禦
        Array(2040007, 200, 1, 3), //頭盔體力
        Array(2040303, 200, 1, 3), //耳環智力
        Array(2040403, 100, 1, 3), //上衣防禦
        Array(2040506, 200, 1, 3), //全身鎧甲敏捷
        Array(2040507, 300, 1, 3), //防禦
        Array(2040603, 300, 1, 3), //褲裙防禦
        Array(2040709, 200, 1, 3), //鞋子敏捷
        Array(2040710, 200, 1, 3), //鞋子跳躍
        Array(2040711, 200, 1, 3), //鞋子速度
        Array(2040806, 200, 1, 3), //手套敏捷
        Array(2040903, 200, 1, 3), //盾牌防禦
        Array(2041024, 200, 1, 3), //披風魔防
        Array(2041025, 200, 1, 3), //披風物防
        Array(2043003, 100, 1, 3), //單手劍攻擊
        Array(2043103, 100, 1, 3), //斧
        Array(2043203, 100, 1, 3), //鈍器
        Array(2043303, 100, 1, 3), //短劍
        Array(2043703, 100, 1, 3), //短杖
        Array(2043803, 100, 1, 3), //長杖
        Array(2044003, 100, 1, 3), //雙手劍
        Array(2044019, 100, 1, 3), //雙手劍魔力
        Array(2044103, 100, 1, 3), // 斧頭
        Array(2044203, 100, 1, 3), //鈍器
        Array(2044303, 100, 1, 3), //槍攻擊
        Array(2044403, 100, 1, 3), //矛攻擊
        Array(2044503, 100, 1, 3), //弓攻擊
        Array(2044603, 100, 1, 3), //弩
        Array(2044703, 100, 1, 3), //全套
        Array(2044815, 100, 1, 3), //指虎
        Array(2044908, 100, 1, 3)  //火槍
        );


function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        im.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 600);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "祖母綠抽獎禮包", notice);
            if (item != -1) {
                im.gainItem(2430069, -1);
                im.gainItem(4310030, 10);
                im.sendOk("你獲得了 #b#t" + item + "##k " + quantity + "個，額外得到10個運動會幣的獎勵，可以在遊戲商店中兌換#b運動會裝備#k和#b必成卷軸#k。");
            } else {
                im.sendOk("請你確認在背包的裝備，消耗，其他窗口中是否有一格以上的空間。");
            }
            im.safeDispose();
        } else {
            im.gainItem(2430069, -1);
            im.sendOk("今天的運氣可真差，什麼都沒有拿到。");
            im.safeDispose();
        }
    }
}