status = -1;
var itemList = Array(
// ------ 椅子 ------
Array(3010013, 600, 1, 1), //悠長假期
Array(3010014, 600, 1, 1), //月亮彎
Array(3010021, 600, 1, 1), //暖暖桌
Array(3010025, 600, 1, 1), //楓葉紀念凳
Array(3010028, 600, 1, 1), //海盜的俘虜
Array(3010029, 600, 1, 1), //藍環凳
Array(3010030, 600, 1, 1), //黑環凳
Array(3010031, 600, 1, 1), //紅環凳
Array(3010032, 600, 1, 1), //黃環凳
Array(3010033, 600, 1, 1), //綠環凳
Array(3010144, 600, 1, 1), //七夕椅子
Array(3010163, 600, 1, 1), //滿月椅
// ------ 卷軸 ------
Array(2046113, 700, 1, 1), //雙手武器攻擊卷軸60%
Array(2046013, 700, 1, 1), //單手武器魔力卷軸60%
Array(2046012, 700, 1, 1), //單手武器攻擊力卷軸60%
Array(2040914, 700, 1, 1), //盾牌攻擊卷軸60%
Array(2040919, 700, 1, 1), //盾牌魔力卷軸60%
Array(2049002, 600, 1, 1), //白醫卷軸
Array(2340000, 600, 1, 1), //祝福卷軸
Array(2049100, 600, 1, 1), //混沌卷軸60%
Array(2049300, 600, 1, 1), //高級裝備強化卷軸
Array(2049400, 600, 1, 1), //高級潛能附加卷軸
Array(2049309, 600, 1, 1), //2星裝備強化卷軸
Array(2049401, 700, 1, 1), //潛能附加卷軸
Array(2049301, 700, 1, 1), //裝備強化卷軸
Array(2290285, 700, 1, 1), //神秘能手冊
// ------ 裝備 ------
Array(1112427, 500, 1, 1), //冒險家的殘酷之戒
Array(1112428, 500, 1, 1), //冒險家的爆擊之戒
Array(1112429, 500, 1, 1), //冒險家的魔法之戒
Array(1032077, 500, 1, 1), //萊格斯的綠色耳環
Array(1032078, 500, 1, 1), //萊格斯的紅色耳環
Array(1032079, 500, 1, 1), //萊格斯的藍色耳環
Array(1112585, 500, 1, 1), //天使的祝福
Array(1202000, 500, 1, 1), //冰凍殭屍-圖騰
Array(1202001, 500, 1, 1), //火焰殭屍-圖騰
Array(1202002, 500, 1, 1), //中毒殭屍-圖騰
Array(1202003, 500, 1, 1), //觸電殭屍-圖騰
Array(1202004, 400, 1, 1), //詛咒殭屍-圖騰
Array(1132013, 500, 1, 1), //不滅的法老腰帶
Array(1132091, 500, 1, 1), //十字旅團基本腰帶
Array(1112907, 500, 1, 1), //小魚戒指
Array(1102041, 500, 1, 1), //浪人披風(粉)
Array(1102042, 500, 1, 1), //浪人披風(紫)
Array(1012319, 500, 1, 1), //8週年點點紅
Array(1152054, 500, 1, 1), //完成的護肩
Array(1032026, 500, 1, 1), //黃水晶耳環
// ------ 特殊 ------
Array(5062000, 400, 1, 1), //神奇方塊
Array(2430639, 100, 1, 1), //明日禮物箱子(銀)
Array(4031997, 700, 1, 1), //蘑菇楓幣
Array(5064000, 400, 1, 1), //防爆卷軸
Array(2022800, 700, 1, 1), //心跳停止糖
Array(4310015, 700, 1, 1), //鬥神證物
Array(4021012, 700, 1, 1), //強烈靈魂的淨水
Array(4021011, 700, 1, 1), //純潔靈魂的火花
Array(5220040, 400, 1, 1), //楓之谷轉蛋券
Array(5570000, 400, 1, 1), //金錘子
Array(5150040, 400, 1, 1), //皇家理發券
// ------ 玩具 ------
Array(1442018, 700, 1, 1), //凍凍魚
Array(1092022, 700, 1, 1), //調色板盾牌
Array(1322051, 700, 1, 1), //七夕
Array(1402044, 700, 1, 1), //南瓜燈籠
// ------ 任務物品 ------
Array(3994067, 700, 1, 1), //字母I
Array(3994059, 700, 1, 1), //字母A
Array(3994071, 700, 1, 1), //字母M
Array(3994066, 700, 1, 1), //字母H
Array(3994074, 700, 1, 1), //字母P
Array(3994083, 700, 1, 1), //字母Y
Array(4001220, 500, 1, 1), //褪色的特殊項鏈
Array(4001221, 500, 1, 1), //褪色的勇氣碎塊
Array(4001222, 500, 1, 1), //褪色的智慧碎塊
Array(4001223, 500, 1, 1), //褪色的娜精準碎塊
Array(4001224, 500, 1, 1), //褪色的敏捷碎塊
Array(4001225, 500, 1, 1), //褪色的自由碎塊
Array(4032177, 500, 1, 1), //褪色的冒險之心項墜
Array(4001226, 300, 1, 1), //褪色的勇氣之心
Array(4001227, 300, 1, 1), //褪色的智慧之心
Array(4001228, 300, 1, 1), //褪色的精準之心
Array(4001229, 300, 1, 1), //褪色的敏捷之心
Array(4001230, 300, 1, 1) //褪色的自由之心
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用嗎？…我的肚子裡有各類#b奇特座椅或卷軸、裝備、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 700);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "明日禮物箱子(銅)", notice);
            if (item != -1) {
            im.gainItem(2430638, -1);
                im.sendOk("你獲得了 #b#t" + item + "##k " + quantity + "個。"+ chance +"");
            } else {
                im.sendOk("請你確認在背包的裝備，消耗，其他窗口中是否有一格以上的空間。");
            }
            im.safeDispose();
        } else {
            im.sendOk("今天的運氣可真差，什麼都沒有拿到。\r\n(獲得了安慰獎：運動會幣 x3。)");
            im.gainItem(4310030, 3);
            im.safeDispose();
        }
    }
}