var status = -1;

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        if ((im.getSpace(1) > 1 || im.getSpace(2) > 1 || im.getSpace(3) > 1 || im
                .getSpace(4) > 1)) {
            im.sendYesNo("這裡是儲值抽獎專區。我背包裡面包含了必成卷軸、大PB、140所有裝備哦。如果你儲值滿了300可以再這裡免費抽獎一次哦！你確定要抽獎嗎？");
        } else {
            im.sendOk("我背包裡面包含了必成卷軸、大PB、140所有裝備哦。如果你儲值滿了300可以再這裡免費抽獎一次哦！你的儲值金額到300了嗎？");
            im.safeDispose();
        }
    } else if (status == 1) {
        if ((im.getSpace(1) > 1 || im.getSpace(2) > 1 || im.getSpace(3) > 1 || im
                .getSpace(4) > 1)) {
            var item;
            var chance = Math.floor(Math.random() * 30);
            if (chance >= 0 && chance <= 6) {
                im.gainExp(+2000000000);
                im.sendOk("恭喜你獲得了20E經驗值。");
                im.worldMessage("恭喜玩家" + im.getChar().getName()
                        + "在明日箱子（金）中吸取20E經驗。");
                im.dispose();
            } else if (chance >= 7 && chance <= 10) {
                im.gainMeso(+100000000);
                im.sendOk("恭喜你獲得了1E楓幣。");
                im.worldMessage("恭喜玩家" + im.getChar().getName()
                        + "在明日箱子（金）中無意拿到1E支票。");
                im.dispose();
            } else {

                var chance1 = Math.floor(Math.random() * 10);
                if (chance1 > 5) {
                    var itemList = new Array(1532098, // 法弗納榮耀炮 - (無描述)
                    1522094, // 法弗納雙風翼弩 - (無描述)
                    1492179, // 法弗納左輪槍 - (無描述)
                    1482168, // 法弗納巨狼之爪 - (無描述)
                    1472214, // 法弗納危險之手 - (無描述)
                    1462193, // 法弗納風翼弩 - (無描述)
                    1452205, // 法弗納追風者 - (無描述)
                    1442223, // 法弗納半月寬刃斧 - (無描述)
                    1432167, // 法弗納貫雷槍 - (無描述)
                    1422140, // 法弗納閃電錘 - (無描述)
                    1412135, // 法弗納戰鬥切肉斧 - (無描述)
                    1402196, // 法弗納懺悔之劍 - (無描述)
                    1382208, // 法弗納魔冠之杖 - (無描述)
                    1372177, // 法弗納魔力奪取者 - (無描述)
                    1362090, // 法弗納洞察手杖 - (無描述)
                    1342082, // 法弗納急速之刃 - (無描述)
                    1332225, // 法弗納大馬士革劍 - (無描述)
                    1322203, // 法弗納戈耳迪錘 - (無描述)
                    1312153, // 法弗納雙刃切肉斧 - (無描述)
                    1302275, // 法弗納銀槲之劍 - (無描述)
                    1242061, // 法弗納精神之刃 - 魯塔比斯套裝(海盜)專用武器
                    1242060, // 法弗納精神之刃 - 魯塔比斯套裝(盜賊)專用武器
                    1232057, // 法弗納死亡使者 - (無描述)
                    1222058, // 法弗納天使手銃 - (無描述)
                    1003797, // 高貴劍士頭盔 - (無描述)
                    1003798, // 高貴流丹維奇帽 - (無描述)
                    1003799, // 高貴遊俠貝雷帽 - (無描述)
                    1003800, // 高貴刺客軟帽 - (無描述)
                    1003801, // 高貴流浪者帽 - (無描述)
                    1042254, // 鷹眼劍士盔甲 - (無描述)
                    1042255, // 鷹眼丹維奇長袍 - (無描述)
                    1042256, // 鷹眼遊俠斗篷 - (無描述)
                    1042257, // 鷹眼刺客襯衣 - (無描述)
                    1042258, // 鷹眼流浪者外衣 - (無描述)
                    1062165, // 魔術師劍士短褲 - (無描述)
                    1062166, // 魔術師丹維奇短褲 - (無描述)
                    1062167, // 魔術師遊俠短褲 - (無描述)
                    1062168, // 魔術師刺客短褲 - (無描述)
                    1062169, // 魔術師流浪者短褲 - (無描述)
                    1212063// 法弗納魔力源泉杖 - (無描述)
                    );
                    item = im.gainGachaponItem(itemList[Math.floor(Math
                            .random()
                            * itemList.length)], 1, "明日箱子（金）");
                } else {
                    var itemList = new Array(2040303, // 耳環智力必成卷
                    2040006, // 頭盔防禦必成卷
                    2040007, // 頭盔體力必成卷
                    2040403, // 上衣防禦必成卷
                    2040506, // 全身盔甲敏捷必成卷
                    2040507, // 全身盔甲防禦必成卷
                    2040603, // 褲裙防禦必成卷
                    2040507, // 全身盔甲防禦必成卷
                    2040603, // 褲裙防禦必成卷
                    2040709, // 鞋子敏捷必成卷
                    2040710, // 鞋子跳躍必成卷
                    2040711, // 鞋子速度必成卷
                    2040806, // 手套敏捷必成卷
                    2040903, // 盾牌防禦必成卷
                    2040507, // 全身盔甲防禦必成卷
                    2040603, // 褲裙防禦必成卷
                    2041024, // 披風魔法防禦必成卷
                    2041025, // 披風物理防禦必成卷
                    2043003, // 單手劍攻擊必成卷
                    2044019, // 雙手劍魔力必成卷
                    2044019, // 雙手劍魔力必成卷
                    2043103, // 單手斧攻擊必成卷
                    2043203, // 單手棍攻擊必成卷
                    2043303, // 短劍攻擊必成卷
                    2043703, // 短杖攻擊必成卷
                    2043803, // 長杖攻擊必成卷
                    2044003, // 雙手劍攻擊必成卷
                    2044019, // 雙手劍魔力必成卷
                    2044103, // 雙手斧攻擊必成卷
                    2040903, // 盾牌防禦必成卷
                    2040903, // 盾牌防禦必成卷
                    2044203, // 雙手棍攻擊必成卷
                    2044303, // 槍攻擊必成卷
                    2044403, // 矛攻擊必成卷
                    2044503, // 弓攻擊必成卷
                    2044603, // 弩攻擊必成卷
                    2044703, // 拳套攻擊必成卷
                    2044815, // 指虎攻擊必成卷
                    2044908, // 火槍攻擊必成卷
                    2340000, // 祝福卷軸
                    2049406, // 特殊潛能附加卷軸
                    2049303, // 高級裝備強化卷軸
                    3010070, // 巨無霸皮卡啾
                    3010073, // baby皮卡啾
                    3010073, // baby皮卡啾
                    1402014, // 溫度計
                    1003172, // 獅心戰鬥頭盔
                    1102275, // 獅心戰鬥披風
                    1082295, // 獅心戰鬥護腕
                    1052314, // 獅心戰鬥鎖子甲
                    1072485, // 獅心戰鬥鞋
                    1003173, // 龍尾法師帽子
                    1102276, // 龍尾法師披風
                    1082296, // 龍尾法師手套
                    1052315, // 龍尾法師長袍
                    1072486, // 龍尾法師鞋
                    1003174, // 鷹翼哨兵便帽
                    1102277, // 鷹翼哨兵披風
                    1082297, // 鷹翼哨兵手套
                    1052316, // 鷹翼哨兵服
                    1072487, // 鷹翼哨兵鞋
                    1003175, // 渡鴉之魂追蹤者帽
                    1102278, // 渡鴉之魂獵人披風
                    1082298, // 渡鴉之魂追蹤者手套
                    1052317, // 渡鴉之魂追蹤者盔甲
                    1072488, // 渡鴉之魂追蹤者鞋
                    1003176, // 鯊齒船長帽
                    1102279, // 鯊齒船長披風
                    1082299, // 鯊齒船長手套
                    1052318, // 鯊齒船長外套
                    1072489, // 鯊齒船長鞋
                    1432086, // 獅心長槍
                    1442116, // 獅心長矛
                    1322096, // 獅心震雷
                    1422066, // 獅心巨錘
                    1402095, // 獅心戰刀
                    1412065, // 獅心戰斧
                    1302152, // 獅心彎刀
                    1312065, // 獅心勇斧
                    1372084, // 龍尾短杖
                    1382104, // 龍尾長杖
                    1452111, // 鷹翼重弓
                    1462099, // 鷹翼重弩
                    1332130, // 渡鴉之魂（短劍）
                    1472122, // 渡鴉之魂
                    1342036, // 精靈角刀
                    1492085, // 鯊齒手銃
                    1532018, // 鯊齒鷹爪
                    1302016, // 鯊齒火炮
                    1522018 // 龍翼弩槍
                    );
                    item = im.gainGachaponItem(itemList[Math.floor(Math
                            .random()
                            * itemList.length)], 1, "在明日箱子（金）");
                }
            }
            if (item != -1) {
                im.sendOk("你獲得了 #b#t" + item + "##k.");
            } else {
                im.sendOk("請你確認在背包的裝備,消耗,其他窗口中是否有一格以上的空間?");
            }
        } else {
            im.sendOk("xx錯誤");
        }
        im.safeDispose();
    }
}