status = -1;
var itemList = Array(
Array(5062000, 700, 1, 3), //同一紅傘下
Array(5062002, 700, 1, 3), //浴桶
Array(5064000, 700, 1, 3), //愛心椅子
Array(5062500, 700, 1, 3), //愛心椅子
Array(5062010, 700, 1, 3), //魔女的飛掃把
Array(2340000, 700, 1, 3), //紅龍椅
Array(2049323, 350, 1, 3), //無損
Array(2049325, 700, 1, 3), //聖誕樹椅子
Array(2049136, 500, 1, 3), //公主凳
Array(2049765, 500, 1, 3), 

Array(2030000, 500, 1, 3), 
Array(2030001, 500, 1, 3), 
Array(2030002, 500, 1, 3), 
Array(2030003, 500, 1, 3), 
Array(2030004, 500, 1, 3), 
Array(2030005, 500, 1, 3), 
Array(2030006, 500, 1, 3), 
Array(2030007, 500, 1, 3), 
//---
Array(1202112, 300, 1, 3),  // 真藍色便當圖騰 // 升級5次的圖騰.
Array(1202113, 300, 1, 3),  // 真黃色便當圖騰 // 升級6次的圖騰.
Array(1202114, 300, 1, 3),  // 
Array(3010555, 300, 1, 3), // 深夜貓頭鷹, 3, 1, 3), // 寂靜森林中的貓頭鷹，還有我。每10秒HP恢復50，MP恢復50。
Array(3010556, 300, 1, 3), // 皮膚皇后椅子, 3, 1, 3), // 不要害羞。專為在皮膚保養方面決不妥協的你準備的椅子。每10秒HP恢復50，MP恢復50。
Array(3010557, 300, 1, 3), // 睡覺小鳥椅子, 3, 1, 3), // 坐在天真的小鳥們中間，和它們一起打盹吧。每10秒HP恢復50，MP恢復50。
Array(3010558, 300, 1, 3), // 泡泡浴椅子, 3, 1, 3), // 讓人感覺自己好像變乾淨了。每10秒HP恢復50，MP恢復50。
Array(3010559, 300, 1, 3),// 龍蛋, 3, 1, 3), // 裂開的蛋。坐在上面休息時，每10秒HP恢復50，MP恢復50。
Array(1142500, 100, 1, 3), // 神秘凡雷恩的惡夢 // (無描述)
Array(1142501, 100, 1, 3), // 神秘阿卡伊農的惡夢 // (無描述)
Array(1142502, 100, 1, 3), // 神秘希拉的惡夢 // (無描述)
Array(1142503, 100, 1, 3), // 神秘殘暴炎魔的惡夢 // (無描述)
Array(1142504, 100, 1, 3), // 神秘闇黑龍王的惡夢 // (無描述)
Array(1142505, 100, 1, 3), // 神秘之門研究者 // (無描述)
Array(4033356, 500, 1, 3),
Array(4310036, 500, 100, 3),
Array(4031311, 500, 2, 3),
Array(4310020, 500, 40, 3),
Array(2590007, 500, 1, 3),
//----靈魂結晶
Array(2591085, 300, 1, 3),
Array(2591086, 300, 1, 3),
Array(2591087, 300, 1, 3),
Array(2591088, 300, 1, 3),
Array(2591163, 300, 1, 3),
Array(2591202, 300, 1, 3),
Array(2591233, 300, 1, 3),
Array(2591264, 300, 1, 3),
Array(2591296, 300, 1, 3),

Array(2591305, 300, 1, 3),
Array(2591314, 300, 1, 3),
Array(2591323, 300, 1, 3),
Array(2591332, 300, 1, 3),
Array(2591341, 300, 1, 3),
Array(2591391, 300, 1, 3),
Array(2591400, 300, 1, 3),
Array(2591409, 300, 1, 3),
Array(2591418, 300, 1, 3),
Array(2591427, 300, 1, 3),
Array(2591486, 300, 1, 3),
//wute
Array(1212101, 300, 1, 3),
Array(1222095, 300, 1, 3),
Array(1232095, 300, 1, 3),
Array(1402236, 300, 1, 3),
Array(1242102, 300, 1, 3),
Array(1262011, 300, 1, 3),
Array(1302315, 300, 1, 3),
Array(1312185, 300, 1, 3),
Array(1322236, 300, 1, 3),
Array(1332260, 300, 1, 3),
Array(1342100, 500, 1, 3),
Array(1362121, 500, 1, 3),
Array(1372207, 500, 1, 3),
Array(1382245, 500, 1, 3),
Array(1412164, 500, 1, 3),
Array(1422171, 500, 1, 3),
Array(1432200, 500, 1, 3),
Array(1442254, 500, 1, 3),

Array(1452238, 300, 1, 3),
Array(1462225, 300, 1, 3),
Array(1472247, 300, 1, 3),
Array(1482202, 300, 1, 3),
Array(1492212, 300, 1, 3),
Array(1522124, 300, 1, 3),
Array(1532130, 300, 1, 3),

Array(1252086, 300, 1, 3),
Array(1542101, 300, 1, 3),
Array(1552102, 300, 1, 3),
// ------ wuai ------
Array(1032221, 300, 1, 3), //
//Array(1032222, 300, 1, 3), // 
Array(1132244, 300, 1, 3), //
//Array(1132245, 300, 1, 3),
Array(1122265, 300, 1, 3),
//Array(1122266, 300, 1, 3),
//---低級貝勒
Array(1113072, 500, 1, 3),
Array(1032220, 500, 1, 3),
Array(1122264, 500, 1, 3),
Array(1132243, 500, 1, 3),
Array(1113072, 500, 1, 3),
Array(1032220, 500, 1, 3),
Array(1122264, 500, 1, 3),
Array(1132243, 500, 1, 3),


Array(1113074, 300, 1, 3),
Array(1113073, 300, 1, 3),
Array(1113073, 300, 1, 3),
Array(1132244, 300, 1, 3),
Array(1122265, 300, 1, 3),
Array(1032221, 300, 1, 3),
Array(1212044, 500, 1, 3),
Array(1222044, 500, 1, 3),
Array(1232041, 500, 1, 3),
Array(1242044, 500, 1, 3),
Array(1302248, 500, 1, 3),
Array(1312135, 500, 1, 3),
Array(1322181, 500, 1, 3),
Array(1332205, 500, 1, 3),
Array(1342075, 500, 1, 3),
Array(1362074, 500, 1, 3),
Array(1362079, 500, 1, 3),
Array(1372161, 500, 1, 3),
Array(1382192, 500, 1, 3),
Array(1402172, 500, 1, 3),
Array(1412122, 500, 1, 3),
Array(1422124, 500, 1, 3),
Array(1432150, 500, 1, 3),
Array(1442202, 500, 1, 3),
Array(1452189, 500, 1, 3),
Array(1462177, 500, 1, 3),
Array(1472197, 500, 1, 3),
Array(1482151, 500, 1, 3),
Array(1492162, 500, 1, 3),
Array(1522078, 500, 1, 3),
Array(1532081, 500, 1, 3),
Array(1252031, 500, 1, 3)

);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用嗎？…我的肚子裡有各類#b奇特座椅或卷軸、裝備、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 500);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "夏日浪花箱", notice);
            if (item != -1) {
        im.gainItem(2431341, -1);
                im.sendOk("你獲得了 #b#t" + item + "##k " + quantity + "個。");
            } else {
                im.sendOk("請你確認在背包的裝備，消耗，其他窗口中是否有一格以上的空間。");
            }
            im.safeDispose();
        } else {
            im.sendOk("今天的運氣可真差，什麼都沒有拿到。");
            im.safeDispose();
        }
    }
}