function start() {
    var selStr = "- #e#d耽誤您一分鐘請務必認真看完。#k#n\r\n\r\n";
    selStr +="#e#r1).#n #d請您加入芒果交流群 （71686495） 以便及時獲得最新消息方便您和芒果其他玩家交流芒果官方網站：www.52mgmxd.com. 請您經常查看群公告和芒果官網動態所有信息都在這兩處公佈不喜歡看公告和芒果官網的玩家損失自己負責管理不提供任何補償方式。\r\n";
    selStr +="#e#r2).#n #b芒果屬於超強仿官方版本真正獨立光纖雙線伺服器，長期穩定，不刪檔，福利活動多。同步官方版本 BUG完美修復全職業開放。擁有很多特色副本適合長期發展的玩家定居經驗倍數25倍楓幣倍數10倍遊戲爆率5倍.芒果楓之谷中介幣可以放進玩家自己開的商店賣哦\r\n";
    selStr +="#e#r3).#n #d芒果可以使用的命令可以在遊戲中對話框輸入 @help查看， 常用命令有：#r@fh{回到市場}  @pm {打開拍賣面板}  @ea {在點不了NPC時使用}  @fh {死亡後消耗楓幣原地復活}  @刪除盾牌{惡魔職業刪除盾牌使用}.\r\n";
    selStr +="#e#r4).#n #b背包裡贈送的基礎禮物箱子，當你等級達到一定的時候會贈送您一些藥水，當樂豆點或者楓點足夠買寵物時可以先去商城買個寵物，然後打開寵物欄勾選上（撿取道具） 寵物就就可以自動撿取道具了，所有職業每次轉職能自動獲得職業武器1把 特殊點的職業 林之靈 龍魔導士 等 無法獲得職業武器的 請您去各村子武器商店購買 當等級達到30級， 60級，100級，160級, 210級， 250級，達到這些等級 可以在 「拍賣》更多服務》等級獎勵」中領取等級獎勵，250級更是可以獲得不可思議的獎勵物品.\r\n";
    selStr +="#e#r5).#n #d怪物都會掉落RED幣此物品收集到一定數量可以在「拍賣》遊戲商店》RED幣商店」購買物品芒果技能書出處可以通過怪物及BOOS掉落職業能手冊開出來也可以通過世界怪物掉落的神秘能手冊開出來，也可以去打寶地圖，此地圖爆率比野外高很多，可以讓玩家快速獲得神秘技能冊.\r\n";
    selStr +="#e#r6).#n #b市場泡點每60秒可以全服任何地圖可以獲得2樂豆點2楓點，自由市場可以獲得雙倍，並且在12小時，18小時在線獎勵可以領取總計1W8的楓點上班族沒時間玩可以掛在市場哦，這對於您的變強很有幫助.\r\n";
    selStr +="#e#r7).#n #d法弗納150級武器系列可以通過市場NPC武器製作自己製作，武器需要的材料獲得方式很多（通過組隊任務 BOOS 遊戲副本 里程來兌換製作材料）（也可以通過釣魚積分來兌換製作材料）（也可以通過每日任務活力值來兌換製作材料）還可以打BOOS獲得材料獲得方式多種多樣 關於其它裝備 請您自行在遊戲中探尋或者在芒果交流群和朋友們 交流.\r\n";
    selStr +="#e#r8).#n #b部分道具的出處。運動會幣可以去副本獲得，征服幣可以去完成（納希沙漠）副本獲得，RED幣 所有怪物掉落，以及神秘之冰隨機開出 ，（正義火種）可以取完成組隊任務{廢棄組隊}副本隨機獲得，BOOS也有一定的概率掉落，在線時間獎勵 也可以獲得火種 等其它道具，每週7天連續簽到 也能獲得很多道具 更有全屬性裝備哦.\r\n";
    selStr +="#e#r9).#n #d美容美發拍賣裡面的整形醫院能把玩家傳送到弓箭手村美容店，使用萬能美發卷和萬能整容卷自己選擇普通髮型臉型  高級髮型臉型只能在 自由市場的美容NPC 使用皇家美發卷 和皇家整容卷 隨機隨出來.\r\n";
    selStr +="#e#r10).#n #b新手成長說明：1升級方式1-100級除了打怪還是打怪 100-160 級 現在您已經四轉了 擁有了強力技能 可以選擇刷進化系統副本來快速升級此副本屬於超級升級副本 除了大量經驗什麼都沒有 也可以選擇其它方式升級 選擇其它方式升級的 進度自然慢一點 不過能獲得很多道具 楓幣等 160-250級 這個階段 您只能去找朋友帶BOOS或者自己去打BOOS升級 有時間去打寶地圖刷技能書 道具等等一些物品 慢慢來強化自己的裝備 增強自身的實力160級開始  領取完等級獎勵 您就已經成長起來了，就得開始強化自身的實力了 增強實力的方式大家都知道的 就不一一說明了 高級BOOS 沒有一定實力是打不動的.\r\n";
    selStr +="#e#r11).#n #d芒果會員分為土豪和平民2種方式，具體內容「拍賣》 芒果理財》」查詢.\r\n";
    selStr +="#e#r12).#n #b本服福利活動非常多有天天福利活動大型活動等等 活動請留意群公告 和芒果官方網站.\r\n";
    selStr +="#e#r13).#n #d關於推廣福利說明：您介紹朋友進來務必要求您的朋友填寫您的遊戲賬戶 （是遊戲賬戶 不是角色名字）朋友填好您的賬戶 您和您的朋友都能獲得一定的福利 您朋友等級達到180級 您和您朋友能再次獲得一定的福利. \r\n如果您介紹的是土豪朋友，您將獲得更多的福利\r\n您的土豪朋友儲值 您就能自動獲得朋友儲值金額10%的樂豆點 此推廣福利長期有效\r\n";
    selStr +="#e#r附加說明 ：\r\n#n #b所有說明都是有限的 做不到十全十美 具體功能全部以遊戲內容為準 很多內容需要玩家自己在遊戲中體驗探索。\r\n所有利用BUG謀取福利的玩家 直接珊號處理 對不起 請您從新開始\r\n芊芊在此祝福您 \在芒果玩的開心快樂！";
    im.sendOk(selStr);
         //im.sendOk("- #e#d本服玩家交流群：2335015#k#n\r\n\r\n#b1). #r新手玩家會贈送有起步資金，建議先去商城購買個寵物，然後按開E，選擇寵物欄位，夠選上寵物揀取道具。\r\n#b2). #r建議先瞭解市場NPC以及#b拍賣#r上面的功能，升級途中會掉落神秘之冰，神秘之冰會開出高級裝備所需要的硬幣以及方塊卷軸等等。拍賣上面有RED幣商店，以及市場#b#p9900001##r處有征服者幣商店，可以進行購買。\r\n#b3). #r怪物會有幾率掉落楓點物品。有幾率性掉落500/1000/1500/3000/4000等商品卷。雙擊使用後會獲得大量楓點。\r\n#b4). #r本服市場掛機30秒將會獲得1積分，積分可以在#b拍賣#r處在線兌換兌換樂豆點，方塊，120-140裝備，卷軸等等。\r\n#b5). #r本服每天基本都有活動舉行，活動獎品很豐富，活動會獎勵樂豆點，方塊，高級卷軸，高級裝備，稀有點裝，椅子等等。\r\n#b6). #r本服150武器可以自己去打材料在市場#b#p9900001##r處製作。材料的出處，以及技能書等等都在群共享裡。\r\n#b7). #r本服正在努力做到更好中，如果您有什麼建議或者意見，請加我們的玩家交流群聯繫群主，最後感謝您的到來。");
    im.worldSpouseMessage(0x14,"『毛莫的信』：玩家 "+ im.getChar().getName() +" 對本服不瞭解查看了本服介紹說明書。");
        im.dispose(); 
}
