status = -1;
var itemList = Array(

//椅子
//Array(
//3015097, 300, 1, 3), // 金魚
Array(
3015098, 300, 1, 3), // 花蘑菇偽裝椅子
Array(
3015099, 300, 1, 3), // 扎納羅非偽裝椅子
//Array(
//3015015, 300, 1, 3), // 白羊座椅子
//Array(
//3015016, 300, 1, 3), // 金牛座椅子
//Array(
//3015017, 300, 1, 3), // 雙魚座椅子
//Array(
//3015018, 300, 1, 3), // 雙子座椅子 
//Array(
//3015019, 300, 1, 3), // 巨蟹座椅子
//Array(
//3015020, 300, 1, 3), // 獅子座椅子 
//Array(
//3015021, 300, 1, 3), // 天秤座椅子  
//Array(
//3015022, 300, 1, 3), // 天蠍座椅子 
//Array(
//3015023, 300, 1, 3), // 處女座椅子
//Array(
//3015024, 300, 1, 3), // 射手座椅子
//Array(
//3015025, 300, 1, 3), // 山羊座椅子
//Array(
//3015026, 300, 1, 3), // 水瓶座椅子 
Array(
3015027, 300, 1, 3), // 安德洛墨達椅子
Array(
3012007, 300, 1, 3), // 石獅椅子
Array(
3012008, 300, 1, 3), // 稻荷神社椅子
Array(
3010967, 300, 1, 3), // 假面紳士海報椅子
Array(
3010968, 300, 1, 3), // 假面紳士抱枕椅子
Array(
3010973, 300, 1, 3), // 蝙蝠椅子
//Array(
//3010853, 300, 1, 3), // 心花怒放椅子
Array(
3015106, 300, 1, 3), // 羅曼蒂克天文台
//Array(
//3015076, 300, 1, 3), // 雛祭娃娃4
Array(
3015077, 300, 1, 3), // 雛祭娃娃5
Array(
3015078, 300, 1, 3), // 雛祭娃娃6
Array(
3015088, 300, 1, 3), // 元宵煙花椅
Array(
3015093, 300, 1, 3), // 煙花綻放椅子
Array(
3012027, 300, 1, 3), // 羊羊熱氣球椅子
Array(
3012023, 300, 1, 3), // mPhone椅子
Array(
3010756, 300, 1, 3), // 新年招財貓椅子
Array(
3010980, 300, 1, 3), // 兔子箱椅子
Array(
3010751, 300, 1, 3), // 鯨魚椅子
Array(
3015080, 300, 1, 3), // 被蛋卷椅子
Array(
3010862, 300, 1, 3), // 兔子胡蘿蔔椅子
Array(
3010447, 300, 1, 3), // 睡覺小鳥椅子
Array(
3010448, 300, 1, 3), // 泡泡浴椅子
Array(
3010435, 300, 1, 3), // 千年狐椅子
Array(
3010411, 300, 1, 3), // 魚尾獅椅子
Array(
3010405, 300, 1, 3), // 擺鐘椅子
Array(
3700017, 300, 1, 3), // 擺鐘椅子
Array(
3700018, 300, 1, 3), // 擺鐘椅子
Array(
3700014, 300, 1, 3), // 擺鐘椅子
Array(
3700013, 300, 1, 3), // 擺鐘椅子
Array(
3700012, 300, 1, 3), // 擺鐘椅子
Array(
3700011, 300, 1, 3), // 擺鐘椅子
Array(
3700010, 300, 1, 3), // 擺鐘椅子
Array(
3700009, 300, 1, 3), // 擺鐘椅子
Array(
3700004, 300, 1, 3), // 擺鐘椅子
Array(
3700001, 300, 1, 3), // 擺鐘椅子
Array(
3700000, 300, 1, 3), // 擺鐘椅子
Array(
3700042, 300, 1, 3), // 擺鐘椅子
Array(
3700044, 300, 1, 3), // 擺鐘椅子
Array(
3700042, 300, 1, 3), // 擺鐘椅子
Array(
3700045, 300, 1, 3), // 擺鐘椅子
Array(
3010405, 300, 1, 3), // 擺鐘椅子
Array(
3700046, 300, 1, 3), // 擺鐘椅子
Array(
3700047, 300, 1, 3), // 擺鐘椅子
Array(
3700049, 300, 1, 3), // 擺鐘椅子
Array(
3700060, 300, 1, 3), // 擺鐘椅子
Array(
3700101, 300, 1, 3), // 擺鐘椅子
Array(
3700104, 300, 1, 3), // 擺鐘椅子
Array(
3700118, 300, 1, 3), // 擺鐘椅子
Array(
3700124, 300, 1, 3), // 擺鐘椅子
Array(
3700141, 300, 1, 3), // 擺鐘椅子
Array(
3700148, 300, 1, 3), // 擺鐘椅子
Array(
3700149, 300, 1, 3), // 擺鐘椅子
Array(
3700150, 300, 1, 3), // 擺鐘椅子
Array(
3015047, 300, 1, 3), // 擺鐘椅子
Array(
2432466, 300, 1, 3), // 金色楓葉
Array(
3015046, 300, 1, 3), // 擺鐘椅子1010
Array(
3015272, 300, 1, 3), // 擺鐘椅子1010
Array(
3012030, 300, 1, 3), // 擺鐘椅子1010
Array(
3015304, 300, 1, 3), // 擺鐘椅子1010
Array(
3015263, 300, 1, 3), // 擺鐘椅子1010
Array(
3015272, 300, 1, 3), // 擺鐘椅子1010
Array(
3015268, 300, 1, 3), // 擺鐘椅子1010
Array(
3015269, 300, 1, 3), // 擺鐘椅子1010
Array(
3015271, 300, 1, 3), // 擺鐘椅子1010
Array(
3996056, 300, 1, 3), // 擺鐘椅子1010
Array(
3016101, 300, 1, 3), // 擺鐘椅子1010
Array(
3015328, 200, 1, 3), // 擺鐘椅子1010
Array(
3015329, 300, 1, 3), // 擺鐘椅子1010
Array(
3015338, 300, 1, 3), // 擺鐘椅子1010
Array(
3015312, 200, 1, 3), // 擺鐘椅子1010
Array(
3015029, 250, 1, 3), // 擺鐘椅子1010
Array(
3014010, 250, 1, 3), // 擺鐘椅子1010
Array(
3010836, 300, 1, 3), // 度假地奧拉夫椅子
Array(
3010660, 300, 1, 3), // 夢幻公主城堡椅子
Array(
3010978, 300, 1, 3), // 生病的殺人鯨抱枕椅子
//Array(
//3015274, 300, 1, 3), // 1111
Array(
3015182, 300, 1, 3), // 1111
Array(
3012028, 300, 1, 3), // 1111
Array(
3015058, 300, 1, 3), // 1111
Array(
3010843, 300, 1, 3), // 1111
Array(
3010853, 300, 1, 3), // 1111
Array(
3010696, 300, 1, 3), // 1111
Array(
3010756, 300, 1, 3), // 1111
Array(604422, 300, 1, 3), // 
Array(604423, 300, 1, 3), // 
Array(604424, 300, 1, 3), //
Array(604425, 300, 1, 3), // 
Array(604426, 300, 1, 3)// 
/*
Array(1052882, 300, 1, 3), // 
Array(1052887, 300, 1, 3), // 
Array(1052888, 300, 1, 3), // 
Array(1052889, 300, 1, 3), // 
Array(1052890, 300, 1, 3), // 
Array(1073030, 300, 1, 3), // 赫裡希安精銳劍士腰帶 // (無描述)
Array(1073032, 300, 1, 3), // 赫裡希安精銳法師腰帶 // (無描述)
Array(1073033, 300, 1, 3), // 赫裡希安精銳弓箭手腰帶 // (無描述)
Array(1073034, 300, 1, 3), // 赫裡希安精銳盜賊腰帶 // (無描述)
Array(1073035, 300, 1, 3), // 
Array(1082636, 100, 1, 3), // 諾巴西亞戴斯披風 // (無描述)
Array(1082637, 100, 1, 3), // 諾巴赫爾梅斯披風 // (無描述)
Array(1082638, 100, 1, 3), // 諾巴凱倫披風 // (無描述)
Array(1082639, 100, 1, 3), // 諾巴西亞戴斯靴 // (無描述)
Array(1082640, 100, 1, 3), // 
Array(1102775, 100, 1, 3), // 諾巴凱倫靴 // (無描述)
Array(1102794, 100, 1, 3), // 諾巴利卡昂靴 // (無描述)
Array(1102795, 100, 1, 3), // 諾巴阿爾泰靴 // (無描述)
Array(1102796, 100, 1, 3), // 諾巴利卡昂披風 // (無描述)
Array(1102797, 100, 1, 3), // 
Array(1132169, 100, 1, 3), // 諾巴西亞戴斯腰帶 // (無描述)
Array(1132170, 100, 1, 3), // 諾巴赫爾梅斯腰帶 // (無描述)
Array(3010845, 100, 1, 3), // 諾巴凱倫腰帶 // (無描述)
Array(3015075, 100, 1, 3), // 諾巴利卡昂腰帶 // (無描述)
Array(3015059, 100, 1, 3) // 諾巴阿爾泰腰帶 // (無描述)
*/
);
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用嗎？…我的肚子裡有各類#b奇特座椅或卷軸、裝備、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 300);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            
            /*
            if (im.getChar().getName() == "Super大y") {
                im.setPQLog("Super大y");
                if (im.getPQLog("Super大y") == 3) {
                    itemId = 1242060;
                    quantity = 1;
                    notice = 3;
                }
            }*/
            item = im.gainGachaponItem(itemId, quantity, "被封印的箱子", notice);
            if (item != -1) {
                im.gainItem(2431046, -1);
                //im.gainItem(436030, 10);
                im.sendOk("你獲得了 #b#t" + item + "##k " + quantity + "個");
            } else {
                im.sendOk("請你確認在背包的裝備，消耗，其他窗口中是否有一格以上的空間。");
            }
            im.safeDispose();
        } else {
            im.gainItem(2431046, -1);
            im.sendOk("今天的運氣可真差，什麼都沒有拿到。");
            im.safeDispose();
        }
    }
}