status = -1;
var itemList = Array(
1052314, // 獅心戰鬥鎖子甲, // (無描述)
1052315, // 龍尾法師長袍, // (無描述)
1052316, // 鷹翼哨兵服, // (無描述)
1052317, // 渡鴉之魂追蹤者盔甲, // (無描述)
1052318, // 鯊齒船長外套, // (無描述)
1082296, // 龍尾法師手套, // (無描述)
1082297, // 鷹翼哨兵手套, // (無描述)
1082298, // 渡鴉之魂追蹤者手套, // (無描述)
1082299, // 鯊齒船長手套, // (無描述)
1082295, // 獅心戰鬥護腕, // (無描述)
1152110, // 龍尾法師護肩, // (無描述)
1152111, // 鷹翼哨兵護肩, // (無描述)
1152112, // 渡鴉之魂獵人護肩, // (無描述)
1152113, // 鯊齒船長護肩, // (無描述)
1152108, // 獅心戰鬥護肩, // (無描述)
1102275, // 獅心戰鬥披風, // (無描述)
1102276, // 龍尾法師披風, // (無描述)
1102277, // 鷹翼哨兵披風, // (無描述)
1102278, // 渡鴉之魂獵人披風, // (無描述)
1102279, // 鯊齒船長披風, // (無描述)
1003172, // 獅心戰鬥頭盔, // (無描述)
1003173, // 龍尾法師帽子, // (無描述)
1003174, // 鷹翼哨兵便帽, // (無描述)
1003175, // 渡鴉之魂追蹤者帽, // (無描述)
1003176, // 鯊齒船長帽, // (無描述)
1072485, // 獅心戰鬥鞋, // (無描述)
1072486, // 龍尾法師鞋, // (無描述)
1072487, // 鷹翼哨兵鞋, // (無描述)
1072488, // 渡鴉之魂追蹤者鞋, // (無描述)
1072489 // 鯊齒船長鞋, // (無描述)
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
       if (mode == 0 && status == 0) {
            im.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        var text = "";
        for(var i=0; i<itemList.length; i++) {
            text+="#L"+i+"##v"+itemList[i]+"##z"+itemList[i]+"##l\r\n";
        }
        im.sendSimple("請選擇你要換取的140防具：\r\n#r"+text);
    } else if(status == 1) {
        var itemid = itemList[selection];
        var itemnum = Math.floor(Math.random()*1+1);
        var item = im.gainGachaponItem(itemid, itemnum, "140防具箱子（自選）", 3);
        im.gainItem(2431468, -1);
        im.sendOk("恭喜您，獲得了"+itemnum+"個#b#z"+itemid+"#");
        im.safeDispose();
    }
}