status = -1;
var itemList = Array(
// ------ 卷軸 ------
Array(1010000, 500, 1, 2), //混沌卷軸60%
Array(1010001, 600, 1, 2), //祝福卷軸
Array(1010002, 100, 1, 2), //S級潛能卷軸 30%
Array(1010003, 50, 1, 3),
Array(1010004, 500, 1, 2), //A級潛能附加卷軸 40%
Array(1010005, 500, 1, 2), //附加潛能附加卷軸 50%
Array(1010006, 500, 1, 2), //3星裝備強化卷軸 80%
Array(1011000, 300, 1, 2),
Array(1011001, 150, 1, 3),
Array(1011002, 150, 1, 3),
Array(1011003, 150, 1, 3),
Array(1012057, 150, 1, 3),
Array(1012001, 150, 1, 3),
Array(1012002, 150, 1, 3),
Array(1012003, 150, 1, 3),
Array(1012004, 150, 1, 3),
Array(1012005, 150, 1, 3),
Array(1012006, 150, 1, 3),
Array(1012007, 150, 1, 3),
Array(1012008, 150, 1, 3),
Array(1012009, 150, 1, 3),
Array(1012010, 150, 1, 3),
Array(1012021, 150, 1, 3),
Array(1012022, 150, 1, 3),
Array(1012023, 150, 1, 3),
Array(1012024, 150, 1, 3),
Array(1012025, 150, 1, 3),
Array(1012026, 150, 1, 3),
Array(1012027, 150, 1, 3),
Array(1012028, 150, 1, 3),
Array(1012029, 150, 1, 3),
Array(1012030, 150, 1, 3),
Array(1012031, 150, 1, 3),
Array(1012032, 150, 1, 3),
Array(1012033, 150, 1, 3),
Array(1012034, 150, 1, 3),
Array(1012035, 150, 1, 3),
Array(1012036, 150, 1, 3),
Array(1012037, 150, 1, 3),
Array(1012038, 150, 1, 3),
Array(1012039, 150, 1, 3),
Array(1012040, 150, 1, 3),
Array(1012044, 150, 1, 3),
// ------ 裝備 ------
Array(1020000, 500, 1, 2), //藍調戒指
//
Array(1021000, 150, 1, 3), // 宿命正義單手武器攻擊力卷軸 100% // 為單手武器增加攻擊力屬性。
Array(1022000, 150, 1, 3), // 宿命正義單手武器魔力卷軸 100% // 為單手武器增加魔法攻擊力屬性。
Array(1022002, 150, 1, 3), // 宿命正義雙手武器攻擊力卷軸 100% // 為雙手武器增加攻擊力屬性。
Array(1022001, 150, 1, 3), // 宿命正義防具力量卷軸 100% // 為防具增加力量屬性。
Array(1022003, 150, 1, 3), // 宿命正義防具智力卷軸 100% // 為防具增加智力屬性。
Array(1022004, 150, 1, 3), // 宿命正義防具敏捷卷軸 100% // 為防具增加敏捷屬性。
Array(1022005, 150, 1, 3), // 宿命正義防具運氣卷軸 100% // 為防具增加運氣屬性。
Array(1022006, 150, 1, 3), // 宿命正義飾品力量卷軸 100% // 為飾品增加力量屬性。
Array(1022007, 150, 1, 3), // 宿命正義飾品智力卷軸 100% // 為飾品增加智力屬性。
Array(1022008, 150, 1, 3), // 宿命正義飾品敏捷卷軸 100% // 為飾品增加敏捷屬性。
Array(1022009, 150, 1, 3), // 宿命正義飾品運氣卷軸 100% // 為飾品增加運氣屬性。
Array(1022011, 150, 1, 3),
Array(1022012, 150, 1, 3),
Array(1022013, 150, 1, 3),
Array(1022014, 150, 1, 3),
Array(1022015, 150, 1, 3),
Array(1022016, 150, 1, 3),
Array(1022017, 150, 1, 3),
Array(1022018, 150, 1, 3),
Array(1022019, 150, 1, 3),
Array(1022020, 150, 1, 3),
Array(1022021, 150, 1, 3),
Array(1022022, 150, 1, 3),
Array(1022023, 150, 1, 3),
Array(1022024, 150, 1, 3),
Array(1022025, 150, 1, 3),
Array(1022026, 150, 1, 3),
Array(1022027, 150, 1, 3),
Array(1022028, 150, 1, 3),
Array(1022029, 150, 1, 3),
Array(1022030, 150, 1, 3),
Array(1022031, 150, 1, 3),
Array(1022032, 150, 1, 3),
Array(1022033, 150, 1, 3),
Array(1022034, 150, 1, 3),
Array(1022010, 50, 1, 3), // 烈日臉飾 // (無描述)
//帥氣勳章

Array(1022035, 100, 1, 3), // 神秘凡雷恩的惡夢 // (無描述)
Array(1022036, 100, 1, 3), // 神秘阿卡伊農的惡夢 // (無描述)
Array(1022038, 100, 1, 3), // 神秘希拉的惡夢 // (無描述)
Array(1022037, 100, 1, 3), // 神秘殘暴炎魔的惡夢 // (無描述)
Array(1022039, 100, 1, 3), // 神秘闇黑龍王的惡夢 // (無描述)
Array(1022039, 100, 1, 3),
Array(1022040, 100, 1, 3),
Array(1022041, 100, 1, 3),
Array(1022042, 100, 1, 3),
Array(1022043, 100, 1, 3),
Array(1022044, 100, 1, 3),
Array(1022045, 100, 1, 3),
Array(1022046, 100, 1, 3),
Array(1022047, 100, 1, 3),
Array(1022048, 100, 1, 3),
Array(1022049, 100, 1, 3),
Array(1022050, 100, 1, 3),
Array(1022051, 100, 1, 3),
Array(1022052, 100, 1, 3),
Array(1022053, 100, 1, 3),
Array(1022054, 100, 1, 3)
        );

var itemList2 = Array(
Array(1022055, 100, 1, 3),
Array(1022056, 100, 1, 3),
Array(1022057, 100, 1, 3),
Array(1022058, 100, 1, 3),
Array(1022060, 100, 1, 3),
Array(1022040, 100, 1, 3), // 神秘之門研究者 // (無描述)

// 圖騰
Array(1002734, 600, 1, 3), // 真·喬圖騰 // 聚集了喬的強烈靈魂的強力圖騰。
Array(1000006, 600, 1, 3),  // 金·喬圖騰 // 根據喬的樣子所做的黃金圖騰。
Array(1000007, 600, 1, 3),  // 銀·喬圖騰 // 根據喬的樣子所做的銀圖騰。
Array(1000008, 600, 1, 3),  // 木·喬圖騰 // 根據喬的樣子所做的木圖騰。
Array(1000017, 600, 1, 3),  // 真·海麗蜜圖騰 // 聚集了海麗蜜的強烈靈魂的強力圖騰。
Array(1000018, 300, 1, 3),  // 金·海麗蜜圖騰 // 根據海麗蜜的樣子所做的黃金圖騰。
Array(1000019, 300, 1, 3),  // 銀·海麗蜜圖騰 // 根據海麗蜜的樣子所做的銀圖騰。
Array(1000020, 300, 1, 3),  // 木·海麗蜜圖騰 // 根據海麗蜜的樣子所做的木圖騰。
Array(1000023, 300, 1, 3),  // 真·小龍圖騰 // 聚集了小龍的強烈靈魂的強力圖騰。
Array(1000024, 300, 1, 3),  // 金·小龍圖騰 // 根據小龍的樣子所做的黃金圖騰。
Array(1000025, 300, 1, 3),  // 銀·小龍圖騰 // 根據小龍的樣子所做的銀圖騰。
Array(1000026, 300, 1, 3),  // 木·小龍圖騰 // 根據小龍的樣子所做的木圖騰。
Array(1000027, 300, 1, 3),  // 真·李卡司圖騰 // 聚集了李卡司的強烈靈魂的強力圖騰。
Array(1000028, 300, 1, 3),  // 金·李卡司圖騰 // 根據李卡司的樣子所做的黃金圖騰。
Array(1000029, 300, 1, 3),  // 銀·李卡司圖騰 // 根據李卡司的樣子所做的銀圖騰。
Array(1000030, 300, 1, 3),  // 木·李卡司圖騰 // 根據李卡司的樣子所做的木圖騰。
Array(1000031, 300, 1, 3),  // 黑·酷咪圖騰 // 根據穿著黑色運動服的酷咪導師的樣子所做的圖騰。
Array(1000032, 300, 1, 3),  // 粉·酷咪圖騰 // 根據穿著粉紅色運動服的酷咪導師的樣子所做的圖騰。
Array(1001000, 300, 1, 3),  // 白·酷咪圖騰 // 根據穿著白色運動服的酷咪導師的樣子所做的圖騰。
Array(1001001, 300, 1, 3),  // 紅·酷咪圖騰 // 根據穿著紅色運動服的酷咪導師的樣子所做的圖騰。
Array(1001002, 300, 1, 3),  // 真·伊昆圖騰 // (無描述)
Array(1001035, 300, 1, 3),
Array(1001036, 300, 1, 3),
Array(1001037, 300, 1, 3),
Array(1001038, 300, 1, 3),
Array(1001039, 300, 1, 3),
Array(1001040, 300, 1, 3),
Array(1001045, 300, 1, 3),
Array(1001046, 300, 1, 3),
Array(1001047, 300, 1, 3),
Array(1001048, 300, 1, 3),
Array(1001049, 300, 1, 3),
Array(1002000, 300, 1, 3),
Array(1002031, 300, 1, 3),
Array(1002032, 300, 1, 3),
Array(1002033, 300, 1, 3),
Array(1002070, 300, 1, 3),
Array(1002071, 300, 1, 3),
Array(1002076, 300, 1, 3),
Array(1002077, 300, 1, 3),
Array(1002078, 300, 1, 3),
Array(1002079, 300, 1, 3),
Array(1002187, 300, 1, 3),
Array(1002189, 300, 1, 3),
Array(1002190, 300, 1, 3),
Array(1002191, 300, 1, 3),
Array(1002192, 300, 1, 3),
Array(1002193, 300, 1, 3),
Array(1002194, 300, 1, 3),
Array(1002195, 300, 1, 3),
Array(1002196, 300, 1, 3),
Array(1002197, 300, 1, 3),
Array(1002198, 300, 1, 3),
Array(1002199, 300, 1, 3),
Array(1002200, 300, 1, 3),
Array(1002201, 300, 1, 3),
Array(1002202, 300, 1, 3),
Array(1002203, 300, 1, 3),
Array(1002204, 300, 1, 3),
Array(1002205, 300, 1, 3),
Array(1002206, 300, 1, 3),
Array(1002219, 300, 1, 3),
Array(1002222, 300, 1, 3),
Array(1002223, 300, 1, 3),
Array(1002221, 300, 1, 3),
Array(1002224, 300, 1, 3),
Array(1002225, 300, 1, 3),
Array(1002226, 300, 1, 3),
Array(1002227, 300, 1, 3),
Array(1002228, 300, 1, 3),
Array(1002229, 300, 1, 3),
Array(1002230, 300, 1, 3),
Array(1002231, 300, 1, 3),
Array(1002232, 300, 1, 3),
Array(1002233, 300, 1, 3),
Array(1002234, 300, 1, 3),
Array(1002235, 300, 1, 3),
Array(1002236, 300, 1, 3),
Array(1002237, 300, 1, 3),
Array(1002238, 300, 1, 3),
Array(1002239, 300, 1, 3),
Array(1002250, 300, 1, 3),
Array(1002551, 300, 1, 3),
Array(1002255, 300, 1, 3),
Array(1002250, 300, 1, 3),
Array(1002256, 300, 1, 3),
Array(1002257, 300, 1, 3),
Array(1002258, 300, 1, 3),
Array(1002259, 300, 1, 3),
Array(1002260, 300, 1, 3),
Array(1002261, 300, 1, 3),
Array(1002262, 300, 1, 3),
Array(1002263, 300, 1, 3),
Array(1002265, 300, 1, 3),
Array(1002266, 300, 1, 3),
Array(1002279, 300, 1, 3),
Array(1002280, 300, 1, 3),
Array(1002281, 300, 1, 3),
Array(1002282, 300, 1, 3),
Array(1002283, 300, 1, 3),
Array(1002284, 300, 1, 3),
Array(1002294, 300, 1, 3),
Array(1002291, 300, 1, 3),
Array(1002292, 300, 1, 3),
Array(1002293, 300, 1, 3),
Array(1002295, 300, 1, 3),
Array(1002296, 300, 1, 3),
Array(1002297, 300, 1, 3),
Array(1002298, 300, 1, 3),
Array(1002299, 300, 1, 3),
Array(1002300, 300, 1, 3),
Array(1002301, 300, 1, 3),
Array(1002302, 300, 1, 3),
Array(1002303, 300, 1, 3),
Array(1002304, 300, 1, 3),
Array(1002305, 300, 1, 3),
Array(1002306, 300, 1, 3),
Array(1002307, 300, 1, 3),
Array(1002308, 300, 1, 3),
Array(1002309, 300, 1, 3),
Array(1002310, 300, 1, 3),
Array(1002311, 300, 1, 3),
Array(1002312, 300, 1, 3),
Array(1002313, 300, 1, 3),
Array(1002314, 300, 1, 3),
Array(1002315, 300, 1, 3),
Array(1002316, 300, 1, 3),
Array(1002317, 300, 1, 3),
Array(1002318, 300, 1, 3),
Array(1002319, 300, 1, 3),
Array(1002320, 300, 1, 3),
Array(1002321, 300, 1, 3),
Array(1002322, 300, 1, 3),
Array(1002323, 300, 1, 3),
Array(1002324, 300, 1, 3),
Array(1002325, 300, 1, 3),
Array(1002326, 300, 1, 3),
Array(1002327, 300, 1, 3),
Array(1002328, 300, 1, 3),
Array(1002329, 300, 1, 3),
Array(1002330, 300, 1, 3),
Array(1002331, 300, 1, 3),
Array(1002332, 300, 1, 3),
Array(1002333, 300, 1, 3),
Array(1002334, 300, 1, 3),
Array(1002335, 300, 1, 3),
Array(1002336, 300, 1, 3),
Array(1002337, 300, 1, 3),
Array(1002338, 300, 1, 3),
Array(1002339, 300, 1, 3),
Array(1002340, 300, 1, 3),
Array(1002341, 300, 1, 3),
Array(1002342, 300, 1, 3),
Array(1002343, 300, 1, 3),
Array(1002344, 300, 1, 3),
Array(1002345, 300, 1, 3),
Array(1002346, 300, 1, 3),
Array(1002347, 300, 1, 3),
Array(1002348, 300, 1, 3),
Array(1002349, 300, 1, 3),
Array(1002350, 300, 1, 3),
Array(1002351, 300, 1, 3),
Array(1002352, 300, 1, 3),
Array(1002353, 300, 1, 3),
Array(1002354, 300, 1, 3)
        );

var itemList3 = Array(
Array(1002355, 300, 1, 3),
Array(1002356, 300, 1, 3),
Array(1002357, 300, 1, 3),
Array(1002358, 300, 1, 3),
Array(1002359, 300, 1, 3),
Array(1002360, 300, 1, 3),
Array(1002361, 300, 1, 3),
Array(1002362, 300, 1, 3),
Array(1002367, 300, 1, 3),
Array(1002368, 300, 1, 3),
Array(1002369, 300, 1, 3),
Array(1002370, 300, 1, 3),
Array(1002371, 300, 1, 3),
Array(1002372, 300, 1, 3),
Array(1002373, 300, 1, 3),
Array(1002374, 300, 1, 3),
Array(1002375, 300, 1, 3),
Array(1002376, 300, 1, 3),
Array(1002377, 300, 1, 3),
Array(1002378, 300, 1, 3),
Array(1002379, 300, 1, 3),
Array(1002380, 300, 1, 3),
Array(1002381, 300, 1, 3),
Array(1002382, 300, 1, 3),
Array(1002383, 300, 1, 3),
Array(1002384, 300, 1, 3),
Array(1002385, 300, 1, 3),
Array(1002386, 300, 1, 3),
Array(1002387, 300, 1, 3),
Array(1002396, 300, 1, 3),
Array(1002397, 300, 1, 3),
Array(1002409, 300, 1, 3),
Array(1002410, 300, 1, 3),
Array(1002411, 300, 1, 3),
Array(1002412, 300, 1, 3),
Array(1002413, 300, 1, 3),
Array(1002414, 300, 1, 3),
Array(1002415, 300, 1, 3),
Array(1002416, 300, 1, 3),
Array(1002417, 300, 1, 3),
Array(1002420, 300, 1, 3),
Array(1002421, 300, 1, 3),
Array(1002422, 300, 1, 3),
Array(1002424, 300, 1, 3),
Array(1002423, 300, 1, 3),
Array(1002425, 300, 1, 3),
Array(1002426, 300, 1, 3),
Array(1002427, 300, 1, 3),
Array(1002428, 300, 1, 3),
Array(1002429, 300, 1, 3),
Array(1002431, 300, 1, 3),
Array(1002432, 300, 1, 3),
Array(1002433, 300, 1, 3),
Array(1002434, 300, 1, 3),
Array(1002435, 300, 1, 3),
Array(1002436, 300, 1, 3),
Array(1002437, 300, 1, 3),
Array(1002438, 300, 1, 3),
Array(1002439, 300, 1, 3),
Array(1002440, 300, 1, 3),
Array(1002441, 300, 1, 3),
Array(1002442, 300, 1, 3),
Array(1002443, 300, 1, 3),
Array(1002444, 300, 1, 3),
Array(1002445, 300, 1, 3),
Array(1002446, 300, 1, 3),
Array(1002447, 300, 1, 3),
Array(1002448, 300, 1, 3),
Array(1002449, 300, 1, 3),
Array(1002450, 300, 1, 3),
Array(1002451, 300, 1, 3),
Array(1002452, 300, 1, 3),
Array(1002453, 300, 1, 3),
Array(1002454, 300, 1, 3),
Array(1002455, 300, 1, 3),
Array(1002456, 300, 1, 3),
Array(1002457, 300, 1, 3),
Array(1002458, 300, 1, 3),
Array(1002459, 300, 1, 3),
Array(1002460, 300, 1, 3),
Array(1002461, 300, 1, 3),
Array(1002462, 300, 1, 3),
Array(1002463, 300, 1, 3),
Array(1002464, 300, 1, 3),
Array(1002465, 300, 1, 3),
Array(1002466, 300, 1, 3),
Array(1002467, 300, 1, 3),
Array(1002468, 300, 1, 3),
Array(1002469, 300, 1, 3),
Array(1002470, 300, 1, 3),
Array(1002471, 300, 1, 3),
Array(1002476, 300, 1, 3),
Array(1002477, 300, 1, 3),
Array(1002478, 300, 1, 3),
Array(1002479, 300, 1, 3),
Array(1002480, 300, 1, 3),
Array(1002481, 300, 1, 3),
Array(1002482, 300, 1, 3),
Array(1002492, 300, 1, 3),
Array(1002493, 300, 1, 3),
Array(1002498, 300, 1, 3),
Array(1002496, 300, 1, 3),
Array(1002499, 300, 1, 3),
Array(1002500, 300, 1, 3),
Array(1002501, 300, 1, 3),
Array(1002532, 300, 1, 3),
Array(1002534, 300, 1, 3),
Array(1002544, 300, 1, 3),
Array(1002551, 300, 1, 3),
Array(1002555, 300, 1, 3),
Array(1002556, 300, 1, 3),
Array(1002557, 300, 1, 3),
Array(1002558, 300, 1, 3),
Array(1001003, 300, 1, 3),  // 金·伊昆圖騰 // (無描述)
Array(1001004, 300, 1, 3),  // 銀·伊昆圖騰 // (無描述)
Array(1001005, 300, 1, 3),  // 銅·伊昆圖騰 // (無描述)
//Array(1202098, 600, 1, 3),  // 未知的便當圖騰 // 無任何屬性的空白圖騰.製作便當的話也許長老斯坦會根據美味來進行升級.
Array(1001006, 600, 1, 3),  // 深藍色便當圖騰 // 升級1次的圖騰.
Array(1001007, 300, 1, 3),  // 紫色便當圖騰 // 升級2次的圖騰.
Array(1001008, 300, 1, 3),  // 綠色便當圖騰 // 升級3次的圖騰.
Array(1001009, 300, 1, 3), // 紅色便當圖騰 // 升級4次的圖騰.
Array(1001010, 300, 1, 3),  // 藍色便當圖騰 // 升級5次的圖騰.
Array(1001011, 300, 1, 3),  // 黃色便當圖騰 // 升級6次的圖騰.
Array(1001012, 300, 1, 3),  // 橘黃色便當圖騰 // 升級7次的圖騰.
Array(1001013, 300, 1, 3),  // 真正的便當圖騰 // 升級8次的圖騰.
Array(1001014, 300, 1, 3),  // 斯坦的美味便當圖騰 // 這是受到感動的長老斯坦所給予,裝滿祝福的最終版美味圖騰.
Array(1001015, 300, 1, 3),  // 真深藍色便當圖騰 // 升級1次的圖騰.
Array(1001016, 300, 1, 3),  // 真紫色便當圖騰 // 升級2次的圖騰.
Array(1001017, 300, 1, 3),  // 真綠色便當圖騰 // 升級3次的圖騰.
Array(1001018, 300, 1, 3),  // 真紅色便當圖騰 // 升級4次的圖騰.
Array(1001019, 300, 1, 3),  // 真藍色便當圖騰 // 升級5次的圖騰.
Array(1001020, 300, 1, 3),  // 真黃色便當圖騰 // 升級6次的圖騰.
Array(1001021, 300, 1, 3),  // 真橘黃色便當圖騰 // 升級7次的圖騰.
Array(1001022, 300, 1, 3),  // 真正的便當圖騰 // 升級8次的圖騰.
Array(1001023, 300, 1, 3),  // 王魔女圖騰 // 表現出班主任王美女真正恐怖之處的圖騰
Array(1001026, 300, 1, 3),  // 王美女圖騰 // 表現出班主任王美女深藏不露之美的圖騰
Array(1001027, 300, 1, 3),  // 王微笑圖騰 // 表現出班主任王美女多情一面的圖騰
Array(1001029, 300, 1, 3), // 粉色海豹靠墊, 10, 1, 3), // 是一款可愛的粉色海豹模樣的靠墊，靠在上面每10秒鐘HP恢復60。
Array(1001030, 300, 1, 3), // 藍色海豹靠墊, 10, 1, 3), // 是一款可愛的藍色海豹模樣的靠墊，靠在上面每10秒鐘HP恢復60。
Array(1001031, 300, 1, 3), // 榻榻凳, 10, 1, 3), // 有著心型靠墊的可愛的凳子．坐著的時候每10秒回復HP 20, MP 30
Array(1001032, 300, 1, 3), // 白色海豹靠墊, 10, 1, 3), // 是一款可愛的白色海豹模樣的靠墊，靠在上面每10秒鐘HP恢復50。
Array(1001033, 300, 1, 3), // 月亮彎, 10, 1, 3), // 每10秒鐘恢復HP&MP30，無法交換&交易.
Array(1001034, 300, 1, 3), // 黑色海豹靠墊, 10, 1, 3), // 是一款可愛的黑色海豹模樣的靠墊，靠在上面每10秒鐘HP恢復60。
Array(3010017, 300, 1, 3), // 金色海豹靠墊, 10, 1, 3), // 是一款可愛的金色海豹模樣的靠墊，靠在上面每10秒鐘HP恢復60。
Array(3010018, 300, 1, 3), // 椰子樹沙灘椅, 10, 1, 3), // 放置在納希沙漠涼爽的椰子樹樹蔭下的沙灘椅。坐下時，每10秒中，恢復HP 40, MP 20。
Array(3010029, 300, 1, 3), // 藍環凳, 10, 1, 3), // 閃耀著藍色光芒的圓環凳子
Array(3010030, 300, 1, 3), // 黑環凳, 10, 1, 3), // 閃耀著黑色光芒的圓環凳子
Array(3010031, 300, 1, 3), // 紅環凳, 10, 1, 3), // 閃耀著紅色光芒的圓環凳子
Array(3010032, 300, 1, 3), // 黃環凳, 10, 1, 3), // 閃耀著黃色光芒的圓環凳子
Array(3010033, 300, 1, 3), // 綠環凳, 10, 1, 3), // 閃耀著綠色光芒的圓環凳子
Array(3010039, 300, 1, 3), // 黑色海狗靠墊, 10, 1, 3), // 是一款可愛的黑色海狗模樣的靠墊，靠在上面每10秒鐘HP恢復60。
Array(3010046, 300, 1, 3), // 紅龍椅, 10, 1, 3), // 與紅龍一起休息,每10秒可恢復HP 60.
Array(3010047, 300, 1, 3), // 藍龍椅, 10, 1, 3), // 與藍龍一起休息,每10秒可恢復MP 60.
Array(3010181, 300, 1, 3), // MP椅子 , 10, 1, 3), // 坐在上面可以感受補MP的快感，每10秒鐘可恢復MP50
Array(3010406, 300, 1, 3), // 迷你神獸椅子, 10, 1, 3), // 坐在迷你神獸椅子上，每10秒恢復HP50, MP50。
Array(3010691, 300, 1, 3), // 粉色海豹椅子, 10, 1, 3), // 可愛的粉色海豹椅子。每10秒，HP和MP各恢復50。
Array(3010692, 300, 1, 3), // 藍色海豹椅子, 10, 1, 3), // 可愛的藍色海豹椅子。每10秒，HP和MP各恢復50。
Array(
3010693, 350, 1, 3)
        );

var itemList4 = Array(
Array(
3010694, 350, 1, 3), // 黑色海豹椅子, 10, 1, 3), // 可愛的黑色海豹椅子。每10秒，HP和MP各恢復50。
Array(
3010055, 50, 1, 3), // 冰雪糕丸子椅, 10, 1, 3), // 可以坐在上面邊休息邊吃冰雪糕丸子的椅子。休息時，每10秒HP恢復30，MP恢復30。
Array(
3010057, 50, 1, 3), // 血色玫瑰, 10, 1, 3), // 坐在上面會有彷彿成了世界的主宰者的感覺.每10秒鐘恢復MP 60.  
Array(
3010058, 50, 1, 3), // 世界末日, 10, 1, 3), // 坐在上面會有彷彿看到世界末日的感覺.每10秒鐘恢復HP 60.  
Array(
3010059, 50, 1, 3), // 甜甜的零食王座, 10, 1, 3), // 由巧克力、棒棒糖、蛋糕、餅乾棒組成的王座，香香甜甜的誘惑擋也擋不住！坐在上面每10秒恢復HP/MP各30.
Array(
3010060, 3, 1, 3), // 初心凳, 3, 1, 3), // 坐在上面有莫名的成就感.,每10秒鐘可恢復HP 50.
Array(
3010061, 3, 1, 3), // 楓樹下, 3, 1, 3), // 紀念楓之谷週年慶製作的白色楓葉椅子。 坐下時每 10秒恢復 HP 35、MP 10。
Array(
3010062, 3, 1, 3), // 竹凳, 3, 1, 3), // 坐在上面時每10秒可以恢復一定HP的竹凳。由裡恩島上生長的竹子製作而成，非常結實。
Array(
3010063, 3, 1, 3), // 月亮星星抱枕椅, 3, 1, 3), // 可愛的月亮和星星樣子的抱枕。每10秒恢復60HP。
Array(
3010064, 3, 1, 3), // 棕色砂兔抱枕椅, 3, 1, 3), // 靠著很可愛的棕色砂兔每10秒恢復60HP。
Array(
3010065, 3, 1, 3), // 粉紅海灘遮陽椅, 3, 1, 3), // 讓人想起涼快的海的粉紅海灘遮陽椅。使用後每10秒恢復60HP。
Array(
3010066, 3, 1, 3), // 深藍色絨毛沙發, 3, 1, 3), // 高級深藍色絨毛沙發。使用後每10秒恢復60HP。
Array(
3010067, 3, 1, 3), // 紅色設計師椅, 3, 1, 3), // 熱情紅色的設計師椅。使用後每10秒恢復60HP。
Array(
3010068, 3, 1, 3), // 露水椅子, 3, 1, 3), // 每10秒鐘恢復HP,MP 50.
Array(
3010069, 3, 1, 3), // 大黃風, 3, 1, 3), // 傳說中可以變形的機器人!坐在上面可恢復HP 50,MP 30.
Array(
1040000, 3, 1, 3), // 巨無霸皮卡啾, 3, 1, 3), // 從時間神殿中溜出來的淘氣的皮卡啾,與它在一起可恢復HP 50,MP 30.
Array(
3010071, 3, 1, 3), // 神獸椅, 3, 1, 3), // 依偎在神獸懷中休息每10秒鐘恢復HP,MP 50.  
Array(
3010073, 3, 1, 3), // baby皮卡啾, 3, 1, 3), // 從時間神殿中溜出來的淘氣的皮卡啾,與它在一起可恢復HP 50,MP 30.
Array(
3010075, 3, 1, 3), // 我為音樂狂, 3, 1, 3), // 玩家#c龍騎學法師#設計的凳子. 坐在上面可以聽到全世界的美妙樂章.每10秒鐘恢復HP 50.
Array(
3010077, 3, 1, 3), // 貓頭鷹椅子, 3, 1, 3), // 關進鳥籠的滋味如何?\n每10秒鐘恢復HP和MP各50。
Array(
3010078, 3, 1, 3), // 大熊貓椅子, 3, 1, 3), // 依偎在國寶大熊貓的懷抱，很暖和很開心。每10秒可恢復HP15。
Array(
3010079, 3, 1, 3), // 肥貓貓椅子, 3, 1, 3), // 把整個人靠在肥貓毛茸茸軟軟的身上，好暖和好舒服啊。每10秒恢復HP 15。
Array(
3010080, 3, 1, 3), // 柿子樹鞦韆, 3, 1, 3), // 吊掛在掛滿成熟柿子的柿子樹上的鞦韆。
Array(
3010085, 3, 1, 3), // 鬼娃娃椅子, 3, 1, 3), // 使用椅子每10秒恢復MP35，HP40。
Array(
3010092, 3, 1, 3), // 魔女的飛掃把, 3, 1, 3), // 請抓住掃帚。弄不好它就會飛走。
Array(
3010093, 3, 1, 3), // 鮮美的火雞, 3, 1, 3), // 每10秒鐘恢復HP 50，MP30。
Array(
3010094, 3, 1, 3), // 漂漂豬椅子, 3, 1, 3), // 新老朋友都愛的漂漂豬,每10秒鐘恢復HP,MP各50。
Array(
3010095, 3, 1, 3), // 石頭人座椅, 3, 1, 3), // 坐在石頭人手造型的椅子上，感覺好像可以吸收石頭人的力量，每10秒HP和MP恢復 50。
Array(
3010096, 3, 1, 3), // 恐龍化石寶座, 3, 1, 3), // 坐在恐龍化石寶座上，每10秒HP和MP恢復 50。
Array(
3010097, 3, 1, 3), // 堅固的木椅, 3, 1, 3), // 坐上去每10秒鐘 HP就會恢復50的堅固木椅。由格裡德親手製作。
Array(
3010098, 3, 1, 3), // 電視宅人, 3, 1, 3), // 宅男奼女們的最愛，不過坐久了說不定會發胖哦(, 3, 1, 3), //_, 3, 1, 3), //)。\n坐在上面每10秒鐘恢復HP 60、MP30。
Array(
3010099, 3, 1, 3), // 北極熊椅子, 3, 1, 3), // 與北極熊一起休息,每10秒鐘恢復HP 50，MP 50。
Array(
3010100, 3, 1, 3), // 財神椅子, 3, 1, 3), // 恭喜發財!擁有財神椅子，財運滾滾來.
Array(
3010102, 3, 1, 3), // 花蘑菇充電椅, 3, 1, 3), //1階段, 3, 1, 3), // 坐在上面每10秒可恢復MP 60。
Array(
3010103, 3, 1, 3), // 花蘑菇充電椅, 3, 1, 3), //2階段 , 3, 1, 3), // 可愛海豹造型的藍色抱枕。10秒可恢復MP 60。
Array(
3010104, 3, 1, 3), // 花蘑菇充電椅, 3, 1, 3), //3階段, 3, 1, 3), // 坐在上面每10秒可恢復MP 60。
Array(
3010105, 3, 1, 3), // 藍色海豹抱枕椅, 3, 1, 3), // 可愛海豹造型的藍色抱枕。坐在上面每10秒可恢復MP 60。
Array(
3010106, 350, 1, 3), // 雪狼戰椅, 3, 1, 3), // 狂狼勇士最愛的雪狼。\n每10秒HP和MP各恢復50。
Array(
3010107, 3, 1, 3), // 龍龍的蛋殼椅, 3, 1, 3), // 坐在上面時，每10秒恢復HP的龍龍的蛋殼。是只有龍魔導士可以擁有的特殊椅子。
Array(
3010108, 3, 1, 3), // 幼龍鞦韆, 3, 1, 3), // 幼龍晃動的鞦韆椅。坐在上面，每10秒HP恢復40，MP恢復20。
Array(
3010109, 3, 1, 3), // 暖爐椅, 3, 1, 3), // 讓人感覺溫暖的椅子，使用後每10秒恢復HP 40、MP 20。
Array(
3010110, 3, 1, 3), // 舒適大白熊椅子, 3, 1, 3), // 抱著非常的溫暖，每10秒鐘回復HP、MP各50。
Array(
3010111, 3, 1, 3), // 虎虎生威, 3, 1, 3), // 王者最愛的椅子。坐在上面每10秒鐘可恢復HP50、MP30。
Array(
3010112, 3, 1, 3), // 情書櫃子, 3, 1, 3), // 堆滿情書的櫃子,適合送給戀人的椅子..\n每10秒鐘恢復HP 50.
Array(
3010113, 3, 1, 3), // 幽魂發條熊椅子, 3, 1, 3), // 使用後每10秒恢復HP 50。
Array(
3010114, 3, 1, 3), // 俘虜我吧！椅子, 3, 1, 3), // 使用後每10秒恢復HP 50。
Array(
3010115, 3, 1, 3), // 熊寶寶床, 3, 1, 3), // 放置著熊寶寶娃娃的溫暖床。躺在床上每10秒恢復HP 50、MP 50。
Array(
3010116, 3, 1, 3), // 搖滾之魂椅子, 3, 1, 3), // 坐在上面彷彿成了搖滾明星.\n每10秒鐘恢復HP60,MP30.
Array(
3010117, 3, 1, 3), // 魔法書椅子, 3, 1, 3), // 坐在漂浮的魔法書上面,每10秒鐘恢復HP50,MP30.
Array(
3010118, 3, 1, 3), // 糖果音符椅子, 3, 1, 3), // 跟著音符一起哼歌,坐在上面能莫名的開心起來,每10秒鐘恢復HP50,MP30.
Array(
3010119, 3, 1, 3), // 羊羊椅子, 3, 1, 3), // 坐在上面，每10秒鐘恢復HP50，MP30。
Array(
3010120, 3, 1, 3), // 彩蛋籃子, 3, 1, 3), // 籃子中塞滿五彩繽紛的彩蛋!\n每10秒鐘恢復HP40,MP40.
Array(
3010123, 3, 1, 3), // 夏日花朵, 3, 1, 3), // 盛開的夏日花朵,有陣陣香氣撲鼻而來.每10秒鐘恢復HP,MP各50。
Array(
1040001, 3, 1, 3), // 都納斯噴氣椅子, 3, 1, 3), // 超強BOSS都納斯熱愛的噴氣式椅子.\n每10秒鐘恢復HP40.
Array(
3010125, 3, 1, 3), // 尼貝隆戰艦椅, 3, 1, 3), // 坐在尼貝隆戰艦上霸氣十足.\n每10秒鐘恢復MP40.
Array(
3010126, 3, 1, 3), // 蝙蝠魔王座, 3, 1, 3), // 與可怕的蝙蝠魔為伍,坐在上面彷彿成為魔王.每10秒鐘恢復HP,MP各60。
Array(
3010127, 150, 1, 3), // 殘暴炎魔寶座, 3, 1, 3), // 象徵著楓之谷的BOSS殘暴炎魔,坐在上面威風百倍.每10秒鐘恢復HP80,MP50。
Array(
3010128, 150, 1, 3), // 黑龍王座, 3, 1, 3), // 象徵著楓之谷的BOSS黑暗龍王,代表了一種實力與威嚴.每10秒鐘恢復HP100,MP40。
Array(
3010129, 3, 1, 3), // 酋長寶座, 3, 1, 3), // 顯示出酋長的權威的椅子。休息時每10秒HP恢復50，MP恢復50。
Array(
3010130, 3, 1, 3), // 血色玫瑰, 3, 1, 3), // 可以聞到玫瑰香味的血色玫瑰椅子。休息時每10秒HP恢復50，MP恢復50。
Array(
3010131, 3, 1, 3), // 貪吃熊貓椅, 3, 1, 3), // 可愛但懶惰的吃著竹子的熊貓椅。休息時每10秒HP恢復50，MP恢復50。
Array(
3010132, 3, 1, 3), // 撒嬌喵咪椅, 3, 1, 3), // 瞇著臉的貓咪椅子。休息時每10秒HP恢復50，MP恢復50。
Array(
3010133, 3, 1, 3), // 帳篷椅, 3, 1, 3), // 充滿了野生情趣的帳篷椅。休息時每10秒HP恢復50，MP恢復50。
Array(
1040137, 3, 1, 3), // 楓葉紀念凳, 3, 1, 3), // 為了紀念楓之谷誕生而製作的白色椅子。坐在上面時，每10秒HP恢復35，MP恢復10。
Array(
1040002, 3, 1, 3), // 節日獨角獸椅子, 3, 1, 3), // 歐洲楓之谷玩家Lyonel設計的椅子.坐在上面可感受節日的喜慶氛圍.每10秒鐘恢復HP,MP各70.
Array(
3010136, 3, 1, 3), // 6週年怪物王座, 3, 1, 3), // 坐在上面時，每10秒鐘恢復HP60，MP60的6週年的王座。
Array(
3010137, 150, 1, 3), // 神龍椅子, 3, 1, 3), // 神龍化身的神聖的椅子。每10秒鐘恢復HP 150, MP 100.
Array(
3010138, 3, 1, 3), // 君主休憩椅, 3, 1, 3), // 偉大的君主，休息一下吧，每10秒可恢復HP50。
Array(
3010139, 3, 1, 3), // 私密空間, 3, 1, 3), // 坐在上面可享受最快樂的時光!! 每10秒恢復HP50.
Array(
3010140, 3, 1, 3), // 早日康復床, 3, 1, 3), // 躺在早日康復床,可以迅速治癒任何病.躺在床上每10秒鐘恢復HP100
Array(
3010141, 3, 1, 3), // 蛋糕椅子, 3, 1, 3), // 蛋糕師精心製作的蛋糕. 坐在上面每10秒鐘恢復HP,MP各30.
Array(
3010142, 3, 1, 3), // 水族館椅子, 3, 1, 3), // 可以觀賞魚的水族館椅子。每10秒恢復30HP和30MP。
Array(
3010144, 3, 1, 3), // 七夕椅子, 3, 1, 3), // 七夕情人節戀人之間贈送的椅子. 每10秒鐘恢復HP 10 ,MP 10
Array(
3010145, 100, 1, 3), // 週年慶水晶楓葉椅子, 3, 1, 3), // 坐在上面時，每10秒恢復HP的楓之谷週年慶水晶楓葉椅子。
Array(
3010146, 100, 1, 3), // 週年慶水晶楓葉椅子, 3, 1, 3), // 坐在上面時，每10秒恢復HP的楓之谷週年慶水晶楓葉椅子。
Array(
3010147, 3, 1, 3), // 龍龍的蛋殼椅, 3, 1, 3), // 坐在上面時，每10秒可以恢復HP的龍龍的蛋殼。是只有龍魔導士可以擁有的特殊椅子。
Array(
3010149, 3, 1, 3), // 貓咪風扇椅, 3, 1, 3), // 風扇下面躺著懶洋洋的貓咪,無比的愜意. 每10秒鐘恢復HP 10, MP 10 
Array(
3010151, 3, 1, 3), // 無人島椅子, 3, 1, 3), // 愜意的無人島生活從此開始. 每10秒鐘恢復HP,MP各50.
Array(
3010152, 3, 1, 3), // 黃三角帳篷椅, 3, 1, 3), // 支起帳篷，讓野營變得更有趣。每10秒恢復HP、MP各40.
Array(
3010154, 3, 1, 3), // 機械椅子, 3, 1, 3), // 坐在上面時，每10秒可以恢復一定量HP的機械椅子。
Array(
3010155, 3, 1, 3), // 影武者的貓頭鷹椅子, 3, 1, 3), // 每10秒鐘恢復HP和MP各50。
Array(
3010156, 3, 1, 3), // 浮游飛行器, 3, 1, 3), // 外星來訪者所乘坐的飛行器，可以懸浮在空中。每10秒恢復HP、MP各50.
Array(
3010157, 3, 1, 3), // 公會椅子, 3, 1, 3), // 在烤好的米糕上刷上糖稀後做成的美味的韓果。交給楓之谷運營員，說不定會有什麼好事發生。
Array(
3010161, 3, 1, 3), // 鼠鼠椅 , 3, 1, 3), // 坐在軟軟胖胖的鼠鼠身上，每10秒會恢復HP和MP各20。 
Array(
3010162, 3, 1, 3), // 果月椅子, 3, 1, 3), // 坐在果月椅子,每10秒鐘HP恢復50,MP恢復30.
Array(
3010163, 3, 1, 3), // 滿月椅 , 3, 1, 3), // 象徵中秋節滿月的椅子。 
Array(
3010164, 3, 1, 3), // 滿月椅(永久) , 3, 1, 3), // 象徵中秋節滿月的椅子。 
Array(
3010166, 3, 1, 3), // 影武同門, 3, 1, 3), // 對面的延友看過來看過來~ 每10秒鐘恢復HP,MP各150.
Array(
1040003, 3, 1, 3), // 豪華鮮奶蛋糕, 3, 1, 3), // 用料十足的華麗麗鮮奶蛋糕，HOLD住豪華大場面。坐在上面每10秒恢復HP/MP 30。
Array(
3010168, 3, 1, 3), // 友誼萬歲椅子, 3, 1, 3), // 朋友多,不孤單,友誼萬歲椅子! 每10秒鐘恢復HP,MP各30.
Array(
3010169, 3, 1, 3), // 紙箱裡「求領養」, 3, 1, 3), // 剛出生的小貓咪和我，裝在紙箱「求領養」，讓我們感到幸福吧。每10秒恢復40HP和40MP。
Array(
3010170, 3, 1, 3) // 雪夜椅子, 3, 1, 3), // 冬天的夜晚,飄落雪. 每10秒鐘恢復HP,MP各30.
        );

var itemList5 = Array(
Array(
3010171, 3, 1, 3), // 過來抱抱椅, 3, 1, 3), // 快過來讓我抱抱，免費的溫暖擁抱噢。每10秒恢復30HP和30MP。
Array(
3010172, 3, 1, 3), // 星空椅子, 3, 1, 3), // 傳說在星空下許願,願望容易實現噢.每10秒鐘恢復HP,MP各20.
Array(
3010173, 3, 1, 3), // 萬聖節塔羅椅子, 3, 1, 3), // 萬聖節玩南瓜,玩塔羅牌, 據說塔羅牌可遇見未來.每10秒鐘恢復HP,MP各30.
Array(
3010174, 3, 1, 3), // 女巫煉藥椅, 3, 1, 3), // 正在煉製可怕的女巫魔藥，小心喲。每10秒恢復50HP和50MP。
Array(
3010175, 3, 1, 3), // 名畫家椅子, 3, 1, 3), // 坐在上面彷彿成了藝術家,我也要成為名畫家! 每10秒鐘恢復HP,MP各40.
Array(
3010177, 3, 1, 3), // 手柄座椅, 3, 1, 3), // 適合坐下進行遊戲的手柄型椅子，每10秒會恢復HP和MP各40。
Array(
3010179, 3, 1, 3), // 燕尾服貓咪椅, 3, 1, 3), // 與穿著燕尾服的可愛貓咪共進晚餐,每10秒鐘可恢復HP,MP50
Array(
3010180, 50, 1, 3), // HP椅子, 3, 1, 3), // 坐在上面可以感受補HP的快感，每10秒鐘可恢復HP50
Array(
3010181, 50, 1, 3), // MP椅子 , 3, 1, 3), // 坐在上面可以感受補MP的快感，每10秒鐘可恢復MP50
Array(
3010182, 3, 1, 3), // 兔子公會椅, 3, 1, 3), // 與兔子公會在一起無比的溫馨.每10秒鐘HP,MP各恢復50.
Array(
3010183, 3, 1, 3), // 胡蘿蔔椅子, 3, 1, 3), // 兔子喜歡的胡蘿蔔,胡蘿蔔富有豐富的維生素A噢.每10秒鐘恢復HP,MP各50.
Array(
3010184, 3, 1, 3), // 冰釣椅子, 3, 1, 3), // 在寒冷之地鑿個冰窟來垂釣。坐在上面每10秒恢復HP 50.
Array(
3010185, 3, 1, 3), // 小夥伴皮卡啾, 3, 1, 3), // 開心的皮卡啾對坐在沙發上的你，在施展怎樣的閃光魔法呢？坐在上面每10秒恢復HP/MP 100。
Array(
3010186, 3, 1, 3), // 兔子椅子, 3, 1, 3), // 坐在上面，每10秒HP恢復100，MP恢復50的兔子椅子。
Array(
3010187, 3, 1, 3), // 過來抱抱椅, 3, 1, 3), // 快過來讓我抱抱，免費的溫暖擁抱噢。每10秒恢復30HP和30MP。
Array(
1040004, 50, 1, 3), // 凡雷恩椅子, 3, 1, 3), // 坐在上面時，可以每10秒恢復HP30的凡雷恩椅子。
Array(
3010189, 3, 1, 3), // 克裡塞椅子, 3, 1, 3), // 傳說中的克裡塞的椅子，坐在上面每10秒鐘恢復HP30
Array(
3010191, 350, 1, 3), // 愛情椅子, 3, 1, 3), // 坐在上面時，可以每10秒恢復HP和MP的愛情椅子。和配偶面對面坐在一起，可以組成一個紅心。
Array(
3010194, 3, 1, 3), // 野營篝火椅子, 3, 1, 3), // 在外面野營時，用來抵禦寒冷，保護自己不受野獸傷害的篝火。可以感覺到野營的情趣。\n#c每10秒HP恢復60，MP恢復30。#
Array(
3010195, 3, 1, 3), // 無價之寶椅子, 3, 1, 3), // 在寶庫中發現的椅子，坐在椅子上，每10秒恢復HP，MP各50。
Array(
3010196, 3, 1, 3), // 泡泡浴缸椅, 3, 1, 3), // 清涼好玩的泡泡浴。每10秒會恢復HP和MP各15。
Array(
3010197, 150, 1, 3), // 英雄的椅子, 3, 1, 3), //狂狼勇士, 3, 1, 3), // 展現英雄的風采，不解釋。每10秒會恢復HP和MP各50。
Array(
3010199, 250, 1, 3), // 雪房子, 3, 1, 3), // 南極考察隊空運過來的用冰雪製作的小房子.每10秒鐘恢復HP 20.
Array(
3010200, 3, 1, 3), // 英雄的椅子, 3, 1, 3), //龍魔導士, 3, 1, 3), // 展現英雄的風采，不解釋。每10秒會恢復HP和MP各50。
Array(
3010201, 3, 1, 3), // 英雄的椅子, 3, 1, 3), //影武者, 3, 1, 3), // 展現英雄的風采，不解釋。每10秒會恢復HP和MP各50。
Array(
3010202, 3, 1, 3), // 傳說楓葉下……, 3, 1, 3), // 為了紀念傳說嘉年華而製作的白色椅子。坐在上面，每10秒HP恢復35，MP恢復10。
Array(
3010203, 3, 1, 3), // 粉紅沙灘遮陽傘, 3, 1, 3), // 讓人想起涼爽的大海的粉紅色沙灘遮陽傘。坐在上面，每10秒HP恢復60。
Array(
3010205, 3, 1, 3), // 古老錄音機椅子, 3, 1, 3), // 好像可以聽到甜美音樂的錄音機椅子。每10秒HP恢復100，MP恢復50。
Array(
3010206, 3, 1, 3), // 夢想畫家椅子, 3, 1, 3), // 讓人充滿了創作熱情的帶可愛木製畫架的椅子。每10秒HP恢復100，MP恢復50。
Array(
3010207, 3, 1, 3), // 喧鬧好友椅子, 3, 1, 3), // 讓人想和童年好友一起嬉戲打鬧的喧鬧好友椅子。每10秒HP恢復100，MP恢復50。
Array(
3010208, 3, 1, 3), // 黑貓椅子, 3, 1, 3), // 黑貓管家會送上美味茶點的可愛椅子。每10秒HP恢復100，MP恢復50。
Array(
3010209, 3, 1, 3), // 香草冰淇淋月餅椅子, 3, 1, 3), // 晶瑩剔透的香草口味冰淇淋月餅，好好看捨不得吃呀，偷偷咬一口好了。中秋節快樂！\n每10秒恢復HP、MP各30
Array(
3010210, 3, 1, 3), // 草莓冰淇淋月餅椅子, 3, 1, 3), // 晶瑩剔透的草莓口味冰淇淋月餅，好好看捨不得吃呀，偷偷咬一口好了。中秋節快樂！\n每10秒恢復HP、MP各30
Array(
3010211, 3, 1, 3), // 精靈王座, 3, 1, 3), // 為精靈之王製作的椅子。每10秒HP恢復100，MP恢復50。
Array(
3010212, 3, 1, 3), // 藏獒椅子, 3, 1, 3), // 要是敢惹藏獒的主人，你可傷不起啊！每10秒恢復HP、MP各50
Array(
3010215, 150, 1, 3), // 狂狼勇士守護者椅子, 3, 1, 3), // 為守護過去的狂狼勇士製作的椅子。
Array(
3010216, 150, 1, 3), // 龍魔導士守護者椅子, 3, 1, 3), // 為守護過去的龍魔導士製作的椅子。
Array(
3010217, 3, 1, 3), // 香橙果凍布丁, 3, 1, 3), // 晶瑩剔透、爽滑誘人的香橙味果凍布丁，好想咬一口。坐在上面扭來扭去，每10秒恢復HP 50。
Array(
3010218, 3, 1, 3), // 喬克惡靈椅子, 3, 1, 3), // 十字旅團中邪惡的喬克惡靈附著的椅子。坐在上面每10秒恢復HP 50.
Array(
3010219, 3, 1, 3), // 綿羊酋長椅子, 3, 1, 3), // 馴服了有惡魔之力的綿羊酋長。坐在上面每10秒恢復HP 50.
Array(
3010220, 3, 1, 3), // 我愛蛋糕椅子, 3, 1, 3), // 蛋糕大戰餡餅特別版紀念椅子——我愛蛋糕噢，親。坐上去每10秒恢復HP、MP各60。
Array(
3010221, 3, 1, 3), // 我愛餡餅椅子, 3, 1, 3), // 蛋糕大戰餡餅特別版紀念椅子——我愛餡餅噢，親。坐上去每10秒恢復HP、MP各60。
Array(
3010222, 3, 1, 3), // 兔兔伴讀椅子, 3, 1, 3), // 和愛讀書的眼鏡兔一起看書。
Array(
3010223, 3, 1, 3), // 狗狗好乖椅, 3, 1, 3), // 靠著很有安全感毛茸茸的大狗狗，摸摸很乖很可愛的小狗狗，生活好溫馨。每10秒恢復HP 40，MP 20。
Array(
3010224, 3, 1, 3), // 年糕冰淇淋椅子, 3, 1, 3), // 可以坐下休息的年糕冰激凌椅子。休息時，每10秒HP恢復30，MP恢復30。
Array(
1040005, 3, 1, 3), // 皮卡啾椅子, 3, 1, 3), // 經過馴養，不會傷害人類的皮卡啾椅子。坐下時會感到非常溫暖。每10秒HP恢復60。
Array(
3010226, 3, 1, 3), // 月光仙子椅子, 3, 1, 3), // 與月光仙子嫦娥一同看著人間，每10秒恢復50 HP。
Array(
3010257, 3, 1, 3), // 楓樹下……, 3, 1, 3), // 為了紀念楓之谷秋季運動會而製作的椅子。坐下時，每10秒HP恢復35，MP恢復10。
Array(
3010279, 3, 1, 3), // 鬼節南瓜椅子, 3, 1, 3), // 為了紀念鬼節而製作的椅子。休息時，每10秒HP恢復50。
Array(
3010280, 3, 1, 3), // 水果椅子, 3, 1, 3), // 水果椅子。每十秒恢復40 HP。
Array(
3010281, 3, 1, 3), // 猴子囚籠, 3, 1, 3), // 捉猴子的時候不小心把自己也關進去了，真悲劇呀！每10秒恢復50 HP。
Array(
3010282, 3, 1, 3), // 送子仙鶴椅, 3, 1, 3), // 彷彿回到出生時的期待，每10秒會恢復HP和MP各50。
Array(
3010283, 3, 1, 3), // 飛毯椅, 3, 1, 3), // 坐上飛毯飄啊飄，每10秒會恢復HP和MP各50。
Array(
3010286, 3, 1, 3), // 諾特勒斯椅子, 3, 1, 3), // 諾特勒斯椅子。每十秒恢復50HP。
Array(
3010287, 3, 1, 3), // 精靈王座, 3, 1, 3), // 精靈王演奏的豎琴是能發出最高的音，坐在豎琴的椅子上時可以每10秒恢復50HP。
Array(
3010288, 3, 1, 3), // 珍珠蚌椅子, 3, 1, 3), // 孕育了極品珍珠的紫青扇貝椅子。每10秒會恢復HP和MP各50。
Array(
3010289, 3, 1, 3), // 老人家讀童話椅子, 3, 1, 3), // 慈祥的老奶奶給你讀童話書，但是老奶奶疲倦了#c偶爾會變成其他人#！！每10秒恢復50HP、50MP。
Array(
3010290, 3, 1, 3), // 惡魔軍團椅, 3, 1, 3), // 惡魔軍團椅。坐下時會每10秒恢復50HP。
Array(
3010291, 3, 1, 3), // 早日康復床（可交易）, 3, 1, 3), // 躺在早日康復床,可以迅速治癒任何病.躺在床上每10秒鐘恢復HP100
Array(
3010292, 50, 1, 3), // 暖爐椅（可交易）, 3, 1, 3), // 讓人感覺溫暖的椅子，使用後每10秒恢復HP 40、MP 20。
Array(
3010293, 3, 1, 3), // 喬克惡靈椅子（可交易）, 3, 1, 3), // 十字旅團中邪惡的喬克惡靈附著的椅子。坐在上面每10秒恢復HP 50.
Array(
3010294, 3, 1, 3), // 黑色海豹靠墊（可交易）, 3, 1, 3), // 是一款可愛的黑色海豹模樣的靠墊，靠在上面每10秒鐘HP恢復60。
Array(
3010295, 3, 1, 3), // 金色海豹靠墊（可交易）, 3, 1, 3), // 是一款可愛的金色海豹模樣的靠墊，靠在上面每10秒鐘HP恢復60。
Array(
3010296, 3, 1, 3), // 甜蜜的聖誕椅子, 3, 1, 3), // 坐下時會每10秒恢復50HP
Array(
3010297, 3, 1, 3), // 水晶月亮, 3, 1, 3), // 怪盜幻影專用椅子，坐下去後每10秒都能恢復HP。
Array(
3010298, 3, 1, 3), // 白熊抱抱椅子, 3, 1, 3), // 感覺像被熱情的熊大叔抱在懷裡一樣溫暖的椅子。坐在上面時，每10秒HP恢復40，MP恢復20。
Array(
3010299, 3, 1, 3), // 小幼龍椅子, 3, 1, 3), // 剛從蛋裡出生的恐龍，每10秒恢復50HP、MP
Array(
3010300, 250, 1, 3), // 橙色HP藥水椅子, 3, 1, 3), // 坐在上面可以感受補HP的快感，每10秒鐘可恢復HP50。
Array(
3010301, 250, 1, 3), // 高級HP藥水椅子, 3, 1, 3), // 坐在上面可以感受補HP的快感，每10秒鐘可恢復HP50。
Array(
3010302, 3, 1, 3), // 超級藥水椅子, 3, 1, 3), // 坐在上面可以感受補HP/MP的快感，每10秒鐘可恢復HP、MP各50。
Array(
3010303, 3, 1, 3), // 加肥抱抱椅, 3, 1, 3), // 加肥貓要給你一個大大的免費溫暖擁抱噢。每10秒恢復100HP和50MP。
Array(
3010304, 3, 1, 3), // 惡魔綿羊椅子, 3, 1, 3), // 白色特別版惡魔之力的綿羊。坐在上面每10秒恢復HP MP各50。
Array(
3010305, 3, 1, 3), // 玫紅手柄座椅, 3, 1, 3), // 限量版遊戲的手柄型椅子，女玩家的最愛。每10秒會恢復HP和MP各50。
Array(
3010306, 3, 1, 3), // 生如夏花椅子, 3, 1, 3), // 夏日花朵升級版椅子，開出更美麗更絢麗的花朵。每10秒會恢復HP和MP各50。
Array(
1040006, 3, 1, 3), // 皮卡啾椅子, 3, 1, 3), // 經過馴養，對人們友好的皮卡啾的椅子。坐在上面感覺非常溫暖。每10秒HP恢復60。
Array(
3010308, 3, 1, 3), // 四葉草, 3, 1, 3), // 四葉草，代表幸運與幸福。坐在上面每10秒恢復HP200、MP200.
Array(
3010311, 3, 1, 3), // 黑龍椅子, 3, 1, 3), // 迎接龍年而特別製作的椅子。
Array(
3010313, 3, 1, 3), // 粉色殘暴炎魔椅子, 3, 1, 3), // 一個模仿粉色殘暴炎魔的椅子，是火山地區居民崇拜的怪物。坐在椅子上，你能感覺到粉色殘暴炎魔的力量。 每10秒恢復，80HP和50MP。
Array(
3010314, 3, 1, 3), // 紅絲帶月妙靠墊, 3, 1, 3), // 坐在靠墊上，可以觀看戴著紅絲帶的可愛月妙進行表演。
Array(
3010315, 3, 1, 3), // 青絲帶月妙靠墊, 3, 1, 3), // 坐在靠墊上，可以觀看戴著青絲帶的可愛月妙進行表演。
Array(
3010316, 3, 1, 3), // 扇子舞月妙靠墊, 3, 1, 3), // 坐在靠墊上，可以觀看拿著扇子的月妙在繩子上進行表演。
Array(
3010317, 3, 1, 3), // 太平蕭月妙靠墊, 3, 1, 3), // 坐在靠墊上，可以觀看月妙演奏音樂。
Array(
3010318, 3, 1, 3), // 噢我的女皇, 3, 1, 3), // 能感受到女皇的強大人氣的椅子。坐下每10秒恢復100HP、50MP。
Array(
3010319, 3, 1, 3), // 小熊床, 3, 1, 3), // 帶小熊玩偶的溫暖的床。躺在床上時，每10秒HP恢復50，MP恢復50。
Array(
3010320, 3, 1, 3), // 老奶奶讀童話椅子, 3, 1, 3), // 慈祥的老奶奶給你讀童話書，坐著的時候可以10秒恢復100HP、50MP。
Array(
3010321, 3, 1, 3), // 阿卡伊農讀童話椅子, 3, 1, 3), // 恐怖的阿卡伊農老爺爺給你讀童話書，坐著的時候可以10秒恢復100HP。
Array(
3010322, 3, 1, 3), // 情人節愛情椅子, 3, 1, 3), // 專為情人節製作的椅子。坐下去後每10秒都能恢復HP40,MP20。和心愛的人面對面坐著，可以完成紅心。
Array(
3010354, 3, 1, 3), // 與克裡姆享受下午茶, 3, 1, 3), // 可以和女僕克裡姆享受甜蜜的下午茶時間的椅子。每10秒都能恢復HP100, MP50。
Array(
1040137, 3, 1, 3), // 外星鑽機椅子, 3, 1, 3), // 坐在小型外星鑽機椅子裡異常的舒服啊，雖然這椅子是為了外星人的屁股設計的。每10秒恢復HP和MP各50.
Array(
3010356, 3, 1, 3), // 溫馨荷花池, 3, 1, 3), // 可以休息的溫馨的荷花池，休息時每10秒恢復20HP、20MP。
Array(
3010357, 3, 1, 3), // 美容椅子, 3, 1, 3), // 是個美容椅子，做個SPA，可以讓你的皮膚潤滑起來。每10秒恢復20HP、20MP。
Array(
3010360, 3, 1, 3), // 光之騎士椅子, 3, 1, 3), // 給即將成為光之騎士準備的椅子。坐下去後每10秒都能恢復HP50, MP50。
Array(
3010361, 3, 1, 3), // 購物小推車椅子, 3, 1, 3), // 裝滿商品的購物小推車。在購物小推車中休息時，每10秒恢復50HP、50MP。
Array(
3010362, 3, 1, 3), // 彩虹椅子, 3, 1, 3), // 小巧可愛的彩虹。在彩虹上面休息時，每10秒恢復50HP、50MP。
Array(
3010364, 3, 1, 3), // 與謝拉享受下午茶, 3, 1, 3), // 可以與謝拉王子享受下午茶的椅子。每10秒都能恢復HP100, MP50。
Array(
3010365, 3, 1, 3), // 休彼德蔓的古代石掌椅子, 3, 1, 3), // 可以通過2012年遺物大賽獲得的休彼德蔓古代石掌椅。雖然不太舒服，但石頭形狀有種似曾相識的感覺啊。坐下每10秒恢復50HP、50MP。
Array(
3010368, 3, 1, 3), // 北極熊椅子, 3, 1, 3), // 能讓人感覺到像在北極熊懷抱裡的椅子。坐下後每10秒恢復HP 40, MP 20。
Array(
3010369, 3, 1, 3) // 老海盜椅子, 3, 1, 3), // 感覺自己成為老海盜人質的椅子。坐下後每10秒恢復HP 40, MP 20。
        );

var itemList6 = Array(
Array(
3010370, 3, 1, 3), // 寶石楓葉椅子, 3, 1, 3), // 用寶石做成的閃亮楓葉椅子。坐下後每10秒恢復HP 40, MP 20。
Array(
3010371, 3, 1, 3), // 楓葉紀念凳, 3, 1, 3), // 為紀念楓之谷的第九個生日而製作的白色凳子。坐下後每10秒恢復HP 40, MP 20。
Array(
1040138, 3, 1, 3), // 雲朵洗手間椅子, 3, 1, 3), // 豪華裝修的洗手間，配備了所有舒適設施。每10秒恢復HP 1, MP 50。
Array(
3010374, 3, 1, 3), // 閃耀星星之夜椅子, 3, 1, 3), // 可以在寧靜的星空休息的椅子。每10秒恢復HP 1, MP 50。
Array(
3010375, 3, 1, 3), // 奧妙的超級藥水椅子, 3, 1, 3), // 顏色奧妙的超級藥水椅子。可以比其他藥水椅子"稍微"更快恢復HP和MP。每10秒恢復HP110, MP60。
Array(
3010376, 3, 1, 3), // 熱情的紅色藥水椅子, 3, 1, 3), // 感覺可以比其他椅子更快恢復HP的艷紅色藥水。每10秒恢復HP110, MP50。
Array(
3010377, 3, 1, 3), // 新鮮的藍色藥水椅子, 3, 1, 3), // 感覺可以比其他椅子更快恢復MP的新鮮藍色藥水。每10秒恢復HP 1, MP 50。
Array(
3010383, 3, 1, 3), // 冒險家的旗幟椅子, 3, 1, 3), // 象徵冒險家的旗幟和椅子。每10秒HP/MP各恢復50。
Array(
3010390, 3, 1, 3), // 高級冒險家旗幟椅子, 3, 1, 3), // 象徵冒險家的旗幟和椅子。每10秒HP/MP各恢復50。
Array(
3010397, 3, 1, 3), // 高級冒險家旗幟椅子, 3, 1, 3), // 象徵冒險家的旗幟和椅子。每10秒HP/MP各恢復50。
Array(
3010400, 3, 1, 3), // 水晶花園椅, 3, 1, 3), // 模仿幻影的飛船——水晶花園號的豪華貴族椅子。\n每10秒恢復60HP,30MP。
Array(
3010401, 3, 1, 3), // 幻影卡牌椅, 3, 1, 3), // 象徵怪盜的神秘椅子。\n每10秒恢復60HP,30MP。
Array(
3010402, 3, 1, 3), // 生日派對椅, 3, 1, 3), // 很想知道惡魔殺手坐在椅子上會是什麼表情。每10秒恢復HP 1, MP 50。
Array(
3010403, 3, 1, 3), // 埃歐雷的小音樂會, 3, 1, 3), // 可以享受精靈女王精靈遊俠的特殊演奏的椅子。每10秒恢復HP 1, MP 50。
Array(
3010404, 3, 1, 3), // 希拉的梳妝椅, 3, 1, 3), // 可以和希拉一起變美的椅子。每10秒恢復HP 1, MP 50。
Array(3010405, 3, 1, 3), // 擺鐘椅子, 3, 1, 3), // 坐在擺鐘椅子上，每10秒恢復HP50, MP50。
Array(3010406, 3, 1, 3), // 迷你神獸椅子, 3, 1, 3), // 坐在迷你神獸椅子上，每10秒恢復HP50, MP50。
Array(3010421, 3, 1, 3), // 發財椅, 3, 1, 3), // 即便短暫，也去感受下大款們的感覺吧！每10秒恢復HP100點，MP50點。
Array(3010586, 3, 1, 3), // 發財椅, 3, 1, 3), // 即便短暫，也去感受下大款們的感覺吧！每10秒恢復HP100點，MP50點。
Array(3010423, 3, 1, 3), // 蘑菇朋友椅子, 3, 1, 3), // 又可愛又好吃，去和蘑菇交朋友吧。每10秒恢復HP100點，MP50點。
Array(3010505, 3, 1, 3), // 和殺人鯨一起看棒球, 3, 1, 3), // 和殺人鯨、史烏一起愉快的玩棒球。坐下每10秒恢復50點HP和MP。
Array(3010506, 3, 1, 3), // 萬聖節南瓜椅, 3, 1, 3), // 為了紀念萬聖節而製作的椅子。休息期間，每10秒HP恢復50點。 
Array(3010516, 3, 1, 3), // 嚕嚕啦啦印第安小孩, 3, 1, 3), // 成為了淘氣的印第安小孩們的俘虜。每10秒HP恢復50點，MP恢復50點。
Array(3010517, 3, 1, 3), // 印第安小孩的朋友, 3, 1, 3), // 和印第安村莊中生長出來的新芽一起，沉醉在叢林的寂靜中吧。每10秒HP恢復50點，MP恢復50點。
Array(3010518, 3, 1, 3), // 印第安元老的兄弟, 3, 1, 3), // 真誠的印第安元老們，坐下來感覺很有負擔。坐在上面時，每10秒HP恢復50點，MP恢復50點。
Array(1041138, 3, 1, 3), // 巨大白雪人椅子, 3, 1, 3), // 企鵝王一定會羨慕的。體驗變成企鵝國王的感覺吧。每10秒HP恢復50點，MP恢復50點。 
Array(1041139, 3, 1, 3), // 巨大企鵝王椅子, 3, 1, 3), // 企鵝王什麼的很容易馴服。為帥氣的我特別準備的椅子。每10秒HP恢復50點，MP恢復50點。 
Array(3010521, 3, 1, 3), // 水晶椅, 3, 1, 3), // 用閃閃發光的神秘水晶做成的椅子。看上去很昂貴。休息期間，每10秒HP恢復50點。
Array(3010522, 3, 1, 3), // 兔子旋風, 3, 1, 3), // 狂躁的兔子乘著旋風飛起來了。注意保持重心。每10秒HP恢復50點，MP恢復50點。 
Array(3010523, 3, 1, 3), // 白雲漫步椅, 3, 1, 3), // 讓人感覺像在天上漫步一樣的椅子。每10秒HP恢復50點，MP恢復50點。
Array(3010524, 3, 1, 3), // 威爾士柯基犬椅子, 3, 1, 3), // 可以成為可愛的威爾士柯基犬們的朋友的椅子。坐在上面時，每10秒HP恢復50點，MP恢復50點。
Array(3010525, 3, 1, 3), // 貓頭鷹椅子, 3, 1, 3), // 可以讓人理解關在鳥籠中的貓頭鷹的心情的椅子。坐在上面時，每10秒HP恢復50點，MP恢復50點。
Array(3010526, 3, 1, 3), // 白鸛飛行員椅子, 3, 1, 3), // 喙的力量世界最強的白鸛飛行員椅子。坐在上面時，每10秒HP恢復50點，MP恢復50點。
Array(3010530, 3, 1, 3), // 埃歐雷的小型音樂會, 3, 1, 3), // 可以欣賞精靈女王精靈遊俠的特別演唱會的椅子。每10秒HP恢復50，MP恢復50。
Array(3010531, 3, 1, 3), // 小企鵝合唱團, 3, 1, 3), // 正在唱聖誕頌歌的小企鵝們。每10秒HP恢復50，MP恢復50。
Array(3010532, 3, 1, 3), // 藍色木椅, 3, 1, 3), // 只能在維多利亞港買到的藍色木椅。 坐在上面，每10秒HP恢復35。
Array(3010533, 3, 1, 3), // 椰子樹沙灘椅, 3, 1, 3), // 放在納希沙漠涼爽的椰子樹下的沙灘椅。坐在上面，每10秒HP恢復40，MP恢復20。
Array(3010534, 3, 1, 3), // 公沙沙兔靠墊, 3, 1, 3), // 靠著可愛的公沙沙兔坐著，每10秒HP恢復60。
Array(3010535, 3, 1, 3), // 海藍天鵝絨沙發, 3, 1, 3), // 奢華的海藍色天鵝絨沙發。坐在上面，每10秒HP恢復60。
Array(3010536, 3, 1, 3), // 紅色設計師椅子, 3, 1, 3), // 採用明亮紅色的設計師椅子。坐在上面，每10秒HP恢復60。
Array(3010537, 3, 1, 3), // 惡靈附身的娃娃椅子, 3, 1, 3), // 惡靈附身的娃娃椅子。坐在上面，每10秒HP恢復50。
Array(3010538, 3, 1, 3), // 機械椅, 3, 1, 3), // 坐在上面，每10秒恢復HP的機械椅。
Array(3010539, 100, 1, 3), // 紅色龍椅, 3, 1, 3), // 有嚴肅的火龍相伴的椅子。每10秒HP恢復50，MP恢復50。
Array(3010540, 100, 1, 3), // 藍色龍椅, 3, 1, 3), // 有嚴苛的青龍相伴的椅子。每10秒HP恢復50，MP恢復50。
Array(3010541, 3, 1, 3), // 發財椅, 3, 1, 3), // 暫時感受一下富翁的感覺吧！每10秒HP恢復100，MP恢復50。
Array(3010542, 3, 1, 3), // 夏日喵喵椅, 3, 1, 3), // 和貓咪一起在電扇前面閒坐吧！每10秒HP恢復50，MP恢復50。
Array(3010543, 3, 1, 3), // 魔力皮卡啾, 3, 1, 3), // 可以體驗到皮卡啾的強大魔力的椅子。每10秒HP恢復50，MP恢復50。
Array(3010544, 3, 1, 3), // 熱帶夏日椅子, 3, 1, 3), // 滿眼都是水果！每10秒HP恢復50，MP恢復50。
Array(3010545, 3, 1, 3), // 千年狐椅子, 3, 1, 3), // 夢幻的千年狐椅子。每10秒HP恢復50，MP恢復50。
Array(3010546, 3, 1, 3), // 邪惡黑龍椅子, 3, 1, 3), // 代表著黑暗的王座。每10秒HP恢復50，MP恢復50。
Array(3010547, 3, 1, 3), // 魔法之書, 3, 1, 3), // 會讓人感覺變聰明。每10秒HP恢復50，MP恢復50。
Array(3010548, 3, 1, 3), // 可愛音符椅子, 3, 1, 3), // 讓人很想邀請戀人一起坐的椅子。沒有戀人的話，就獨自享受孤獨吧。每10秒HP恢復50，MP恢復50。
Array(3010549, 3, 1, 3), // 羊羔椅子, 3, 1, 3), // 毛絨絨的羊羔。讓人不想出去打獵。每10秒HP恢復50，MP恢復50。
Array(3010550, 3, 1, 3), // 尋找故鄉的月妙椅子, 3, 1, 3), // 據說會在明後天帶著年糕回來。每10秒HP恢復50，MP恢復50。
Array(3010551, 3, 1, 3), // 邪惡之毒椅子, 3, 1, 3), // 看上去非常兇惡的椅子。每10秒HP恢復50，MP恢復50。
Array(3010552, 3, 1, 3), // 喵喵的免費擁抱, 3, 1, 3), // 看上去很善良的貓咪。感覺像跟人擁抱一樣的貓咪椅子。每10秒HP恢復50，MP恢復50。
Array(3010553, 3, 1, 3), // 邪惡羊椅子, 3, 1, 3), // 可怕的羊。不要隨便餵它。每10秒HP恢復50，MP恢復50。
Array(3010554, 3, 1, 3), // 粉色手柄, 3, 1, 3), // 夢想進入遊戲排名的少女的夢想，粉紅色的遊戲手柄椅子。每10秒HP恢復50，MP恢復50。
Array(3010555, 3, 1, 3), // 深夜貓頭鷹, 3, 1, 3), // 寂靜森林中的貓頭鷹，還有我。每10秒HP恢復50，MP恢復50。
Array(3010556, 3, 1, 3), // 皮膚皇后椅子, 3, 1, 3), // 不要害羞。專為在皮膚保養方面決不妥協的你準備的椅子。每10秒HP恢復50，MP恢復50。
Array(3010557, 3, 1, 3), // 睡覺小鳥椅子, 3, 1, 3), // 坐在天真的小鳥們中間，和它們一起打盹吧。每10秒HP恢復50，MP恢復50。
Array(3010558, 3, 1, 3), // 泡泡浴椅子, 3, 1, 3), // 讓人感覺自己好像變乾淨了。每10秒HP恢復50，MP恢復50。
Array(3010559, 3, 1, 3),// 龍蛋, 3, 1, 3), // 裂開的蛋。坐在上面休息時，每10秒HP恢復50，MP恢復50。

Array(1040140, 300, 1, 3),  // C等級BOSS競技場徽章 // (無描述)
Array(1040141, 200, 1, 3),  // B//等級BOSS競技場徽章 // (無描述)
Array(1040010, 100, 1, 3),  // B等級BOSS競技場徽章 // (無描述)
Array(1040013, 100, 1, 3),  // B+等級BOSS競技場徽章 // (無描述)
Array(1040014, 100, 1, 3),  // A等級BOSS競技場徽章 // (無描述)
Array(1040022, 100, 1, 3),  // A+等級BOSS競技場徽章 // (無描述)
Array(1040023, 50, 1, 3),  // S等級BOSS競技場徽章 // (無描述)
Array(1040024, 50, 1, 3),
Array(1040025, 50, 1, 3),
Array(1040026, 50, 1, 3),
Array(1040027, 50, 1, 3),
Array(1040077, 50, 1, 3),
Array(1040078, 50, 1, 3),
Array(1040114, 50, 1, 3),
Array(1040119, 50, 1, 3),
Array(1040123, 50, 1, 3),
Array(1040124, 50, 1, 3),
Array(1040125, 50, 1, 3),
Array(1040126, 50, 1, 3),
Array(1040127, 50, 1, 3),
Array(1040128, 50, 1, 3),
Array(1040129, 50, 1, 3),
Array(1040130, 50, 1, 3),
Array(1040131, 50, 1, 3),
Array(1040132, 50, 1, 3),
Array(1040133, 50, 1, 3),
Array(1040134, 50, 1, 3),
Array(1040135, 50, 1, 3),
Array(1040139, 50, 1, 3),
Array(1041000, 50, 1, 3),
Array(1041001, 50, 1, 3),
Array(1041002, 50, 1, 3),
Array(1041003, 50, 1, 3),
Array(1041004, 50, 1, 3),
Array(1041005, 50, 1, 3),
Array(1041006, 50, 1, 3),
Array(1041007, 50, 1, 3),
Array(1041008, 50, 1, 3),
Array(1041009, 50, 1, 3),
Array(1041010, 50, 1, 3),
Array(1041011, 50, 1, 3),
Array(1041012, 50, 1, 3),
Array(1040023, 50, 1, 3),
Array(1041032, 50, 1, 3),
Array(1041033, 50, 1, 3),
Array(1041035, 50, 1, 3),
Array(1041070, 50, 1, 3),
Array(1041071, 50, 1, 3),
Array(1041072, 50, 1, 3),
Array(1041073, 50, 1, 3),
Array(1041090, 50, 1, 3)
        );

var itemList7 = Array(
Array(1040023, 50, 1, 3),
Array(1401104, 50, 1, 3),
// ------ 特殊 ------
Array(5064300, 600, 2, 2), //卷軸防護卷軸
Array(5062500, 600, 5, 2), //大師附加神奇方塊
Array(5062000, 600, 10, 2), //神奇方塊
//Array(5064000, 600, 1, 2), //防爆卷軸
Array(5064100, 600, 1, 2), //保護卷軸
Array(5062002, 600, 5, 2),  //高級神奇方塊
// 椅子 
Array(1041109, 50, 1, 3),
Array(1401111, 50, 1, 3),
Array(1041110, 50, 1, 3),
Array(1041112, 50, 1, 3),
Array(1041114, 50, 1, 3),
Array(1041125, 50, 1, 3),
Array(1041126, 50, 1, 3),
Array(1041127, 50, 1, 3),
Array(1041128, 50, 1, 3),
//Array(3010832, 50, 1, 3),
Array(1041129, 50, 1, 3),
Array(1041130, 100, 10, 3), //運動會幣
Array(1041131, 70, 50, 3),
Array(1041132, 50, 100, 3),
Array(1041133, 300, 10, 3), //征服者幣
Array(1041134, 200, 50, 3), //征服者幣
Array(1041135, 100, 100, 3), //征服者幣
//必成卷
Array(1080000, 200, 1, 3), //頭盔防禦
Array(1080001, 200, 1, 3), //頭盔體力
Array(1081000, 200, 1, 3), //耳環智力
Array(1081001, 100, 1, 3), //上衣防禦
Array(1081002, 200, 1, 3), //全身鎧甲敏捷
Array(1081003, 300, 1, 3), //防禦
Array(1081004, 300, 1, 3), //褲裙防禦
Array(1082000, 200, 1, 3), //鞋子敏捷
Array(1082001, 200, 1, 3), //鞋子跳躍
Array(1082224, 200, 1, 3), //鞋子速度
Array(1082225, 200, 1, 3), //手套敏捷
Array(1050004, 200, 1, 3), //盾牌防禦
Array(1050005, 200, 1, 3),  //披風魔防
Array(1050006, 200, 1, 3), //披風物防
Array(1050007, 100, 1, 3), //單手劍攻擊
Array(1050019, 100, 1, 3), //斧
Array(1050020, 100, 1, 3),  //鈍器
Array(1050040, 100, 1, 3), //短劍
Array(1050042, 100, 1, 3), //短杖
Array(1050043, 100, 1, 3), //長杖
Array(1050044, 100, 1, 3), //雙手劍
Array(1050050, 100, 1, 3),  //雙手劍魔力
Array(1050065, 100, 1, 3),// 斧頭
Array(1060120, 100, 1, 3), //鈍器
Array(1060121, 100, 1, 3),  //槍攻擊
Array(1060122, 100, 1, 3),  //矛攻擊
Array(1060123, 100, 1, 3), //弓攻擊
Array(1061141, 100, 1, 3), //弩
Array(1061142, 100, 1, 3),  //全套
Array(1061144, 100, 1, 3), //指虎
Array(1060041, 100, 1, 3),
Array(1060042, 100, 1, 3),
Array(1040040, 100, 1, 3),
Array(1060049, 100, 1, 3),
Array(1060067, 100, 1, 3),
Array(1060074, 100, 1, 3),
Array(1060075, 100, 1, 3),
Array(1060096, 100, 1, 3),
Array(1060103, 100, 1, 3),
Array(1060104, 100, 1, 3),
Array(1060105, 100, 1, 3),
Array(1060106, 100, 1, 3),
Array(1060107, 100, 1, 3),
Array(1060108, 100, 1, 3),
Array(1060112, 100, 1, 3),
Array(1060113, 100, 1, 3),
Array(1060114, 100, 1, 3),
Array(1060117, 100, 1, 3),
Array(1060116, 100, 1, 3)  //火槍
);
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用嗎？…我的肚子裡有各類#b奇特座椅或卷軸、裝備、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 600);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        for (var i = 0; i < itemList2.length; i++) {
            if (itemList2[i][1] >= chance) {
                finalitem.push(itemList2[i]);
            }
        }
        for (var i = 0; i < itemList3.length; i++) {
            if (itemList3[i][1] >= chance) {
                finalitem.push(itemList3[i]);
            }
        }
        for (var i = 0; i < itemList4.length; i++) {
            if (itemList4[i][1] >= chance) {
                finalitem.push(itemList4[i]);
            }
        }
        for (var i = 0; i < itemList5.length; i++) {
            if (itemList5[i][1] >= chance) {
                finalitem.push(itemList5[i]);
            }
        }
        for (var i = 0; i < itemList6.length; i++) {
            if (itemList6[i][1] >= chance) {
                finalitem.push(itemList6[i]);
            }
        }
        for (var i = 0; i < itemList7.length; i++) {
            if (itemList7[i][1] >= chance) {
                finalitem.push(itemList6[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            
            
/*            if (im.getChar().getName() == "Super月下") {
                im.setBossLog("Super月下");
                if (im.getBossLog("Super月下") == 6) {
                    itemId = 1332225;
                    quantity = 1;
                    notice = 3;
                }
            }*/
            item = im.gainGachaponItem(itemId, quantity, "楓之谷遊戲箱", notice);
            if (item != -1) {
                im.gainItem(2432306, -1);
                im.gainItem(4310030, 2);
                im.sendOk("你獲得了 #b#t" + item + "##k " + quantity + "個，額外得到2個運動會幣的獎勵，可以在遊戲商店中兌換#b運動會裝備#k和#b必成卷軸#k。");
            } else {
                
                im.sendOk("請你確認在背包的裝備，消耗，其他窗口中是否有一格以上的空間。");
            }
            im.safeDispose();
        } else {
            im.sendOk("今天的運氣可真差，什麼都沒有拿到。");
            im.safeDispose();
        }
    }
}