/*


var ttt6 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var time = new Date();
var hour = time.getHours(); //獲得小時
var minute = time.getMinutes(); //獲得分鐘
var second = time.getSeconds(); //獲得秒
var Year = time.getFullYear();
var month = time.getMonth() + 1; //獲取當前月份(0-11,0代表1月)
var dates = time.getDate(); //獲取當前日(1-31)
var status = -1;
var rand = 0;
var InsertData = false;
var nx = false;
var nxx = false;
var TWD = 0;

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        var conn = cm.getConnection();
        var ps = conn.prepareStatement("SELECT * FROM Activity0512 ORDER BY id desc LIMIT 5");
        var RankDataBase = ps.executeQuery();
        var text = ""
        var i = 1;
        text += "#d#e最新抽中大獎信息：#k#n#r(1000元寶抽1次,每抽一次返500樂豆點)#k\r\n\r\n-----------------------------------------------\r\n"
        while (RankDataBase.next()) {
            text += "#fUI/UIToolTip.img/Item/Equip/Star/Star# #r" + RankDataBase.getString("charName") + "#k 在 #b" + RankDataBase.getString("time") + "#k 抽中 #r" + RankDataBase.getString("itemid") + "#k"
            text += "\r\n"
            i++;
        }
        text += "-----------------------------------------------\r\n#L0##b【抽獎 #r" + cm.getTWD() + " #b/ 1000/次】#l #L1##d【獎品展覽】#l\r\n#L2##r【次數領獎】#l#k \r\n\r\n \r\n"
        RankDataBase.close();
        ps.close();
        conn.close();
        cm.sendSimple(text);

    } else if (status == 1) {
        if (selection == 0) {
            var ii = cm.getItemInfo();
            if (cm.getTWD() >= 1000) {
                var item;
                var itemListAdcanced = Array(
                        3015694, //冰塊中的PB
                        3015695, //
                        3015696, //
                        3015697, //
                        3015698, //
                        3015699, //
                        3015700, //破蛋而出
                        3015701, //成為雪人
                        3015702, //聖誕明信片椅子
                        3015675, //聖誕爺爺椅子
                        3015670, //扔雞腿椅子
                        3015673, //小型死寂之地椅子
                        3015674, //小型童心之地椅子
                        3015672, //小型財物之地椅子
                        3015671, //小型勇士之地椅子
                        3015450, //黑暗追隨者
                        3015449, //守護劍士
                        3015632, //和雪孩子一起
                        3015631, //尷尬的晚餐
                        3015741, //對立著理想
                        3015304, //嘩啦啦大水車
                        3015274, //國慶節噴泉椅子
                        3015303, //幸福的花鞋椅子
                        3016101, //怪物水晶球鞦韆椅
                        3015328, //楓之谷電動纜車椅子
                        3015329, //妖怪壇椅子
                        3015338, //秘密花園椅子
                        3015312, //農夫的樂園椅子
                        3015029, //宇宙衝撞椅
                        3014010, //捕獲殭屍拍立得
                        3010853, //心花怒放椅子
                        3015130, //土豪嬰兒推車
                        3015131, //巨大鼻涕泡椅子
                        3015132, //大粽子沙發椅
                        3015075, //大自然椅子
                        3016000, //大象蹺蹺板椅子
                        3015089, //訓練師庭院椅子
                        3015135, //夏日沁飲椅子
                        3015015, //白羊座椅子
                        3015016, //金牛座椅子
                        3015017, //雙魚座椅子
                        3015018, //雙子座椅子
                        3015019, //巨蟹座椅子
                        3015020, //獅子座椅子
                        3015021, //天秤座椅子
                        3015022, //天蠍座椅子
                        3015023, //處女座椅子
                        3015024, //射手座椅子
                        3015025, //山羊座椅子
                        3015026, //水瓶座椅子
                        3015027, //安德洛墨達椅子
                        3015096, //羊羊幻想牧場椅子
                        3012027, //羊羊熱氣球椅子
                        3015051, //巨無霸國際巨星
                        3015225, //和大象一起自拍
                        3015182, //蝶戀花椅子
                        3012028, //萌寵下午茶
                        3015129, //白色天堂椅子
                        3015224, //夢幻水晶椅子
                        3015002, //七彩摩天輪
                        3010832, //太陽椅子
                        1212090,
                        1222085,
                        1232085,
                        1242091,
                        1302299,
                        1312174,
                        1322224,
                        1332249,
                        1342091,
                        1362110,
                        1372196,
                        1382232,
                        1402222,
                        1412153,
                        1422159,
                        1432189,
                        1442243,
                        1452227,
                        1462214,
                        1472236,
                        1482190,
                        1492200,
                        1522114,
                        1532119,
                        1252032,
                        1542073,
                        1552073,
                        1262038,
                        1582024,
                        1012439,
                        1022212,
                        1032225,
                        1122272,
                        1132248,
                        1142662,
                        1152161,
                        1003984,
                        1102626,
                        1082559,
                        1052673,
                        1072874, //航海150套
                        1102459, //  月夜見尊的披風    
                        1132159, //    月夜見尊的腰帶    
                        1152097, //    月夜見尊的肩章    
                        1082475, //    月夜見尊的手套    
                        1052512, //    月夜見尊的鎧甲
                        1003604, //    月夜見尊的帽子    
                        1072714, //    月夜見尊的鞋子
                        1102460, //    素盞嗚尊的披風    
                        1152098, //    素盞嗚尊的肩章    
                        1132160, //    素盞嗚尊的腰帶    
                        1082476, //    素盞嗚尊的手套    
                        1052513, //    素盞嗚尊的鎧甲
                        1003605, //    素盞嗚尊的頭盔    
                        1072715, //    素盞嗚尊的鞋子
                        1102458, //    天鈿女命的披風    
                        1132158, //    天鈿女命的腰帶    
                        1152096, //    天鈿女命的肩章    
                        1082474, //    天鈿女命的手套    
                        1052511, //    天鈿女命的鎧甲
                        1003603, //    天鈿女命的帽子    
                        1072713, //    天鈿女命的鞋子
                        1102456, //    天照的披風    
                        1132156, //    天照的腰帶    
                        1152094, //    天照的肩章    
                        1082472, //    天照的手套    
                        1052509, //    天照的鎧甲
                        1003601, //    天照的頭盔    
                        1072711, //    天照的鞋子
                        1102457, //    大山?神的披風    
                        1132157, //    大山?神的腰帶    
                        1152095, //    大山?神的肩章    
                        1082473, //    大山?神的手套    
                        1052510, //    大山?神的鎧甲    
                        1003602, //    大山?神的帽子    
                        1072712, //    大山?神的鞋子
                        1102459, //    月夜見尊的披風    
                        1132159, //    月夜見尊的腰帶    
                        1152097, //    月夜見尊的肩章    
                        1082475, //    月夜見尊的手套    
                        1052512, //    月夜見尊的鎧甲
                        1003604, //    月夜見尊的帽子    
                        1072714, //    月夜見尊的鞋子
                        1242077, //    月夜見尊的天雷劍    
                        1362069, //    月夜見尊的慘鬼杖    
                        1342071, //    月夜見尊的斬死刀    
                        1472181, //    月夜見尊的慘魔拳    
                        1332195, //    月夜見尊的斬殺刀        
                        1532076, //    素盞嗚尊的紅炎炮    
                        1242078, //    素盞嗚尊的豪雷劍    
                        1492154, //    素盞嗚尊的雷激槍    
                        1222052, //    素盞嗚尊的虹擊炮    
                        1482142, //  素盞嗚尊的慘血熊千        
                        1212057, //    天鈿女命的眩光杖    
                        1372141, //    天鈿女命的卻鬼棒    
                        1262028, //    天鈿女命的ESP限製器    
                        1552045, //    天鈿女命的赤花蝶扇    
                        1382170, //    天鈿女命的魔靈杖    
                        1252056, //  天鈿女命的靈魂棒        
                        1302229, //    天照的叢雲劍    
                        1442184, //    天照的天羽羽斬    
                        1542045, //    天照的村正    
                        1432140, //    天照的風滅戟    
                        1322164, //    天照的金剛杵    
                        1232072, //    天照的猛嵐劍    
                        1422109, //    天照的破靂剛杵    
                        1402153, //    天照的御魂劍    
                        1312118, //    天照的天月斧    
                        1412106, //    天照的鬼炎斧    
                        1452172, //    大山?神的火魂弓    
                        1522073, //    大山?神的雙龍閃弩    
                        1462161, //    大山?神的大通蓮弓        
                        1242077, //    月夜見尊的天雷劍    
                        1362069, //    月夜見尊的慘鬼杖    
                        1342071, //    月夜見尊的斬死刀    
                        1472181, //    月夜見尊的慘魔拳    
                        1332195, //    月夜見尊的斬殺刀
                        1102481, //暴君西亞戴斯披風 - (無描述)
                        1202083, //真?伊昆圖騰 - (無描述)
                        1102482, //暴君赫爾梅斯披風 - (無描述)
                        1202084, //金?伊昆圖騰 - (無描述)
                        1102483, //暴君凱倫披風 - (無描述)
                        1202085, //銀?伊昆圖騰 - (無描述)
                        1102484, //暴君利卡昂披風 - (無描述)
                        1202086, //銅?伊昆圖騰 - (無描述)
                        1102485, //暴君阿爾泰披風 - (無描述)
                        1190300, //白銀楓葉徽章
                        1082543, //暴君西亞戴斯手套 - (無描述)
                        1190301, //金色楓葉徽章 - (無描述)
                        1082544, //暴君赫爾梅斯手套 - (無描述)
                        1190302, //水晶楓葉徽章 - (無描述)
                        1082545, //暴君凱倫手套 - (無描述)
                        1182021, //楓之谷學校銅徽章 - (無描述)
                        1082546, //暴君利卡昂手套 - (無描述)
                        1182022, //楓之谷學校銀徽章 - (無描述)
                        1082547, //暴君阿爾泰手套 - (無描述)
                        1182023, //楓之谷學校金徽章 - (無描述)
                        1072743, //暴君西亞戴斯靴 - (無描述)
                        1182019, //新彩虹徽章 - 蘊含著彩虹的神秘力量的徽章。
                        1072744, //暴君赫爾梅斯靴 - (無描述)
                        1072745, //暴君凱倫靴 - (無描述)
                        1072746, //暴君利卡昂靴 - (無描述)
                        1072747, //暴君阿爾泰靴 - (無描述)
                        1132174, //暴君西亞戴斯腰帶 - (無描述)
                        1132175, //暴君赫爾梅斯腰帶 - (無描述)
                        1132176, //暴君凱倫腰帶 - (無描述)
                        1132177, //暴君利卡昂腰帶 - (無描述)
                        1132178, //暴君阿爾泰腰帶 - (無描述)
                        1142742, //楓之谷獎盃
                        1112793, //快樂指環
                        2431938, //法弗納武器箱
                        1122122, //真?覺醒冒險之心
                        1122123, //真?覺醒冒險之心
                        1122124, //真?覺醒冒險之心
                        1122125, //真?覺醒冒險之心
                        1122126, //真?覺醒冒險之心
                        1122266, //高級培羅德刻印吊墜
                        1122267, //最高級培羅德刻印吊墜
                        1113074, //高級培羅德戒指
                        1113075, //最高級培羅德戒指
                        1132245, //高級培羅德刻印腰帶
                        1132246, //最高級培羅德刻印腰帶
                        1032222, //高級培羅德耳環
                        1032223, //最高級培羅德耳環
                        1032219//遺忘之神話耳環
                        );
                var itemListNormal = new Array(
                        5062000,
                        5062002,
                        5062009,
                        5064000,
                        2049704,
                        5062009,
                        2049119,
                        2431762,
                        2040057,
                        5062009,
                        2049116,
                        2047978,
                        5062009,
                        2040058,
                        2040059,
                        5062009,
                        4034151,
                        5062009,
                        4001006,
                        5062009,
                        5062009,
                        5062009,
                        2340000,
                        4001839,
                        5062009,
                        2046856,
                        2046863,
                        5062009,
                        2049131,
                        5062009,
                        5062009,
                        2431762,
                        2046870,
                        5062009,
                        2049100,
                        2049116,
                        5062009,
                        2040060,
                        5062009,
                        2049168,
                        5062009,
                        2040061,
                        5062009,
                        2040062,
                        4310088,
                        4310036,
                        5062009,
                        5072000,
                        5062009,
                        5073000,
                        5062009,
                        5074000,
                        5062009,
                        5076000,
                        5062009,
                        5390000,
                        5062009,
                        5390001,
                        5062009,
                        5390002,
                        5062009,
                        5390002,
                        5390003,
                        5062009,
                        5390005,
                        5390006,
                        5150040
                        );
                var xxx = Math.floor(Math.random() * 2);
                if (xxx == 1) {//100分之1的幾率
                    rand = Math.floor(Math.random() * itemListAdcanced.length);
                    item = cm.gainGachaponItem(itemListAdcanced[rand], 1, " 明星轉盤 ");
                    InsertData = true;
                } else if (xxx == 10) {//樂豆點
                    cm.gainNX(1, 1000);
                    InsertData = true;
                    nx = true;
                } else if (xxx == 19 || xxx == 199) {//楓點
                    cm.gainNX(2, 1000);
                    InsertData = true;
                    nxx = true;
                } else {
                    rand = Math.floor(Math.random() * itemListNormal.length);
                    item = itemListNormal[rand];
                    cm.gainItem(item, 1); //直接給予物品 不公告。
                }
                if (item == -1) {
                    cm.sendOk("對不起，你的背包已經滿了。");
                    cm.dispose();
                } else {
                    //cm.addHyPay(1000);
                    cm.setTWD(cm.getTWD() - 1000);
                    cm.gainNX(1, 500);
                    cm.setBossLog("當天明星抽獎");
                    cm.setEventCount("累計明星抽獎", 1);
                    if (nx) {
                        var conn = cm.getConnection();
                        var insert = conn.prepareStatement("INSERT INTO Activity0512 (id,itemid,charid,charName,time) VALUES(?,?,?,?,?)"); // 載入數據
                        insert.setString(1, null); //載入記錄ID
                        insert.setString(2, "1,000 樂豆點"); //載入記錄ID
                        insert.setString(3, cm.getPlayer().getId());
                        insert.setString(4, cm.getPlayer().getName());
                        insert.setString(5, Year + "-" + month + "-" + dates + "");
                        insert.executeUpdate(); //更新
                        insert.close();
                        conn.close();
                        //cm.getMap().startMapEffect("恭喜玩家 " + cm.getChar().getName() + " 運氣爆表抽中 100,000 樂豆點。", 5120012);
                        cm.worldSpouseMessage(0x20, "『終極大獎』 :  恭喜" + cm.getChar().getName() + ",運氣爆表抽中 1,000 樂豆點。");
                        cm.sendOk("恭喜您從幸運抽獎中獲得了 #b1,000 樂豆點#k.");
                        cm.safeDispose();
                    } else if (nxx) {
                        var conn = cm.getConnection();
                        var insert = conn.prepareStatement("INSERT INTO Activity0512 (id,itemid,charid,charName,time) VALUES(?,?,?,?,?)"); // 載入數據
                        insert.setString(1, null); //載入記錄ID
                        insert.setString(2, "1,000 楓點"); //載入記錄ID
                        insert.setString(3, cm.getPlayer().getId());
                        insert.setString(4, cm.getPlayer().getName());
                        insert.setString(5, Year + "-" + month + "-" + dates + "");
                        insert.executeUpdate(); //更新
                        insert.close();
                        conn.close();
                        //cm.getMap().startMapEffect("恭喜玩家 " + cm.getChar().getName() + " 運氣爆表抽中 100,000 楓點。", 5120012);
                        cm.worldSpouseMessage(0x20, "『終極大獎』 :  恭喜" + cm.getChar().getName() + ",運氣爆表抽中1,000 楓點。");
                        cm.sendOk("恭喜您從幸運抽獎中獲得了 #b1,000 楓點#k.");
                        cm.safeDispose();
                    } else {
                        if (InsertData) {
                            var conn = cm.getConnection();
                            var insert = conn.prepareStatement("INSERT INTO Activity0512 (id,itemid,charid,charName,time) VALUES(?,?,?,?,?)"); // 載入數據
                            insert.setString(1, null); //載入記錄ID
                            insert.setString(2, "#t" + item + "#"); //載入記錄ID
                            insert.setString(3, cm.getPlayer().getId());
                            insert.setString(4, cm.getPlayer().getName());
                            insert.setString(5, Year + "-" + month + "-" + dates + "");
                            insert.executeUpdate(); //更新
                            insert.close();
                            conn.close();
                            //cm.getMap().startMapEffect("恭喜玩家 " + cm.getChar().getName() + " 運氣爆表抽中終極大獎 " + ii.getName(item) + "。", 5120012);
                        }
                        status = -1;
                        cm.sendOk("恭喜您抽中獲得了 #b#t" + item + "##k.並返還 #r500#k 樂豆點");
                    }

                }
            } else {
                cm.sendOk("您沒有 1000 元元寶，請獲得後再使用。");//暫時關閉。增加物品中。
                cm.safeDispose();
            }
        } else if (selection == 1) {
            cm.sendOk("#b終極大獎圖片欣賞，並且抽中後可以在首頁榜上公佈。\r\n可以抽中 #r樂豆點1,000   楓點5,000#k #b以及下列：#k\r\n#i3010853##i3015130##i3015131##i3015132##i3015089##i3015135##i3015015##i3015016##i3015017##i3015018##i3015019##i3015020##i3015021##i3015022##i3015023##i3015024##i3015025##i3015026##i3015027##i3015096##i3012027##i3015051##i3015002##i3010832##i1102481##i1102482##i1102483##i1102484##i1102485##i1082543##i1082544##i1082545##i1082546##i1082547##i1072743##i1072744##i1072745##i1072746##i1072747##i1132174##i1132175##i1132176##i1132177##i1132178##i1142742##i1112793##i2431938##i1032219#");
            cm.dispose();
        } else if (selection == 2) {
            cm.sendOk("暫時有問題待修復開放。具體等通知。")
            cm.dispose();
            //cm.openNpc(9310498, "cslj");
        }
    }
}