/*  This is mada by Kent    
 *  This source is made by Funms Team
 *  @Author Kent 
 */

?var a = 0;
var selects;
var head = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n";
var BossList = Array(
Array("[簡單/普通] 魔王巴洛古！#v2433117#", 105100100),
Array("[普通] 拉圖斯！#v4310143##v2049122##v2433117##v5062009#", 220080000),
//Array("[普通] 新加坡 - 千年樹精王遺跡Ⅱ", 541020700),
Array("[簡單/普通/進階] 八爪殘暴炎魔!#v4310143##v2049116##v2049122##v5062009##v2433117#", 211042200),
Array("[普通] 妖精女王 - 艾菲尼婭#v4310143##v2049116##v2049122##v5062009##v2433117#", 300030300),
Array("[普通/進階] 闇黑龍王#v4310143##v2049116##v2049122##v5062009##v2433117#", 240040700),
Array("[簡單/普通] 次元縫隙 - 阿卡伊農祭壇#v4310143##v2049116##v2049122##v2049603##v5062009##v2433117#", 272030300),
Array("[簡單/普通] 獅子王之城 - 凡雷恩#v4310143##v2049122##v2049116##v5062009##v2433117#", 211070000),
Array("[普通/困難] 黃金寺院 - 拉瓦那#v4310143##v2049122##v5062009##v2433117#", 252030000),
Array("#d[普通/困難] 西格諾斯的庭院 - 女皇#v4310143##v2510173##v2510174##v2049122##v1113070##v1032216##v1152155##v2435770##v2049603##v2614001##v2614000##v5062009##v2433117#", 271030600),
Array("[普通/混沌] 時間寵兒 - 皮卡啾#v4310143##v2049122##v2433117##v1113070##v1032216##v1152155##v2614001##v5062009##v2614000#", 270050000),
Array("#d[普通/強化] 強化鑽機,弱小勿進(New~)#v4310143##v5062009##v2433117#", 703020000),
Array("#r[普通/進階] 魯塔比斯 - 四大天王BOSS 。#v4310143##v2049603##v1113055##v4310064##v4310065##v1003722##v1003719##v1003721##v1003720##v2614001##v2614000##v5062009#", 105200000),
Array("[普通/困難] 阿斯旺 - 希拉#v4310143##v2049122##v2049603##v1112767##v1112763##v1112771##v1112775##v1113231##v1113210##v113149##v2614001##v2614000##v5062009##v2433117#", 262010000),
Array("#r[噩夢牢籠] 桑凱梅爾茲 - 航海入口#v4310100##v2433117#", 865000001),
Array("#r[噩夢牢籠] 心樹守護者之地 - 培羅德入口#v4310143##v4310098##v4310097##v2435770##v2614001##v2614000#", 863000100),
Array("#r[噩夢牢籠] 暴君城堡戰場 - 暴君梅格耐斯#v4310059##v4310143##v1102471##v1072735##v2049603##v1132166##v1102478##v1072737##v1132169##v1102481##v1102482##v1082544##v1082543##v1072743##v1072744##v1132174##v1132176##v2614002##v2614001##v2614000#", 401053002),
Array("#r[噩夢牢籠] 秘密祭壇 - 森蘭丸(New~)#v4310143##v2049603##v2510173##v2510174##v1003601##v1102456##v1082472##v1052509##v1072711##v1322164##v1402153##v1232072##v1152094##v1132156##v1542045##v2590006##v2590015#", 807300100),
Array("#r[噩夢牢籠] 起源之塔海底50層 - 桃樂絲(New~)#k,待開放#v4310143##v4032766##v1113070##v1032216##v1152155##v2048717##v2048716#", 992000000),
Array("#r[噩夢牢籠] 比睿山 - 濃姬(New~)#v4033115##v4310143##v4032766##v2614002##v2614001##v2614000##v1003984##v1012439##v1022212##v1032225##v1052673##v1082559##v1102626##v1122272##v1132248##v1152161#", 811000099),
Array("#r[噩夢牢籠] 黑色天堂 - 史烏(New~)#v1712000##v4310156##v4310143##v1242120##v1442268##v1482216##v1452252##v1552110##v1542108##v1352975##v1352957##v1353006##v1352916#", 310070490),
Array("#r[噩夢牢籠] 18人團戰 - 破王烏勒斯(New~)#k,最新開放!!!#v4033115##v4310143##v2614002##v2614001##v2614000#", 970072200),
Array("[#g地獄修羅] 軍團長 - 戴米安(New~)#k,最新開放!!!#v1712000##v4310218##v4033115##v4310143##v1092113##v1222075##v1322216##v1262030##v1372189##v104423##v1102775##v1082638##v1052887##v1073035#", 105300303),
Array("[#g地獄修羅] 軍團長 - 露希妲(New~)#k,最新開放!!!#v1712000##v4310218##v4310143##v1004808##v1102941##v1082697##v1053066##v1073162##v1242122##v1212120##v1302343##v1332279##v1362140##v1522143##v1442274#", 450003600)
                                        ); 

function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
            var text = head + "為了更方便的遊戲，在這裡可以傳送到BOSS的傳送點。\r\n#b";
            for (var i = 0; i < BossList.length; i++) {
                text += "#L" + i + "# " + BossList[i][0] + "\r\n";
            }
            cm.sendSimple(text);
        } else if (a == 1) {
            selects = selection;
            cm.sendYesNo(head + "你現在想出發到" + BossList[selects][0] + "嗎？");
        } else if (a == 2) {
            cm.saveLocation("MULUNG_TC");
            cm.warp(BossList[selects][1], 0);
            cm.dispose();
        }//a
    }//mode
}//f