/*
 *  @功能：    BOSS次數查詢
 *  @作者：    彩虹工作室
 *  @時間：    2017年1月18日
 */
var ico = "#fUI/SoulUI.img/DungeonMap/icon/dungeonItem/0#";//"+ttt3+"//美化圓
var boss = Array(
    Array("殘暴炎魔    ", "普通殘暴炎魔", "進階殘暴炎魔", 3, 3),
    Array("希拉    ", "希拉", "希拉[困難]", 2, 1),
    Array("鑽機    ", "鑽機", "強化鑽機", 2, 2),
    Array("黑龍    ", "闇黑龍王", "進階闇黑龍王", 2, 3),
    Array("史烏    ", "史烏", "史烏", 2, 2),
    Array("半半    ", "半半", "進階半半", 3, 1),
    Array("貝倫    ", "貝倫", "進階貝倫", 3, 1),
    Array("濃姬    ", "濃姬", "濃姬", 1, 1),
    Array("皮埃爾  ", "皮埃爾", "進階皮埃爾", 3, 1),
    Array("森蘭丸  ", "森蘭丸", "森蘭丸[困難]", 2, 1),
    Array("培羅德  ", "貝勒·德", "貝勒·德", 2, 2),
    Array("皮卡啾  ", "皮卡啾", "混沌皮卡啾", 3, 1),
    Array("獅子王  ", "獅子王:凡雷恩[簡單]", "獅子王:凡雷恩[普通]", 2, 1),
    Array("西格諾斯  ", "女皇：西格諾斯", "女皇：西格諾斯", 2, 2),
    Array("妖精女王", "妖精女王：艾菲尼婭", "妖精女王：艾菲尼婭", 3, 3),
    Array("魔王巴洛古", "魔王巴洛古", "魔王巴洛古[困難]", 3, 1),
    Array("阿卡伊農", "阿卡伊農[普通]", "阿卡伊農[普通]", 2, 2),
    Array("麥格拉斯", "梅格耐斯", "梅格耐斯[困難]", 1, 1),
    Array("腥血女王", "腥血女王", "進階腥血女王", 3, 1)
)
var boss1 = [
    ["殘暴炎魔", "普通殘暴炎魔", "進階殘暴炎魔", 3, 3]
]

function start() {
    var text = "\t#fs18##d#e以下是您今日副本剩餘挑戰次數\r\n#fs12##b#n\r\n";
    for (var i = 0; i < boss.length; i++) {
        var element = boss[i];
        text += "#fs15#" + "  " + ico + element[0] + "   普通" + "(" + (element[3] - cm.getPQLog(element[1])) + "/#r" + element[3] + "#b次) 困難" + "(" + (element[4] - cm.getPQLog(element[2])) + "/#r" + element[4] + "#b次)\r\n"
    }
    cm.sendOk(text);
    cm.dispose();
}

