/* 樂豆點商城 - 椅子 */

var status = -1;
var itemList = Array(
// -----價格為 60000 樂豆點 --------
Array(3015193, 5000000), 
Array(3015143, 2000000), 
Array(3015181, 2000000), 
Array(3015144, 1000000), 
Array(3015142, 1000000), 
Array(3015178, 1000000), 
Array(3015100, 1000000), 
Array(3015109, 1000000), 
Array(3015183, 1000000), 
Array(3015197, 1000000), 
Array(3015211, 1000000), 
Array(3012026, 1500000), //綠色時尚轉椅
Array(3010002, 60000), //綠色時尚轉椅
Array(3010003, 60000), //紅色時尚轉椅
Array(3010006, 60000), //黃色時尚轉椅
Array(3010004, 60000), //黃藍休閒椅
Array(3010005, 60000), //紅藍休閒椅
Array(3010018, 60000), //椰子樹沙灘椅
Array(3010029, 60000), //藍環凳
Array(3010030, 60000), //黑環凳
Array(3010031, 60000), //紅環凳
Array(3010032, 60000), //黃環凳
Array(3010033, 60000), //綠環凳
Array(3010043, 60000), //魔女的飛掃把
Array(3013002, 60000), //煙花祭
Array(3010166, 60000), //影武同門
// -----價格為 90000 樂豆點 --------
Array(3010007, 90000), //粉色海豹靠墊
Array(3010008, 90000), //藍色海豹靠墊
Array(3010010, 90000), //白色海豹靠墊
Array(3010016, 90000), //黑色海豹靠墊
Array(3010017, 90000), //金色海豹靠墊
Array(3010024, 90000), //玩具粉熊椅
Array(3010025, 90000), //楓葉紀念凳
// -----價格為 100000 樂豆點 --------
Array(3010014, 100000), //月亮彎
Array(3010019, 100000), //壽司椅
Array(3010021, 100000), //暖暖桌
Array(3010034, 100000), //悠長假期(紅)
Array(3010035, 100000), //悠長假期(藍)
Array(3010037, 100000), //豬豬凳
Array(3010038, 100000), //空氣沙發
Array(3010040, 100000), //蝙蝠椅
Array(3010041, 100000), //骷髏王座
Array(3010044, 100000), //同一紅傘下
Array(3010045, 100000), //寒冰椅子
Array(3010049, 100000), //雪房子
Array(3010068, 100000), //露水椅子
Array(3010050, 100000), //公主凳
Array(3010069, 100000), //大黃風
Array(3010093, 100000), //鮮美的火雞
Array(3010094, 100000), //漂漂豬椅子
Array(3010095, 100000), //石頭人座椅
// -----價格為 100000 樂豆點 --------
Array(3010009, 100000), //塌塌凳
Array(3010028, 100000), //海盜的俘虜
Array(3010036, 100000), //浪漫鞦韆
Array(3010046, 100000), //紅龍椅
Array(3010047, 100000), //藍龍椅
Array(3010048, 100000), //聖誕樹椅子
Array(3010051, 100000), //沙漠兔子靠墊1
Array(3010052, 100000), //沙漠兔子靠墊2
Array(3010054, 100000), //呼嚕呼嚕床
Array(3010057, 100000), //血色玫瑰
Array(3010058, 100000), //世界末日
Array(3010071, 100000), //神獸椅
Array(3010073, 100000), //baby皮卡啾
Array(3010075, 100000), //我為音樂狂
Array(3010077, 100000), //貓頭鷹椅子
Array(3010096, 100000), //恐龍化石寶座
Array(3010098, 100000), //電視宅人
Array(3010099, 100000), //北極熊椅子
Array(3010100, 100000), //財神椅子
Array(3010110, 100000), //舒適大白熊椅子
Array(3010111, 100000), //虎虎生威
Array(3010112, 100000), //情書櫃子
Array(3010116, 100000), //搖滾之魂椅子
Array(3010117, 100000), //魔法書椅子
Array(3010118, 100000), //糖果音符椅子
Array(3010119, 100000), //羊羊椅子
Array(3010120, 100000), //彩蛋籃子
Array(3010123, 100000), //夏日花朵
Array(3010124, 100000), //都納斯噴氣椅子
Array(3010125, 100000), //尼貝隆戰艦椅
Array(3010126, 100000), //蝙蝠魔王座
Array(3012001, 100000), //篝火
Array(3012002, 100000), //浴桶
Array(3010066, 100000), //深藍色絨毛沙發
Array(3010067, 100000), //紅色設計師椅
Array(3010080, 100000), //柿子樹鞦韆 
Array(3010081, 100000), //紅帽月妙抱枕椅
Array(3010082, 100000), //藍帽月妙抱枕椅
Array(3010083, 100000), //扇子月妙抱枕椅
Array(3010084, 100000), //太平蕭月妙抱枕椅
Array(3010107, 100000), //龍龍的蛋殼椅
Array(3010108, 100000), //幼龍鞦韆
Array(3010109, 100000), //暖爐椅
Array(3010113, 100000), //幽魂發條熊椅子
Array(3010055, 100000), //冰雪糕丸子椅
Array(3010145, 100000), //週年慶水晶楓葉椅
Array(3010136, 100000), //6週年怪物王座
Array(3010137, 100000), //神龍椅子
Array(3010149, 100000), //咖啡風扇椅
Array(3010144, 100000), //七夕椅子
Array(3010155, 100000), //影武者的貓頭鷹
Array(3010078, 100000), //大咖啡椅子
Array(3010132, 100000), //撒嬌咖啡椅
Array(3010133, 100000), //帳篷椅
// -----價格為 100000 樂豆點 --------
Array(3012003, 100000), //愛心椅子
Array(3012006, 100000), //風吹稻香
Array(3012010, 100000), //巧克力蛋糕戀人
Array(3012011, 100000), //我愛巧克力火鍋
Array(3010156, 100000), //浮游飛行器
Array(3010152, 100000), //黃三角帳篷椅
Array(3010162, 100000), //果月椅子
Array(3010163, 100000), //滿月椅
Array(3010135, 100000), //節日獨角獸椅子
Array(3010139, 100000), //私密空間
Array(3010168, 100000), //友誼萬歲椅子
Array(3010172, 100000), //星空椅子
Array(3010173, 100000), //萬聖節塔羅椅子
Array(3010175, 100000), //名畫家椅子
Array(3010179, 100000), //燕尾服咖啡椅
Array(3010169, 100000), //紙箱裡(求領養)
Array(3010171, 100000), //過來抱抱椅
Array(3010174, 100000), //女巫煉藥椅
Array(3010182, 100000), //兔子公會椅
Array(3010183, 100000), //胡蘿蔔椅子
Array(3010053, 100000), //兔子紀念版椅子
Array(3010142, 100000), //水族館椅子
Array(3010209, 100000), //草莓冰淇淋月餅椅
Array(3010210, 100000), //香草冰淇淋月餅椅
Array(3010197, 100000), //英雄的椅子-狂狼勇士
Array(3010200, 100000), //英雄的椅子-龍魔導士
Array(3010201, 100000), //英雄的椅子-暗影
Array(3010161, 100000), //鼠鼠椅
Array(3010226, 100000), //月光仙子椅子
Array(3010085, 100000), //鬼娃娃椅子
Array(3013000, 100000), //櫻花樹下
Array(3010177, 100000), //手柄座椅
Array(3010454, 100000), //雲朵
Array(3010591, 200000), //漫畫書椅子
Array(3010127, 200000), //殘暴炎魔寶座
Array(3010128, 200000), //黑龍王椅
Array(3010311, 200000), //黑龍椅子
Array(3010799, 300000), //墳墓幽靈椅子
Array(3010896, 500000), //我的女皇椅子
Array(3010689, 500000), //10週年椅子
Array(3010751, 500000), //鯨魚椅子
Array(3010752, 500000), //玫瑰鳥籠
Array(3010754, 500000), //百鬼夜行
Array(3012020, 800000), //紫籐花吊籃椅
Array(3010779, 800000), //金馬祥雲轎
Array(3010783, 1000000), //藍色邦尼屋
Array(3010876, 1000000), //楓之谷行星椅子
Array(3010696, 1000000), //大黃鴨
Array(3010715, 1000000), //幸福9週年蛋糕氣球椅
Array(3010070, 1000000), //巨無霸皮卡啾
Array(3010828, 1000000), //木星椅子
Array(3010829, 750000), //木星椅子
Array(3010820, 750000), //迷你玩具別墅椅子
Array(3010511, 750000), //咖啡公園椅子
Array(3010516, 750000), //嚕嚕啦啦印第安小孩
Array(3012016, 750000), //情侶糖果椅子
Array(3010459, 750000), //天使舞台椅
Array(3010196, 750000), //泡泡浴缸椅
Array(3010423, 750000), //蘑菇朋友椅子
Array(3010461, 750000), //賞月專用月桂樹鞦韆椅
Array(3010528, 750000), //跑步機椅子
Array(3010448, 750000), //泡泡浴椅子
Array(3010660, 750000), //夢幻公主城堡椅子
Array(3010714, 750000), //堆王冠
Array(3010835, 750000), //愛情水晶球記憶椅
Array(3010779, 750000), //金馬祥雲轎
Array(3010702, 500000), //愛琴海椅子
Array(3012019, 750000), //愛琴海椅子
Array(3010842, 750000), //貓貓郊遊房車
Array(3010718, 750000), //初戀雲朵朵沙發
Array(3010744, 750000), //楓之谷的磚頭朋友們
Array(3010594, 750000), //藍莓蛋糕椅
Array(3012020, 750000), //紫籐花吊籃椅
Array(3010843, 750000), //兔兔郊遊房車
Array(3010115, 750000), //熊寶寶床
Array(3010704, 3000000), //懲戒之月妙椅子
Array(3010140, 500000), //早日康復床
Array(3010605, 2500000), //雛祭娃娃3
Array(3014004, 750000), //案件聚焦椅子
Array(3010657, 1000000), //軍團長椅子
Array(3010519, 1250000), //巨大白雪人椅子
Array(3010705, 750000), //月妙和水靈椅子
Array(3010401, 750000), //幻影卡牌椅
Array(3010697, 750000), //絕對之椅
Array(3010193, 750000), //伊芙麗思的煉金瓶
Array(3010757, 750000), //你和我
Array(3010603, 750000), //雛祭娃娃1
Array(3010604, 750000), //雛祭娃娃2
Array(3010662, 750000), //章魚魚缸椅
Array(3013000, 750000), //櫻花樹下
Array(3014003, 750000), //封面模特椅子
Array(3010362, 750000), //彩虹椅子
Array(3010760, 750000), //古代浴池椅子
Array(3014000, 750000), //驚人漫畫椅子
Array(3010851, 750000), //夏日沁飲椅子
Array(3010723, 750000), //法式貴族扶手椅
Array(3014005, 750000), //榮譽的象徵
Array(3010879, 1000000), //咖啡椅子
Array(3010877, 1000000), //人魚珊瑚礁
Array(3012024, 1000000), //沙灘排球椅子
Array(3015133, 1000000), //亞敏下午茶椅
Array(3010838, 1000000), //冰城堡椅子
Array(3016000, 2000000), //大象蹺蹺板椅子
Array(3010853, 3000000), //心花怒放椅子
//Array(3010658, 4000000), //夏日西瓜冰椅子
//Array(3010936, 5000000), //青蛙跳樓機
//Array(3015075, 5000000), //大自然椅子
//Array(3010832, 6000000), //太陽椅子
//Array(3010788, 5500000), //巨無霸年夜飯
Array(3015002, 7500000)//七彩摩天輪
//Array(3015051, 10000000) //巨無霸國際巨星

);
var selectedItem = -1;
var selectedCost = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 0) {
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        var selStr = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#親愛的#r#h ##k您好，請選擇您希望購買的道具：";
        for (var i = 0; i < itemList.length; i++) {
            selStr += "\r\n#L" + i + "##i" + itemList[i][0] + ":# #b#t" + itemList[i][0] + "##k   #r" + itemList[i][1] + " #k樂豆點#l";
        }
        cm.sendSimple(selStr);
    } else if (status == 1) {
        var item = itemList[selection];
        if (item != null) {
            selectedItem = item[0];
            selectedCost = item[1];
            cm.sendYesNo("您是否購買#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + " #k 樂豆點？");
        } else {
            cm.sendOk("出現錯誤...");
            cm.dispose();
        }
    } else if (status == 2) {
        if (selectedCost <= 0 || selectedItem <= 0) {
            cm.sendOk("購買道具出現錯誤...");
            cm.dispose();
            return;
        }
        if (cm.getPlayer().getCSPoints(1) >= selectedCost) {
            var gachaponItem = cm.gainGachaponItem(selectedItem, 1, "樂豆點商店", 3, true);
            if (gachaponItem != -1) {
                cm.gainNX( - selectedCost);
                cm.sendOk("恭喜您成功購買#i" + selectedItem + ":# #b#t" + selectedItem + "##k。");
            } else {
                cm.sendOk("購買失敗，請您確認在背包所有欄目窗口中是否有一格以上的空間。");
            }
        } else {
            cm.sendOk("您沒有那麼多樂豆點。\r\n\r\n購買#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + "#k 樂豆點。");
        }
        cm.dispose();
    }
}
