status = -1;
var itemList = Array(
Array(1032032, 500, 1, 0), //秋葉耳環
Array(1032035, 500, 1, 0), //楓葉耳環
Array(1032040, 500, 1, 0), //楓葉型耳環,800,1,0), //初
Array(1032041, 500, 1, 0), //楓葉型耳環,800,1,0), //慶
Array(1032042, 500, 1, 0), //楓葉型耳環,800,1,0), //盛
Array(1032055, 500, 1, 0), //工作人員C的舊收信機
Array(1032056, 500, 1, 0), //工作人員C的舊收信機
Array(1032057, 500, 1, 0), //工作人員C的舊收信機
Array(1032058, 500, 1, 0), //工作人員C鈦質收信機
Array(1122001, 500, 1, 0), //綠色蝶形領結
Array(1122002, 500, 1, 0), //紅色蝶形領結
Array(1122003, 500, 1, 0), //黃色蝶形領結
Array(1122004, 500, 1, 0), //粉紅蝶形領結
Array(1122005, 500, 1, 0), //黑色蝶形領結
Array(1122006, 500, 1, 0), //藍色蝶形領結
Array(1122015, 500, 1, 0), //楓葉圍巾
Array(1122058, 100, 1, 0), //休彼德蔓的混沌項鏈
Array(1132000, 800, 1, 0), //白色腰帶
Array(1132001, 700, 1, 0), //黃色腰帶
Array(1132002, 600, 1, 0), //藍色腰帶
Array(1132003, 500, 1, 0), //紅色腰帶
Array(1132004, 450, 1, 0), //黑賀腰帶
Array(1132010, 500, 1, 0), //黃金豬豬腰帶
Array(1132011, 500, 1, 0), //黃金豬豬腰帶
Array(1132012, 500, 1, 0), //法老的腰帶
Array(1132013, 800, 1, 0), //不滅的法老腰帶
Array(1122074, 500, 1, 0), //楓葉吊墜
Array(1122075, 500, 1, 0), //黃金楓葉魔法吊墜
Array(1002390, 500, 1, 0), //真殘暴炎魔頭盔
Array(1002391, 500, 1, 0), //海盜頭巾(綠)
Array(1002392, 500, 1, 0), //海盜頭巾(紅)
Array(1002393, 500, 1, 0), //海盜頭巾(粉)
Array(1002394, 500, 1, 0), //海盜頭巾(灰)
Array(1002395, 500, 1, 0), //海盜頭巾(紫)
Array(1002418, 500, 1, 0), //廢報紙頭盔
Array(1002419, 500, 1, 0), //楓葉帽
Array(1002424, 500, 1, 0), //紅馬術帽
Array(1002425, 500, 1, 0), //藍馬術帽
Array(1002441, 500, 1, 0), //熱血頭帶
Array(1002508, 500, 1, 0), //楓葉頭盔
Array(1002509, 500, 1, 0), //楓葉頭盔
Array(1002510, 500, 1, 0), //楓葉頭盔
Array(1002511, 500, 1, 0), //楓葉頭盔
Array(1002547, 500, 1, 0), //紅獵人帽子
Array(1002550, 500, 1, 0), //黑色格萊西頭盔
Array(1002551, 500, 1, 0), //藍龍頭盔
Array(1002554, 500, 1, 0), //武藝頭繩
//-------耳環-------
Array(1032055, 500, 1, 0), //工作人員C的舊收信機
Array(1032056, 500, 1, 0), //工作人員C的舊收信機
Array(1032057, 500, 1, 0), //工作人員C的舊收信機
Array(1032058, 500, 1, 0), //工作人員C鈦質收信機
//------手套------
Array(1082145, 100, 1, 1), //工地手套(黃)
Array(1082146, 100, 1, 1), //工地手套(紅)
Array(1082147, 100, 1, 1), //工地手套(藍)
Array(1082148, 100, 1, 1), //工地手套(紫)
Array(1082149, 100, 1, 1), //工地手套(褐)
Array(1082150, 100, 1, 1), //工地手套(灰)
//-----椅子-----
Array(3010013, 150, 1, 0), //悠長假期
Array(3010014, 150, 1, 0), //月亮彎
Array(3010018, 150, 1, 0), //椰子樹沙灘椅
Array(3010019, 150, 1, 0), //壽司椅
Array(3010021, 150, 1, 0), //暖暖桌
Array(3010025, 150, 1, 0), //楓葉紀念凳
Array(3010028, 150, 1, 0), //海盜的俘虜
Array(3010029, 150, 1, 0), //藍環凳
Array(3010030, 150, 1, 0), //黑環凳
Array(3010031, 150, 1, 0), //紅環凳
Array(3010032, 150, 1, 0), //黃環凳
Array(3010033, 150, 1, 0), //綠環凳
Array(3010037, 150, 1, 0), //豬豬凳
Array(3010044, 150, 1, 0), //同一紅傘下
Array(3012001, 150, 1, 0), //篝火
Array(3012002, 150, 1, 0), //浴桶
Array(3010073, 150, 1, 0), //PB克繽
Array(3012003, 150, 1, 0), //愛心椅子
Array(3010012, 150, 1, 0), //劍士 寶座
Array(3010025, 150, 1, 0), //楓葉紀念凳
Array(3010037, 150, 1, 0), //豬豬凳
Array(3010038, 150, 1, 0), //愛心椅子
Array(3010040, 150, 1, 0), //蝙蝠椅
Array(3010041, 150, 1, 0), //骷髏王座
Array(3010043, 150, 1, 0), //魔女的飛掃把
Array(3010044, 150, 1, 0), //同一紅傘下
Array(3010045, 150, 1, 0), //寒冰椅子
Array(3010046, 150, 1, 0), //紅龍椅
Array(3010047, 200, 1, 0), //藍龍椅
Array(3010048, 200, 1, 0), //聖誕樹椅子
Array(3010049, 200, 1, 0), //雪房子
Array(3010050, 200, 1, 0), //公主凳
Array(3010057, 200, 1, 0), //血色玫瑰
Array(3010058, 200, 1, 0), //世界末日
Array(3010068, 200, 1, 0), //露水椅子
Array(3010070, 15, 1, 1), //巨無霸皮卡啾
Array(3010071, 125, 1, 0), //神獸椅
Array(3010077, 125, 1, 0), //貓頭鷹椅子
Array(3010085, 125, 1, 0), //鬼娃娃椅子
Array(3010096, 125, 1, 0), //恐龍化石寶座
Array(3010095, 125, 1, 0), //石頭人座椅
Array(3010094, 215, 1, 0), //漂漂豬椅子
Array(3010098, 125, 1, 0), //電視宅人
Array(3010106, 125, 1, 0), //雪狼戰椅
Array(3010112, 125, 1, 0), //情書櫃子
Array(3010117, 125, 1, 0), //魔法書椅子
Array(3010119, 125, 1, 0), //羊羊椅子
Array(3010120, 125, 1, 0), //彩蛋籃子
Array(3010123, 125, 1, 0), //夏日花朵
Array(3010124, 125, 1, 0), //都納斯噴氣椅子
Array(3010125, 125, 1, 0), //尼貝隆戰艦椅
Array(3010127, 125, 1, 0), //殘暴炎魔寶座
Array(3012001, 125, 1, 0), //篝火
Array(3010136, 150, 1, 0), //6週年怪物王座
Array(3010155, 150 * 2, 1, 0), //影武者的貓頭鷹椅子
Array(3010144, 150 * 2, 1, 0), //七夕椅子
Array(3010149, 150 * 2, 1, 0), //貓咪風扇椅
Array(3010129, 150 * 2, 1, 0), //酋長寶座
Array(3010131, 150 * 2, 1, 0), //貪吃熊貓椅
Array(3010132, 150 * 2, 1, 0), //撒嬌喵咪椅
Array(3010133, 150 * 2, 1, 0), //帳篷椅
Array(3010163, 150 * 2, 1, 0), //滿月椅
// ------ 特殊獎品 --------------
//Array(4000385, 900, 1, 1), //心燈
//Array(4001465, 800, 20, 1), //愛心寶石
//Array(4110000, 700, 1, 1), //迷你抽獎用
// ------ 086添加 ------
Array(1003622, 100, 1, 1), //布萊克繽帽 
Array(1003621, 200, 1, 1), //混沌皮卡啾帽
Array(1003780, 100, 1, 1), //自由皮卡啾帽
Array(1003781, 100, 1, 1), //自由布萊克繽帽 
Array(1052526, 100, 1, 1), //混沌皮卡啾大衣
Array(1052527, 100, 1, 1), //布萊克繽大衣 
Array(1052588, 100, 1, 1), //自由皮卡啾連身衣
Array(1052589, 100, 1, 1), //自由布萊克繽連身衣 
Array(1212072, 100, 1, 1), //布萊克繽閃亮克魯
Array(1222067, 100, 1, 1), //布萊克繽靈魂射手
Array(1232064, 100, 1, 1), //布萊克繽魔劍
Array(1242069, 100, 1, 1), //布萊克繽能量劍 
Array(1242070, 100, 1, 1), //布萊克繽能量劍 
Array(1302070, 100, 1, 1), //布萊克繽單手劍 
Array(1312142, 100, 1, 1), //布萊克繽單手斧 
Array(1322100, 100, 1, 1), //布萊克繽單手棍
Array(1332214, 100, 1, 1), //布萊克繽短劍
Array(1342079, 100, 1, 1), //布萊克繽影武
Array(1362081, 100, 1, 1), //布萊克繽手杖 
Array(1372168, 100, 1, 1), //布萊克繽短杖 
Array(1382199, 100, 1, 1), //布萊克繽長杖 
Array(1402185, 100, 1, 1), //布萊克繽雙手劍 
Array(1412126, 100, 1, 1), //布萊克繽雙手斧 
Array(1422129, 100, 1, 1), //布萊克繽雙手棍
Array(1432158, 100, 1, 1), //布萊克繽長槍 
Array(1442209, 100, 1, 1), //布萊克繽長矛 
Array(1452196, 100, 1, 1), //布萊克繽弓 
Array(1462184, 100, 1, 1), //布萊克繽弩 
Array(1472205, 100, 1, 1), //布萊克繽拳套 
Array(1482159, 100, 1, 1), //布萊克繽指虎
Array(1492170, 100, 1, 1), //布萊克繽火槍
Array(1522085, 100, 1, 1), //布萊克繽雙弩槍 
Array(1532089, 100, 1, 1), //布萊克繽火炮 
Array(3010592, 100, 1, 1), //布萊克繽椅子
//暴君系列轉蛋
Array(1072743, 50, 1, 1),//暴君西亞戴斯靴
Array(1082543, 50, 1, 1),//暴君西亞戴斯手套
Array(1102481, 50, 1, 1),//暴君西亞戴斯披風
Array(1132174, 50, 1, 1),//暴君西亞戴斯腰帶

//冒險之心繫列轉蛋
Array(4033755, 800, 1, 0), //心之項鏈鏈子
Array(2431556, 780, 1, 1), //楓之谷勇士之心(劍士)
Array(2431561, 750, 1, 1), //高級楓之谷勇士之心(劍士)
//意志肩飾腰帶轉蛋
Array(4033667, 800, 1, 0),//意志盒

Array(1112915, 100, 1, 1) //藍調戒指
);

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用嗎？…我的肚子裡有各類#b奇特座椅或卷軸、裝備、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }

    if (status == 0) {
        if (cm.haveItem(5220040)) {
            cm.sendYesNo("楓之谷轉蛋機中有各類#b裝備、卷軸或稀有新奇的道具#k噢！使用「#b#t5220040##k」就可以交換. 遊戲商城中的「其他」－「遊戲」區裡有噢。 假如不買轉蛋券的話，是不可以使用我的。現在要玩轉蛋機麼? ");
        } else {
            cm.sendOk("你背包裡有#b#t5220040##k嗎?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 1000);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            if (cm.haveItem(5220040) && cm.canHold()) {
                if (notice == 1) {
                    cm.gainGachaponItem(itemId, quantity, "劍士轉蛋機");
                } else {
                    cm.gainItem(itemId, quantity);
                }
                cm.gainItem(5220040, -1);
                cm.sendOk("你獲得了 #b#t" + itemId + "##k " + quantity + "個。");
            } else {
                cm.sendOk("你確實有#b#t5220040##k嗎？如果是，請你確認在背包的裝備，消耗，其他窗口中是否有一格以上的空間。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的運氣可真差，什麼都沒有拿到。\r\n(獲得了安慰獎：榮譽勳章 一個。)");
            cm.gainItem(5220040, -1);
            cm.gainItem(2431174, 1);
            cm.safeDispose();
        }
    } else {
        cm.dispose();
    }
}
